{"machine_name": "linuxforprofessionalsapressspringer_bookbundle", "author": "Springer", "basic_data": {"eula": null, "human_name": "Humble Tech Book Bundle: Linux for Professionals by Apress/Springer", "detailed_marketing_blurb": "Humble Tech Book Bundles got you covered. Level up your Linux skills, learn to bend its unmatched power to your will, and create the most optimized operating systems around using the expertly crafted tools by Apress and Springer. This curated library of courses includes<em>Supercomputers for Linux SysAdmins</em>, <em>CompTIA Linux+ Certification Companion</em>, <em>Using and Administering Linux: Volume 1-2</em>, and more. Pay what you want and help support Room To Read with your purchase!", "short_marketing_blurb": "Live the Linux lifestyle", "media_type": "ebook", "description": "<p><strong>Live the Linux lifestyle.</strong> Humble Tech Book Bundles got you covered. Level up your Linux skills, learn to bend its unmatched power to your will, and create the most optimized operating systems around using the expertly crafted tools by Apress and Springer. This curated library of courses includes<em>Supercomputers for Linux SysAdmins</em>, <em>CompTIA Linux+ Certification Companion</em>, <em>Using and Administering Linux: Volume 1-2</em>, and more. Pay what you want and help support Room To Read with your purchase!</p>\n<p><strong>Pay $1 or more.</strong> Normally, the total cost for the ebooks in this bundle is as much as $1,304. Here at Humble Bundle, you choose the price and increase your contribution to upgrade your bundle! This bundle has a minimum $1 purchase.</p>\n<p><strong>Read them anywhere.</strong> The ebooks in this bundle are available in ePub formats, so they work on your computer, e-readers, iPads, cell phones, and a wide array of mobile devices! Instructions and a list of recommended reading programs can be found <a href=\"https://support.humblebundle.com/hc/articles/202712300\" rel=\"noopener\" target=\"_blank\">here</a>.</p>\n<p><strong>Support charity.</strong> Choose where the money goes - between the publisher and to support Room To Read. If you like what we do, you can leave us a Humble Tip too!</p>", "legal_disclaimer": null, "required_account_links": ["steam"], "end_time|datetime": "2025-11-24T19:00:00"}, "tier_item_data": {"probash_learntoscriptandprogramthegnuandlinuxshellthirdedition": {"human_name": "Pro Bash: Learn to Script and Program the GNU/Linux Shell, Third Edition", "machine_name": "probash_learntoscriptandprogramthegnuandlinuxshellthirdedition", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Apress", "publisher-url": "https://link.springer.com/book/10.1007/978-1-4842-9588-5?utm_medium=catalog&utm_source=sn-bks&utm_campaign=search_tool&utm_content=csv_title-list"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Learn how to effectively utilize the Bash shell in your programming. This refreshed and expanded third edition has been updated to Bash 5.2, and many scripts have been rewritten to make them more idiomatically Bash, taking better advantage of features specific to Bash. It is easy to read, understand, and will teach you how to get to grips with Bash programming without drowning you in pages and pages of syntax.Using this book you will be able to use the shell efficiently, make scripts run faster using expansion and external commands, and understand how to overcome many common mistakes that cause scripts to fail. This book is perfect for all beginning Linux and Unix system administrators who want to be in full control of their systems, and really get to grips with Bash programming.The Bash shell is a complete programming language, not merely a glue to combine external Linux commands. By taking full advantage of Shell internals, Shell programs can perform as snappily as utilities written in C or other compiled languages. And you will see how, without assuming UNIX lore, you can write professional Bash  programs through standard programming techniques.What You'll Learn Use the Bash shell to write utilities and accomplish most programming tasksReplace many external commands with shell parameter expansion making scripts very fastAvoid many common mistakes that cause scripts to failSee how Bash’s read line and history libraries can save typing when getting user inputBuild shell scripts that get information from the WebWho This Book Is ForDevelopers, programmers, and open source enthusiasts who want to write scripts using Bash on multiple platforms</p>", "user_ratings": {}, "developers": [{"developer-name": "Jayant Varma"}], "item_content_type": "ebook"}, "roomtoread": {"human_name": "Room to Read", "machine_name": "roomtoread", "youtube_link": null, "callout": null, "publishers": [], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "subtitle_html": null, "description_text": "<p><em>Donations to support Room to Read are made to&nbsp;<a href=\"https://support.humblebundle.com/hc/en-us/articles/205183597\" target=\"_blank\" rel=\"noopener\">PayPal Giving Fund</a>, subject to its policies.<br></em><br>We envision a world in which all children can pursue a quality education that enables them to reach their full potential and contribute to their communities and the world.</p>\n<p>Room to Read seeks to transform the lives of millions of children in low-income communities by focusing on literacy and gender equality in education. Working in collaboration with local communities, partner organizations and governments, we develop literacy skills and a habit of reading among primary school children, and support girls to complete secondary school with the relevant life skills to succeed in school and beyond.</p>", "user_ratings": {}, "developers": [{"developer-name": "Room to Read", "developer-url": "https://www.roomtoread.org/about/media/"}], "item_content_type": null}, "foundationsoflinuxdebuggingdisassemblingandreversing_analyzebinary": {"human_name": "Foundations of Linux Debugging, Disassembling, and Reversing: Analyze Binary Code, Understand Stack Memory Usage, and Reconstruct C/C++ Code with Intel x64", "machine_name": "foundationsoflinuxdebuggingdisassemblingandreversing_analyzebinary", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Apress", "publisher-url": "https://link.springer.com/book/10.1007/978-1-4842-9153-5?utm_medium=catalog&utm_source=sn-bks&utm_campaign=search_tool&utm_content=csv_title-list"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Review topics ranging from Intel x64 assembly language instructions and writing programs in assembly language, to pointers, live debugging, and static binary analysis of compiled C and C++ code. This book is ideal for Linux desktop and cloud developers.  Using the latest version of Debian, you’ll focus on the foundations of the diagnostics of core memory dumps, live and postmortem debugging of Linux applications, services, and systems, memory forensics, malware, and vulnerability analysis. This requires an understanding of x64 Intel assembly language and how C and C++ compilers generate code, including memory layout and pointers.  This book provides the back ground knowledge and practical foundations you’ll need in order to master internal Linux program structure and behavior. It consists of practical step-by-step exercises of increasing complexity with explanations and ample diagrams. You’ll also work with the GDB debugger and use it for disassembly and reversing.   By the end of the book, you will have a solid understanding of how Linux C and C++ compilers generate binary code. In addition, you will be able to analyze such code confidently, understand stack memory usage, and reconstruct original C/C++ code. Foundations of Linux Debugging, Disassembling, and Reversing is the perfect companion to Foundations of ARM64 Linux Debugging, Disassembling, and Reversing for readers interested in the cloud or cybersecurity. What You'll LearnReview the basics of x64 assembly languageExamine the essential GDB debugger commands for debugging and binary analysis Study C and C++ compiler code generation with and without compiler optimizations Look at binary code disassembly and reversing patternsSee how pointers in C and C++ are implemented and usedWho This Book Is ForSoftware support and escalation engineers, cloud security engineers, site reliability engineers, DevSecOps, platform engineers, software testers, Linux C/C++ software engineers and security researchers without Intel x64 assembly language background, beginners learning Linux software reverse engineering techniques, and engineers coming from non-Linux environments.</p>", "user_ratings": {}, "developers": [{"developer-name": "Dmitry Vostokov"}], "item_content_type": "ebook"}, "enterpriselinuxadministrator_journeytoanewlinuxcareer": {"human_name": "The Enterprise Linux Administrator: Journey to a New Linux Career", "machine_name": "enterpriselinuxadministrator_journeytoanewlinuxcareer", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Apress", "publisher-url": "https://link.springer.com/book/10.1007/978-1-4842-8801-6?utm_medium=catalog&utm_source=sn-bks&utm_campaign=search_tool&utm_content=csv_title-list"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Learn the basics, followed by the more advanced skills you will need to become an Enterprise Linux administrator. This book will prepare you to use Linux effectively with a clearer understanding of what is needed to successfully leverage new opportunities.After building a solid Linux knowledge foundation, you will learn how three major community Linux distributions are installed, configured, and used. The book will then guide you through all the different configurations a Linux administrator should know, along with some useful exercises for you to practice.  Moving on, you will look at Enterprise Linux distributions, and how they are installed and configured. This will be the step that will elevate you from being a Linux administrator to an enterprise Linux administrator. You will also learn how an enterprise Linux administrator configures Linux security, high availability, automation, and large-scale Linux deployments. These skills are required when working in larger Linux estates. Finally, you'll review backups, recovery, and some general troubleshooting. By the end of this book, you'll not only learn how to become an Enterprise Linux administrator but will also learn what certifications are vital when competing for new career opportunities.What You'll LearnInstall your own Linux environmentStudy the basics to configuring LinuxBecome an Enterprise Linux administrator and how to get thereReview comprehensive examples on how to use LinuxWho This Book Is For Those in the IT industry who have no Linux training or experience who wish to learn how to manage a Linux system</p>", "user_ratings": {}, "developers": [{"developer-name": "Kenneth Hitchcock"}], "item_content_type": "ebook"}, "linuxcontainersandvirtualization_utilizingrustforlinuxcontainers2e": {"human_name": "Linux Containers and Virtualization: Utilizing Rust for Linux Containers, 2E", "machine_name": "linuxcontainersandvirtualization_utilizingrustforlinuxcontainers2e", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Apress", "publisher-url": "https://link.springer.com/book/10.1007/978-1-4842-9768-1?utm_medium=catalog&utm_source=sn-bks&utm_campaign=search_tool&utm_content=csv_title-list"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>This book is a practical, comprehensive guide to creating secure and efficient Linux containers using the Rust programming language. It utilizes a hands-on approach to teach Rust's programming constructs, security features, and its application in containerization. Author Shashank Mohan Jain starts with a gentle introduction to Rust to help you grasp the language's core concepts, syntax, and unique memory safety guarantees. He then transitions into the realm of Linux container development, where Rust shines as a robust and secure language for building containerized applications. Through hands-on examples, you will gain a deep understanding of how to harness Rust's features to create lightweight and secure Linux containers and how to leverage its strong type system and ownership model to eliminate common bugs and ensure memory safety in containerized applications. As you progress, you’ll explore the intricacies of working with system resources, networking, and interacting withthe host operating system while maintaining isolation and security within the containers, as well as how Rust's concurrency model can build performant and responsive containerized applications. The book also covers advanced topics such as secure configuration handling, logging, and handling authentication within your containerized environment.  After completing this book, you will be well-versed in Rust programming, equipped to create efficient and secure Linux containers, and confident in your ability to develop containerized applications for a variety of use cases. What You Will Learn Understand the basics of the Rust programming languageUnderstand Rust's security featuresCreate Linux constructs like namespaces in RustDevelop your own container runtime using Rust  Who This Book Is For Developers, Architects and SREs working with cloud applications and dealing with container based workloads.</p>", "user_ratings": {}, "developers": [{"developer-name": "Shashank Mohan Jain"}], "item_content_type": "ebook"}, "foundationsofarm64linuxdebuggingdisassemblingandreversing_analyzec": {"human_name": "Foundations of ARM64 Linux Debugging, Disassembling, and Reversing: Analyze Code, Understand Stack Memory Usage, and Reconstruct Original C/C++ Code with ARM64", "machine_name": "foundationsofarm64linuxdebuggingdisassemblingandreversing_analyzec", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Apress", "publisher-url": "https://link.springer.com/book/10.1007/978-1-4842-9082-8?utm_medium=catalog&utm_source=sn-bks&utm_campaign=search_tool&utm_content=csv_title-list"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Gain a solid understanding of how Linux C and C++ compilers generate binary code. This book explains the reversing and binary analysis of ARM64 architecture now used by major Linux cloud providers and covers topics ranging from writing programs in assembly language, live debugging, and static binary analysis of compiled C and C++ code. It is ideal for those working with embedded devices, including mobile phones and tablets.  Using the latest version of Red Hat, you'll look closely at the foundations of diagnostics of core memory dumps, live and postmortem debugging of Linux applications, services, and systems. You'll also work with the GDB debugger and use it for disassembly and reversing. This book uses practical step-by-step exercises of increasing complexity with explanations and many diagrams, including some necessary background topics.  In addition, you will be able to analyze such code confidently, understand stack memory usage, and reconstruct original C/C++ code.   And as you'll see, memory forensics, malware, and vulnerability analysis, require an understanding of ARM64 assembly language and how C and C++ compilers generate code, including memory layout and pointers. This book provides the background knowledge and practical foundations you’ll need to understand internal Linux program structure and behavior.   Foundations of ARM64 Linux Debugging, Disassembling, and Reversing is the perfect companion to Foundations of Linux Debugging, Disassembling, and Reversing for readers interested in the cloud or cybersecurity.  What You'll LearnReview the basics of ARM64 assembly languageExamine the essential GDB debugger commands for debugging and binary analysis Study C and C++ compiler code generation with and without compiler optimizations  Look at binary code disassembly and reversing patterns See how pointers in C and C++ are implemented and usedWho This Book Is ForSoftware support and escalation engineers, cloud security engineers, site reliability engineers, DevSecOps, platform engineers, software testers, Linux C/C++ software engineers and security researchers without ARM64 assembly language background, and beginners learning Linux software reverse engineering techniques.</p>", "user_ratings": {}, "developers": [{"developer-name": "Dmitry Vostokov"}], "item_content_type": "ebook"}, "comptialinuxpluscertificationcompanion_hands-onpreparationtomaster": {"human_name": "CompTIA Linux+ Certification Companion: Hands-on Preparation to Master Linux Administration", "machine_name": "comptialinuxpluscertificationcompanion_hands-onpreparationtomaster", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Apress", "publisher-url": "https://link.springer.com/book/10.1007/979-8-8688-0128-0?utm_medium=catalog&utm_source=sn-bks&utm_campaign=search_tool&utm_content=csv_title-list"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>The CompTIA Linux+ Certification\" book – the ultimate guide to mastering Linux system administration in preparation for the CompTIA Linux+ Certification. Whether you're a beginner or an experienced professional, this comprehensive resource is designed to equip you with the knowledge and skills needed to excel in the world of Linux.With its comprehensive coverage, this book delves into essential Linux concepts, commands, and techniques, providing you with a complete reference guide. You'll review how to customize and navigate the shell environment, write powerful scripts, configure user interfaces, perform administrative tasks, configure system services, establish network connections, and secure your system. No stone is left unturned in this in-depth exploration of Linux administration.What sets this book apart is its practical approach. Real-world scenarios and practical applications take center stage, ensuring that you not only understand the theory but also know how to apply it effectively.Troubleshooting common issues becomes second nature as you gain the skills to diagnose and resolve system problems with ease. You'll discover industry best practices and standards, enabling you to optimize systems, implement robust security measures, and adhere to compliance regulations.What You Will Learn:Linux operating systems, including installation, configuration, and management of Linux-based servers and systems. Essential administrative tasks, such as user and group management, file system administration, network configuration, and security implementation.Insights into troubleshooting common Linux issues, enabling readers to diagnose and resolve system problems effectively. Practical techniques for identifying and addressing system errors, performance bottlenecks, network connectivity issues, and other challenges that may arise in a Linux environment.Industry best practices and standards in Linux administration. System optimization, backup and recovery strategies, security practices, and adherence to compliance regulations.Who This Book is for:Administrators: This book serves as an excellent resource for individuals who are new to Linux administration and wish to develop a strong foundation in this field. They may have basic knowledge of Linux concepts or come from related IT roles and seek to expand their skills to include Linux system management.IT Professionals Transitioning to Linux: Professionals already working in the IT industry, such as system administrators or network engineers, who want to enhance their skill set and broaden their knowledge by incorporating Linux administration into their repertoire. They may have experience with other operating systems and are seeking to acquire Linux-specific skills.Experienced Linux Administrators: Seasoned Linux administrators can benefit from this book as well. It serves as a comprehensive reference guide, offering advanced topics, best practices, and insights into the latest trends and developments in the Linux ecosystem. It can be a valuable resource for expanding their expertise and staying up-to-date with industry standards.Secondary or tertiary audiences may include IT managers, system architects, or developers who work closely with Linux systems and wish to gain a deeper understanding of Linux administration. Additionally, students pursuing computer science or IT-related degrees may find the book beneficial for their coursework and career advancement.</p>", "user_ratings": {}, "developers": [{"developer-name": "Ahmed F. Sheikh"}], "item_content_type": "ebook"}, "usingandadministeringlinux_volume3_zerotosysadmin_networkservices": {"human_name": "Using and Administering Linux: Volume 3: Zero to SysAdmin: Network Services", "machine_name": "usingandadministeringlinux_volume3_zerotosysadmin_networkservices", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Apress", "publisher-url": "https://link.springer.com/book/10.1007/978-1-4842-9786-5?utm_medium=catalog&utm_source=sn-bks&utm_campaign=search_tool&utm_content=csv_title-list"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>In Using and Administering Linux: Volume 3 you’ll work with multiple VMs on a single physical host to create a network in which to sharpen your sysadmin skills. Chapters have been fully updated to Fedora Linux 38 with expanded content and figures as well brand new material on the BTRFS file system, using Zram for swap, NetworkManager, automation with Ansible, as well as systemd.Focusing on network and other advanced services, this second edition of the final series volume builds upon the skills you have learned so far in volumes 1&amp;2 and will depend upon the virtual network and VMs created there.  Start by reviewing the administration of Linux servers and install and configure various Linux server services such as DHCP, DNS, NTP, and SSH server that will be used to provide advanced network services. You’ll then learn to install and configure servers such as BIND for name services, DHCP for network host configuration, and SSH for secure logins to remote hosts. Other topics covered include public/private keypairs to further enhance security, SendMail and IMAP and antispam protection for email, using Apache and WordPress to create and manage web sites, NFS, SAMBA, and Chrony.  This volume also covers SELinux and its use in making your systems even more secure., You will learn to build RPMs to be used to distribute automation scripts.  All of these services are installed on a single server host over the course of the book and by the time you are finished you will have a single server that provides these services for your network.  What You Will LearnInstall, configure, and manage several Linux server services such as email with spam management and single and multiple web sitesWork with NTP time synchronization, DHCP, SSH, and file sharing with Unix/Linux and Windows clientsCreate RPMs for distribution of scripts and administrative programs.Understand and work withenhanced security.       Who This Book Is ForThose who are already Linux power users – SysAdmins who can administer Linux workstation hosts that are not servers – who want to learn to administer the services provided by Linux servers such as web, time, name, email, SSH, and more.</p>", "user_ratings": {}, "developers": [{"developer-name": "David Both"}], "item_content_type": "ebook"}, "usingandadministeringlinux_volume1_zerotosysadmin_gettingstarted2e": {"human_name": "Using and Administering Linux: Volume 1: Zero to SysAdmin: Getting Started\n , 2E", "machine_name": "usingandadministeringlinux_volume1_zerotosysadmin_gettingstarted2e", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Apress", "publisher-url": "https://link.springer.com/book/10.1007/978-1-4842-9618-9?utm_medium=catalog&utm_source=sn-bks&utm_campaign=search_tool&utm_content=csv_title-list"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Learn to be a Linux sysadmin and an expert user of the Linux operating system, even with no previous Linux experience. This second edition of the popular and highly rated Linux self-study training course has been fully updated to Fedora Linux 37 with expanded and revised content and figures as well new chapters on the BTRFS file system, using Zram for swap, NetworkManager, automation with Ansible, and systemd.Like the previous version, this edition has been reviewed for technical accuracy by a highly respected Linux expert and will prepare you to manage complex systems with ease and equip you for a new career. It has also been reviewed by a student who took this course to ensure its readability and flow for those with little or no previous experience with Linux.In this first volume of the training course series, you will learn about operating systems in general and Linux in particular, and explore the Linux philosophy for SysAdmins in preparation for the rest of the course. This book provides you with the tools necessary for mastering user management; installing, updating, and deleting software; and using command line tools to do performance tuning and basic problem determination.You'll begin by creating a virtual network and installing an instance of Fedora – a popular and powerful Linux distribution – on a VirtualBox VM that can be used for all of the experiments on an existing Windows or Linux computer. You’ll then move on to the basics of using the Xfce GUI desktop and the many tools Linux provides for working on the command line including virtual consoles, various terminal emulators, Bash, and other shells.Explore data streams and the Linux tools used to manipulate them, and learn about the Vim text editor, which is indispensable to advanced Linux users and system administrators and be introduced to some other text editors. You’ll also see how to install software updates and new software, learn additional terminal emulators, and some advanced shell skills. Examine the sequence of events that take place as the computer boots and Linux starts up, configure your shell to personalize it in ways that can seriously enhance your command line efficiency, and delve into files and filesystems.What You Will LearnInstall Fedora Linux and basic configuration of the Xfce desktopAccess the root user ID, and the care that must be taken when working as rootUse Bash and other shells in the Linux virtual consoles and terminal emulatorsCreate and modify system configuration files with Use the Vim text editorExplore administrative tools available to root that enable you to manage users, filesystems, processes, and basic network communicationsConfigure the boot and startup sequencesWho This Book Is For Anyone who wants to learn Linux as an advanced user and system administrator at the command line while using the GUI desktop to leverage productivity.</p>", "user_ratings": {}, "developers": [{"developer-name": "David Both"}], "item_content_type": "ebook"}, "yoctoprojectcustomizationforlinux_theessentialguideforembeddeddeve": {"human_name": "Yocto Project Customization for Linux: The Essential Guide for Embedded Developers", "machine_name": "yoctoprojectcustomizationforlinux_theessentialguideforembeddeddeve", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Apress", "publisher-url": "https://link.springer.com/book/10.1007/979-8-8688-1435-8?utm_medium=catalog&utm_source=sn-bks&utm_campaign=search_tool&utm_content=csv_title-list"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Embedded computers have become very complex and are now called upon to solve a range of increasingly advanced problems. This added complexity means embedded systems need even more complex operating systems in order to work as required. The Yocto Project is now the effective standard for most embedded systems around the world due to its robustness and high configuration, availability of software packages and the ability to support several hardware platforms with common mechanisms so that developers can deploy their systems with ease regardless of the machine.  Yocto Project Customization for Linux is not just another book talking about the Yocto Project, but shows how the Yocto Build system really works. Developers can easily and quickly move from the demo Yocto Project distributions that silicon vendors rely on for their development kits to their final product. This book is a practical guide teaching you everything you need to know about writing new recipes and customizing existing ones by explaining the Build System internals and how to manage them for your ongoing projects. You Will Learn:  To understand Yocto Project internals and how Yocto Project tools work How to define a new meta layer or a new machine/distro in order to generate a custom Yocto Project image for their embedded system To generate a new Yocto Project recipe for your software, or to alter an already existing recipe in order to fit your needs How to update one or more packages on their running Yocto Project system How to optimize and effectively manage the Yocto Build System  Who is it for:  This is for embedded developers as well as Linux users who want to know more how to use Yocto</p>", "user_ratings": {}, "developers": [{"developer-name": "Rodolfo Giometti"}], "item_content_type": "ebook"}, "ansibleforkubernetesbyexample_automateyourkubernetesclusterwithans": {"human_name": "Ansible for Kubernetes by Example: Automate Your Kubernetes Cluster with Ansible", "machine_name": "ansibleforkubernetesbyexample_automateyourkubernetesclusterwithans", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Apress", "publisher-url": "https://link.springer.com/book/10.1007/978-1-4842-9285-3?utm_medium=catalog&utm_source=sn-bks&utm_campaign=search_tool&utm_content=csv_title-list"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 18.0}, "subtitle_html": null, "description_text": "<p>Learn how to automate your Kubernetes infrastructure using Ansible. This book will enable you to automate more tasks and save time with this human-readable platform. Containerized microservices deployed via Kubernetes allows you to save time, reduce human interaction and errors, and create applications that are more robust. You’ll learn how to automate the most redundant activities such as reports, services, the launch of a pod, adding permanent storage, configuring load balancing, and adding or modifying any Kubernetes parameter. You'll also gain an understanding of end-to-end use cases and how advanced cluster automation, such as Helm packages and node states, are evolving. Each lesson utilizes a specific use-case for the modern Kubernetes cluster and focuses on a single module from the most crucial parameter, complete with code demonstrations. Each code example is battle-proven in real-life with console interaction and verification.What You'll LearnAutomate Kubernetes cluster management, cloud services, pods, and storage with AnsibleConfigure your Ansible controller node Write and execute Ansible Playbook code that follows best practices Augment your productivity by applying Infrastructure as Code (IaC)Troubleshoot Ansible Who This Book Is ForIT professionals who would like a jargon-free understanding of Ansible technology, Windows Systems Administrators, DevOps professionals, thought leaders, and infrastructure-as-code enthusiasts.</p>", "user_ratings": {}, "developers": [{"developer-name": "Luca Berton"}], "item_content_type": "ebook"}, "systemdforlinuxsysadmins_allyouneedtoknowaboutthesystemdsuiteforli": {"human_name": "systemd for Linux SysAdmins: All You Need to Know About the systemd Suite for Linux Users", "machine_name": "systemdforlinuxsysadmins_allyouneedtoknowaboutthesystemdsuiteforli", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Apress", "publisher-url": "https://link.springer.com/book/10.1007/979-8-8688-1328-3?utm_medium=catalog&utm_source=sn-bks&utm_campaign=search_tool&utm_content=csv_title-list"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Explore the world of systemd—yes, all lower-case, even at the beginning of a sentence— which is the modern replacement for init and SystemV init scripts. It is also much more.  It can evoke a wide range of reactions from SysAdmins and others responsible for keeping Linux systems up and running. The fact that systemd is taking over so many tasks in modern Linux systems has engendered push-back and discord among certain groups of developers and SysAdmins. You will learn systemd’s strengths and weaknesses, and why there’s no truth in the myth that systemd is a monolithic monstrosity.Learn how systemd is the mother of all processes, and is responsible for bringing the Linux host up to a state in which productive work can be done. You’ll learn about the functions assumed by systemd, which is far more extensive than the old init program, and how it manages many aspects of a running Linux host, including:   Mounting filesystems   Managing hardware   Creating new systemd services and understanding existing ones   Creating timers that trigger system maintenance events   Starting and managing the system services that are required to have a productive Linux host   Using the systemd journal to access critical performance and problem solving information.   Why the systemd plan to take over the world is actually a good thing   systemd for Linux SysAdmins is your one-stop shop, giving you everythiing you need  to get started and utilize this software suite for Linux operatiing systems. You Will Learn:  How to use systemd, what it is, and what it does To manage each of the major functional components of systemd and learn from real-world examples to illustrate their typical usage by SysAdmins Pragmatic work-arounds, hints and tricks to minimize issues to ensure you have greater systemd functionality  This Book is for: Linux system administrators (SysAdmins) who need to or are already in the process of switching from SystemV to systemd. It’s also intended for SysAdmins with more systemd experience but who want to improve their knowledge and skills with systemd.</p>", "user_ratings": {}, "developers": [{"developer-name": "David Both"}], "item_content_type": "ebook"}, "certifiedkubernetesadministratorstudycompanion_preparingforthelinu": {"human_name": "Certified Kubernetes Administrator Study Companion: Preparing for the Linux Foundation's CKA Exam", "machine_name": "certifiedkubernetesadministratorstudycompanion_preparingforthelinu", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Apress", "publisher-url": "https://link.springer.com/book/10.1007/979-8-8688-1513-3?utm_medium=catalog&utm_source=sn-bks&utm_campaign=search_tool&utm_content=csv_title-list"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>The Kubernetes landscape is constantly evolving, making it crucial to stay updated on the latest best practices and technologies. Using a structured approach and practical applications, this comprehensive study companion is designed to help individuals prepare for the Certified Kubernetes Administrator (CKA) exam.  You’ll start by reviewing a range of essential topics that serve as prerequisites for certification, such as what Kubernetes is, its architecture, and key components like the Control Plane, ApiServer, and ETCD. The book then addresses workloads and scheduling, providing insights into pods, deployments, and various resource management techniques. Additionally, you’ll explore storage management in Kubernetes, detailing persistent volumes, access modes, and storage classes. Networking topics, including pod connectivity, CoreDNS, and network policies are covered as well.  Throughout the book, troubleshooting techniques are emphasized, focusing on monitoring cluster components and application performance. Most importantly, the book offers guidance on exam preparation, including patterns, prerequisites, and last-minute tips, along with sample questions to aid your study process. Whether you're new to Kubernetes or actively studying for the CKA certification, this book will serve as your essential resource. What You Will Learn  Kubernetes fundamentals, including architecture, components, and installation. In-depth knowledge on workloads and scheduling, covering pods, deployments, and services. Essential insights into storage management, networking, and cluster architecture. Troubleshooting techniques for monitoring and resolving issues in Kubernetes environments. Exam preparation tips, including sample questions and strategies for success.  Who This Book Is For College students, recent graduates, IT professionals in the Cloud/DevOps domain, individuals transitioning into Cloud/DevOps roles, Kubernetes administrators, and DevOps engineers.</p>", "user_ratings": {}, "developers": [{"developer-name": "Piyush Sachdeva"}], "item_content_type": "ebook"}, "assemblylanguagereimagined_programmingtheintelx64microprocessorinl": {"human_name": "Assembly Language Reimagined: Programming the Intel x64 Microprocessor in Linux", "machine_name": "assemblylanguagereimagined_programmingtheintelx64microprocessorinl", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Apress", "publisher-url": "https://link.springer.com/book/10.1007/979-8-8688-1724-3?utm_medium=catalog&utm_source=sn-bks&utm_campaign=search_tool&utm_content=csv_title-list"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Learning assembly language won’t make you a faster programmer. It won’t enable you to create portable, write-once, run-anywhere programs. So why learn it? The answer is that it will make you a better programmer. Author John Schwartzman takes a fresh look at low-level programming and explores how to write programs using the BIOS and glibc. This laboratory-based book aids the writing of high-level structured programs by showing what the processor can and can’t do and how it does it. You’ll take apart high-level structured C/C++ and show what the CPU is doing at every stage of the program. The book introduces programs and activities throughout the development process, providing sample code, makefiles, and shell scripts for each example program. With the help of Assembly Language Reimagined you’ll become a more capable and versatile computer engineer. What You will Learn   Explore a new perspective on the Intel x64 microprocessor for low-level programming Understand what a processor is doing while a high-level structured computer language program is being run  Solve problems with the help of software.  See why assembly language programming is essential for every serious student of computer science  Who This Book Is For  Embedded Linux and Assembly developers, engineers and programmers, hobbyists from the Maker community, as well as college and graduate level students who have some prior knowledge of a structured high-level language like C or C++</p>", "user_ratings": {}, "developers": [{"developer-name": "John Schwartzman"}], "item_content_type": "ebook"}, "supercomputersforlinuxsysadmins_managingmodernhpcclustersandsuperc": {"human_name": "Supercomputers for Linux SysAdmins: Managing Modern HPC Clusters and Supercomputers from Software to Hardware", "machine_name": "supercomputersforlinuxsysadmins_managingmodernhpcclustersandsuperc", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Apress", "publisher-url": "https://link.springer.com/book/9798868815997?utm_medium=catalog&utm_source=sn-bks&utm_campaign=search_tool&utm_content=csv_title-list"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Supercomputers and High Performance Computing (HPC) clusters are not so exotic as people imagine these days. They give companies the power of computation like no one server can give alone.  They make new drugs and materials discoveries, universe modeling and AI training, crash simulations and market research possible – all thanks to HPC clusters. Building or renting a HPC cluster is not so difficult either as cloud providers can give you resources to build one cheap and performative enough to use yourself, so If you are or want to become HPC cluster Sysadmin or manager, this book is for you. Supercomputers for Linux SysAdmins delves into the world of modern HPC cluster architecture, hardware, software and resources management using a Linux/UNIX based approach. The number of HPC clusters is growing with an estimated 30 billion by 2030 but there are not enough sysadmins to run and manage them, this book serves to bridge this gap to help more Sysadmins and managers to transition into the exiting world of HPCs.  This book helps those with a strong foundational knowledge in Linux, to deal with supercomputers and HPC clusters. We start with the basic principles of supercomputer management, fundamentals of Linux and UNIX, Shell Scripting and systemd and well as other open source tools and frameworks, taking you thorough the security, monitoring and hardware requirements for supercomputers and HPC clusters. You Will Learn:  How to plan new supercomputers The main principles and technologies used in supercomputers and HPC clusters How to set up the software environments on new supercomputers  To set up supercomputer and HPC cluster resources and jobs management To manage accounts, resource sharing and many more.  Who is it for:  The main audience of this book are regular UNIX/Linux sysadmins and managers, who should deal with HPC clusters on-prem or in cloud and those who are interested in supercomputers and HPC clusters and how to utilize them in their projects and teams.</p>", "user_ratings": {}, "developers": [{"developer-name": "Sergey Zhumatiy"}], "item_content_type": "ebook"}, "kubernetesrecipes_apracticalguideforcontainerorchestrationanddeplo": {"human_name": "Kubernetes Recipes: A Practical Guide for Container Orchestration and Deployment", "machine_name": "kubernetesrecipes_apracticalguideforcontainerorchestrationanddeplo", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Apress", "publisher-url": "https://link.springer.com/book/10.1007/979-8-8688-1325-2?utm_medium=catalog&utm_source=sn-bks&utm_campaign=search_tool&utm_content=csv_title-list"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Kubernetes Recipes is your essential guide to using Kubernetes for container orchestration providing a hands-on, problem-solving approach to address the intricacies of deployment, scaling, and day-to-day operations. The book's format, organized for easy lookup, ensures that you can swiftly find detailed solutions to your challenges in your Kubernetes journey. Beginning with the fundamentals, the book covers Kubernetes installation, working with the Kubernetes API, and understanding application primitives for efficient deployment. It teaches monitoring and troubleshooting strategies, providing practical insights into handling issues that may arise in your clusters. Whether new to Kubernetes or seeking advanced insights, the book covers a broad spectrum of topics, including managing specialized workloads, handling volumes and configuration data, implementing scaling strategies, and ensuring security. Kubernetes Recipes is not merely a theoretical guide; it equips you with practical skills for everyday tasks, such as using the Kubernetes client effectively, creating and modifying fundamental workloads, managing services, and exploring the Kubernetes API. It doesn't stop at the basics but extends to advanced areas like developing Kubernetes, monitoring and logging practices, and exploring the ecosystem with tools like Helm. With this comprehensive guide, you not only build a strong foundation in Kubernetes but also gain insights into the intricacies of its ecosystem. Whether you are looking to troubleshoot common issues, implement security measures, or develop applications for Kubernetes, this book is your go-to resource. It provides practical, actionable solutions for every step of learning this industry-leading containerization platform. You will:  Learn how to orchestrate cloud-native applications and apply the design to new and existing applications.  Acquire practical skills in deploying applications on Kubernetes, covering installations, CLI usage, and local instance management.  Learn cluster management techniques using tools, explore diverse creation methods, and deploy on popular cloud platforms. Gain an awareness of the debugging methods and tools available in Kubernetes. Understand how to Implement security best practices, control access, and secure pods while also gaining proficiency in monitoring resources, accessing logs, and handling common troubleshooting scenarios in Kubernetes environments.  The Book is for: Developers, System Administrators, DevOps Professionals as well as Project Managers, students and researchers</p>", "user_ratings": {}, "developers": [{"developer-name": "Grzegorz Stencel; Luca Berton"}], "item_content_type": "ebook"}, "linuxforsmallbusinessowners_usingfreeandopensourcesoftwaretopowery": {"human_name": "Linux for Small Business Owners: Using Free and Open Source Software to Power Your Dreams", "machine_name": "linuxforsmallbusinessowners_usingfreeandopensourcesoftwaretopowery", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Apress", "publisher-url": "https://link.springer.com/book/10.1007/978-1-4842-8264-9?utm_medium=catalog&utm_source=sn-bks&utm_campaign=search_tool&utm_content=csv_title-list"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 18.0}, "subtitle_html": null, "description_text": "<p>Learn how you can take complete control and run your small business with powerful, free open source software (FOSS). This book introduces small business owners to the power and security of Linux and other FOSS tools to manage any small business as well as the many advantages it has over expensive, proprietary software. While exploring the reasons for using Free Open Source Software, you'll investigate the assertion that, “The value of any software lies in its usefulness not in its price,” set forth by Linux Torvalds, the creator of Linux.  This book examines the use of Linux and also the other Free Open Source Software you need to meet your business challenges including the usual accounting, Email, web browsing, word-processing tasks. You will be introduced to advanced tools such as those that enable you to create audio and video clips you can use to promote your business or that can even be your primary product, such as how-to instruction. Most small business owners perform many tasks including that of administering their computers. This book shows you how to find and install new software you need to run your business and keep it up to date using the tools already provided by Linux and the secure, trusted repositories available online. It also explores how to decide which tasks to do in-house and which you might want to sub out to external resources such as advertising and contact services to attract and keep customers.  Linux for Small Business Owners provides some logic, reason, and explanation for each of the steps that are needed and the tools used to implement Linux in your small business. It is a detailed guide to removing Windows from your computers and installing Linux and some commonly used open source software like the LibreOffice suite of programs, accounting, and other software useful to many small businesses. It also provides the information and tools necessary to manage and maintain Linux and applications up-to-date and secure.What You'll Learn Understand what the term \"free/open source\" means and how you can apply it to your business.Look at the operational and financial advantages of using Free Open Source Software instead of expensive, proprietary software.See why you will never need to pay for anti-virus and anti-malware software again.Replace expensive software like Microsoft Office with open source tools such as LibreOffice Review the factors required to make an informed decision about switching to Linux.Install new applications, updates to Linux, and the application software.Explore why backups are critical, how to create them, and how to use them to restore lost data. Who This Book Is For Ideal for small business owners and owner-operated small businesses looking to streamline operations,save money, time and energy managing the common problems associated with using more popular operating systems.</p>", "user_ratings": {}, "developers": [{"developer-name": "David Both, Cyndi Bulka"}], "item_content_type": "ebook"}, "linuxsystemadministrationforthe2020s_themodernsysadminleavingbehin": {"human_name": "Linux System Administration for the 2020s: The Modern Sysadmin Leaving Behind the Culture of Build and Maintain", "machine_name": "linuxsystemadministrationforthe2020s_themodernsysadminleavingbehin", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Apress", "publisher-url": "https://link.springer.com/book/10.1007/978-1-4842-7984-7?utm_medium=catalog&utm_source=sn-bks&utm_campaign=search_tool&utm_content=csv_title-list"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 1.0}, "subtitle_html": null, "description_text": "<p>Build and manage large estates, and use the latest OpenSource management tools to breakdown a problems. This book is divided into 4 parts all focusing on the distinct aspects of Linux system administration.  The book begins by reviewing the foundational blocks of Linux and can be used as a brief summary for new users to Linux and the OpenSource world. Moving on to Part 2 you'll start by delving into how practices have changed and how management tooling has evolved over the last decade. You’ll explore new tools to improve the administration experience, estate management and its tools, along with automation and containers of Linux.  Part 3 explains how to keep your platform healthy through monitoring, logging, and security. You'll also review advanced tooling and techniques designed to resolve technical issues. The final part explains troubleshooting and advanced administration techniques, and less known methods for resolving stubborn problems. With Linux System Administration for the 2020s you'll learn how to spend less time doing sysadmin work and more time on tasks that push the boundaries of your knowledge.  What You'll Learn Explore a shift in culture and redeploy rather than fix Improve administration skills by adopting modern toolingAvoid bad practices and rethink troubleshootingCreate a platform that requires less human intervention  Who This Book Is For Everyone from sysadmins, consultants, architects or hobbyists.</p>", "user_ratings": {}, "developers": [{"developer-name": "Kenneth Hitchcock"}], "item_content_type": "ebook"}, "usingandadministeringlinux_volume2_zerotosysadmin_advancedtopics2e": {"human_name": "Using and Administering Linux: Volume 2: Zero to SysAdmin: Advanced Topics\n , 2E", "machine_name": "usingandadministeringlinux_volume2_zerotosysadmin_advancedtopics2e", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Apress", "publisher-url": "https://link.springer.com/book/10.1007/978-1-4842-9615-8?utm_medium=catalog&utm_source=sn-bks&utm_campaign=search_tool&utm_content=csv_title-list"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Learn to be a Linux sysadmin and an expert user of the Linux operating system, even with no previous Linux experience. This second edition of the popular and highly rated Linux self-study training course has been fully updated to Fedora Linux 37 with expanded and revised content and figures as well new chapters on the BTRFS file system, using Zram for swap, NetworkManager, automation with Ansible, and systemd.Like the previous version, this edition has been reviewed for technical accuracy by a highly respected Linux expert and will prepare you to manage complex systems with ease and equip you for a new career. It has also been reviewed by a student who took this course to ensure its readability and flow for those with little or no previous experience with Linux. This second volume builds upon what you learned in the first and depends upon the virtual network and virtual machine created there.You’ll see how to manage and monitor running processes, discover the power ofthe special filesystems, monitor and tune the kernel while it is running – without a reboot. You’ll then turn to regular expressions and the power that using them for pattern matching can bring to the command line, and learn to manage printers and printing from the command line and unlock the secrets of the hardware on which your Linux operating system is running.Experiment with command line programming and how to automate various administrative tasks, networking, and the many services that are required in a Linux system. Use the logs and journals to look for clues to problems and confirmation that things are working correctly, and learn to enhance the security of your Linux systems and how to perform easy local and remote backups. What You Will LearnUnderstand Logical Volume Management, using file managers, and special filesystemsExploit everything is a filePerform command line programming and basic automationConfigure printers and manage other hardwareManage system services with systemd, user management, security, and local and remote backups using simple and freely available tools Who This Book Is For Anyone who wants to continue to learn Linux in depth as an advanced user and system administrator at the command line while using the GUI desktop to leverage productivity.</p>", "user_ratings": {}, "developers": [{"developer-name": "David Both"}], "item_content_type": "ebook"}, "deploycontainerapplicationsusingkubernetes_implementationswithmicr": {"human_name": "Deploy Container Applications Using Kubernetes: Implementations with microk8s and AWS EKS", "machine_name": "deploycontainerapplicationsusingkubernetes_implementationswithmicr", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Apress", "publisher-url": "https://link.springer.com/book/10.1007/978-1-4842-9277-8?utm_medium=catalog&utm_source=sn-bks&utm_campaign=search_tool&utm_content=csv_title-list"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 18.0}, "subtitle_html": null, "description_text": "<p>Navigate through the Kubernetes landscape to create and deploy container-based applications. This book will show you how to choose between the various available container-based operating systems, and how to design a better continuous integration pipeline for your container images, where to store them, and how to scan and secure them.  In the first half of the book, you'll learn the practical tips on how to setup the system for visibility and troubleshooting, how to reduce the attack vector and reduce risks. The second half of the book focuses on Kubernetes, the popular container orchestration system. You'll see how to setup your Kubernetes for practical applications such as show/chargeback using tagging, efficient use of namespaces and pods, various isolation layers. It also shows you how to integrate with popular implementations of K8S such as AWS EKS (Elastic Container Service), GCP Google Kubernetes Engine (GKE) in touch points such as authentication and authorization, optimization, logging and troubleshooting tools, etc. By practicing the scenarios given in this book, you will be able to make better design choices that are appropriate for the constraints you are working with. Deploy Container Applications Using Kubernetes is your go-to resource for an optimal deployment of workloads using containers and Kubernetes in both public and private cloud settings. What You'll LearnUnderstand the various design choices, their pros and cons Build a better CI/CD pipeline for your containers and KubernetesDeploy your first container application in a public cloud K8S engineImprove your existing K8S deployment for efficiency and eleganceWho This Book Is For IT Platform Architects, System Engineers/, and System Administrators</p>", "user_ratings": {}, "developers": [{"developer-name": "Shiva Subramanian"}], "item_content_type": "ebook"}, "practicallinuxdevops_buildingalinuxlabformodernsoftwaredevelopment": {"human_name": "Practical Linux DevOps: Building a Linux Lab for Modern Software Development", "machine_name": "practicallinuxdevops_buildingalinuxlabformodernsoftwaredevelopment", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Apress", "publisher-url": "https://link.springer.com/book/10.1007/978-1-4842-8318-9?utm_medium=catalog&utm_source=sn-bks&utm_campaign=search_tool&utm_content=csv_title-list"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 1.0}, "subtitle_html": null, "description_text": "<p>Learn, develop and hone your Linux and DevOps skills by building a lab for learning, testing and exploring the latest Linux and open-source technologies. This book helps Linux users and others to master modern DevOps practices using a wide range of software and tools. Having a home or work-based Linux lab is indispensable to anyone looking to experiment with the ever-evolving landscape of new software and DevOps. With open-source tools and readily available hardware, you will end up with a lab you can use to try virtually any modern software, including Chef, Docker, Kubernetes and stalwarts like DNS, Dovecot, and Postfix for email. You'll  set up pipelines for software deployment and focus on discrete projects that help you learn through doing. In the end, you'll acquire the skills needed to become better informed, more marketable engineers and developers, and better able to take on a wide array of software projects with confidence. Practical Linux DevOps is the perfect companion for those who want to learn how to build systems with utility and learn about modern hardware and software practices. What You'll LearnSet up a Linux-based virtualization environment and workstationCreate a lab network with a fully qualified domainBuild web-based applications with NGINX and LAMP Use version-control tools like GitAutomate deployments and configurations Think like a modern DevOps engineerWho This Book Is For  New and modestly experienced users with basic understanding of a basic understanding of Windows or Linux command line, as well as would-be and current DevOps engineers, and full-stack and other software developers</p>", "user_ratings": {}, "developers": [{"developer-name": "John S. Tonello"}], "item_content_type": "ebook"}, "introductiontoansiblenetworkautomation_apracticalprimer": {"human_name": "Introduction to Ansible Network Automation: A Practical Primer", "machine_name": "introductiontoansiblenetworkautomation_apracticalprimer", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Apress", "publisher-url": "https://link.springer.com/book/10.1007/978-1-4842-9624-0?utm_medium=catalog&utm_source=sn-bks&utm_campaign=search_tool&utm_content=csv_title-list"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>This book provides a comprehensive learning journey aimed at helping you master Ansible and efficiently automate a range of enterprise network devices, such as routers, switches, firewalls, Wireless LAN Controller (WLC), and Linux servers. Introduction to Ansible Network Automation combines the fundamentals of three books into one, covering basics of Linux administration, Ansible concepts, and Ansible network automation. Authors Brendan Choi and Erwin Medina have created a structured learning path that starts with the fundamentals and allows you to progressively enhance your skill sets with each chapter. Part I serves as an Ansible primer, guiding you through Linux basics using WSL on Windows 11 and assisting in the setup of your learning environment. Part II covers essential Ansible concepts through practical lab activities involving four Linux servers. In Part III, you will learn how to apply your Linux skills from Part I and the concepts from Part II to real-world scenarios by creating Ansible automation YAML scripts. What sets this book apart is its unique focus on Ansible and Network Automation, combined with a strong emphasis on understanding Linux. It is specifically designed for novice network automation engineers and students, assuming no prior Linux expertise, and provides first-hand experience starting from scratch. It also offers practical insights by sharing real-life examples of Ansible playbooks derived from production enterprise infrastructure, allowing you to gain an understanding of how Ansible can be effectively applied in real-world enterprise network environments.  Upon completion of this book, you will have developed foundational skills in Ansible network automation and general Linux administration, and will understand how to apply this newly acquired knowledge to real-life scenarios.  What You Will Learn Develop a comprehensive understanding of Ansible and its essentialconcepts for automating enterprise network devices and applying them to real-world scenariosMaster the basics of Ansible operations within Linux automation and progress to applying Ansible concepts specifically to network device automationExecute Ansible ad-hoc commands and playbooks for a range of network operational tasks, including configuration management, software and system updates, and upgradesWork with real-life examples of Ansible playbooks derived from actual enterprise infrastructure, gaining practical experience in writing Ansible YAML scriptsAcquire the skills to automate network operations using Ansible, streamline network management processes, and replace manual-driven tasks with directives in Ansible playbooks   Who is This Book For Network, security, UC and systems engineers, as well as technical leaders, IT managers and network students.</p>", "user_ratings": {}, "developers": [{"developer-name": "Brendan Choi; Erwin Medina"}], "item_content_type": "ebook"}, "oracleondocker_runningoracledatabasesinlinuxcontainers": {"human_name": "Oracle on Docker: Running Oracle Databases in Linux Containers", "machine_name": "oracleondocker_runningoracledatabasesinlinuxcontainers", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Apress", "publisher-url": "https://link.springer.com/book/10.1007/978-1-4842-9033-0?utm_medium=catalog&utm_source=sn-bks&utm_campaign=search_tool&utm_content=csv_title-list"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Discover the benefits of running Oracle databases in Linux containers. This book approaches containers from the perspective of database administrators, developers, and systems administrators. It explains the differences between containers and virtual machines and describes why containers deliver greater speed, flexibility, and portability, with lower resource requirements. You’ll learn how running Oracle databases in containers complements existing database infrastructure and accelerates development, and you’ll understand the advantages they offer for test and validation environments. This book teaches you how to begin working with Oracle databases in Docker, covering the steps for preparing and installing software on Windows, Mac, and Linux systems. It describes the steps for deploying Oracle databases, separating data and configurations from database software, and networking and communicating with your containers. It introduces the Docker commands you’ll use for managingcontainers, including tips and shortcuts to make everyday tasks easier. Databases have unique demands for performance and reliability, and this book addresses those qualities with discussions on protecting, persisting, and distributing data. Other books may overlook these topics and approach containers as disposable commodities in serverless environments or convenient coding platforms. You’ll gain battle-tested insights for customizing and extending your containers to meet different needs.  The opening chapters concentrate on the practical steps of running Oracle databases in Docker. Once you’re comfortable with container terminology and methods, you’ll look deeper at the real power behind containers—preparing and building images, and the templates that form the foundation beneath every container. You’ll begin by modifying publicly available image manifests, or Dockerfiles, following multiple examples that add functionality and capabilities to your databases. You’lldiscover methods for using run-time options to create flexible and extensible images that adapt to real-world requirements.  Within the pages, you’ll see how Oracle and Docker empower you to confidently build and deploy systems. It’s written with databases and database users in mind and delivers practical advice based on the author’s real-world, battle-tested experiences deploying and running Oracle databases in containers since 2014. With Oracle databases in containers, database administrators have the ideal platform for evaluating performance, practicing database upgrades and migrations, validating backup and recovery processes, and hardening environments. Developers will find that the marriage of Oracle and Docker simplifies code and application tests. Docker’s unique ability to isolate data artifacts improves reliability and confidence in test and QA processes. If you’re a database administrator, this book will help you join the container revolution sweeping the industry and making IT professionals more productive than ever!  What You Will Learn Recognize when and why to use containers for an Oracle databaseUnderstand container terminology and architectureCreate and customize Oracle databases in containersBuild and extend images and containers for multiple usesStore and persist data beyond the container ecosystemUse popular database tools with databases in containersExplore container networking and connect multiple container databasesManage, monitor, and secure containersWrite Dockerfiles to support custom requirementsPackage and deploy data artifacts that accelerate development, test, and QA activitiesWho This Book Is For Database administrators, developers, and systems administrators who want to be more productive by running Oracle databases in Linux containers</p>", "user_ratings": {}, "developers": [{"developer-name": "Sean Scott"}], "item_content_type": "ebook"}}, "charity_data": {"charity_items": {"roomtoread": {"machine_name": "roomtoread", "youtube_link": null, "item_content_type": null, "subtitle_html": null, "description_text": "<p><em>Donations to support Room to Read are made to&nbsp;<a href=\"https://support.humblebundle.com/hc/en-us/articles/205183597\" target=\"_blank\" rel=\"noopener\">PayPal Giving Fund</a>, subject to its policies.<br></em><br>We envision a world in which all children can pursue a quality education that enables them to reach their full potential and contribute to their communities and the world.</p>\n<p>Room to Read seeks to transform the lives of millions of children in low-income communities by focusing on literacy and gender equality in education. Working in collaboration with local communities, partner organizations and governments, we develop literacy skills and a habit of reading among primary school children, and support girls to complete secondary school with the relevant life skills to succeed in school and beyond.</p>", "human_name": "Room to Read", "developers": [{"developer-name": "Room to Read", "developer-url": "https://www.roomtoread.org/about/media/"}], "publishers": [], "user_ratings": {}}}}, "from_bundle": {"machine_name": "linuxforprofessionalsapressspringer_bookbundle", "tile_short_name": "Linux for Professionals by Apress/Springer", "short_marketing_blurb": "Live the Linux lifestyle", "marketing_blurb": "Get <em>Practical Linux DevOps: Building a Linux Lab for Modern Software Development</em>, <em>Using and Administering Linux: Volume 1: Zero to SysAdmin: Getting Started\n , 2E</em>, and more!", "detailed_marketing_blurb": "Humble Tech Book Bundles got you covered. Level up your Linux skills, learn to bend its unmatched power to your will, and create the most optimized operating systems around using the expertly crafted tools by Apress and Springer. This curated library of courses includes<em>Supercomputers for Linux SysAdmins</em>, <em>CompTIA Linux+ Certification Companion</em>, <em>Using and Administering Linux: Volume 1-2</em>, and more. Pay what you want and help support Room To Read with your purchase!", "author": "Springer", "start_date|datetime": "2025-11-03T19:00:00", "end_date|datetime": "2025-11-24T19:00:00", "type": "bundle", "product_url": "/books/linux-for-professionals-apressspringer-books"}, "updated_at|datetime": "2025-11-04T03:19:54.939651", "first_seen_at|datetime": "2025-11-04T03:19:54.939651"}
{"machine_name": "citymistmythosawakenedcollectionforalchemyvtt_softwarebundle", "author": "Alchemy RPG", "basic_data": {"eula": null, "human_name": "Humble VTT Bundle: City of Mist Mythos Awakened Collection for Alchemy VTT", "detailed_marketing_blurb": "Play the hottest RPG, <em>City of Mist</em>, with meaningful theatrical enhancements using the City of Mist Mythos Awakened Collection for Alchemy VTT! Start your journey on the right foot with the core set, Player’s Guide, and more. Feel empowered as a GM to push the envelope of your adventures with Alchemy’s unmatched enhancements like animated scenes, ambient sound, and music. Elevate your campaign’s immersion, scale, and overall experience with the City of Mist Mythos Awakened Collection for Alchemy VTT—and help support the Michael J. Fox Foundation with your purchase!", "short_marketing_blurb": "City of Mist x Alchemy VTT", "media_type": "software", "description": "<p><strong>City of Mist x Alchemy VTT.</strong> Play the hottest RPG, <em>City of Mist</em>, with meaningful theatrical enhancements using the City of Mist Mythos Awakened Collection for Alchemy VTT! Start your journey on the right foot with the core set, <em>Player’s Guide</em>, and more. Feel empowered as a GM to push the envelope of your adventures with Alchemy’s unmatched enhancements like animated scenes, ambient sound, and music. Elevate your campaign’s immersion, scale, and overall experience with the City of Mist Mythos Awakened Collection for Alchemy VTT—and help support the Michael J. Fox Foundation with your purchase!</p>\n<p><strong>Pay $1 or more.</strong> Normally, the total cost for the software in this bundle is as much as $174. Here at Humble Bundle, you choose the price and increase your contribution to upgrade your bundle! This bundle has a minimum $1 purchase. Pay $1 or more to access keys.</p>\n<p><strong>Redeem your keys.&nbsp;</strong>The content in this bundle are redeemable on the <a href=\"https://app.alchemyrpg.com\">Alchemy</a> website. Instructions and a list of recommended reading programs can be found <a href=\"https://support.humblebundle.com/hc/en-us/articles/42837181739163-Humble-VTT-Bundle-City-of-Mist-Mythos-Awakened-Collection-for-Alchemy-VTT-Redemption-Instructions\">here.</a>&nbsp;PDF versions of the books are downloadable on the Alchemy app.</p>\n<p><strong>Support charity.</strong> Choose where the money goes - between the publisher and to support The Michael J Fox Foundation for Parkinsons. If you like what we do, you can leave us a Humble Tip too!</p>", "legal_disclaimer": null, "required_account_links": ["steam"], "end_time|datetime": "2025-11-24T19:00:00"}, "tier_item_data": {"cityofmist_starterset": {"human_name": "City of Mist: Starter Set\n", "machine_name": "cityofmist_starterset", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Alchemy VTT", "publisher-url": "https://app.alchemyrpg.com/"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 1.0}, "subtitle_html": null, "description_text": "<p>Dive into the world of City of Mist in this easy to digest set of rules for players and MCs.</p><p>Included in this module:</p><p>A section for players, explaining the rules of the game</p><p>A section for the MC, explaining the role of the MC and containing your first case, Shark Tank</p><p>5 beautifully-illustrated pre-generated characters: Baku, Detective Enkidu, Job, Lily Chow &amp; Iron Hans, and Tlaloc</p>", "user_ratings": {}, "developers": [{"developer-name": "Son of Oak Game Studio", "developer-url": "https://app.alchemyrpg.com/marketplace?item=6716830fe1e2b0d3d9b5ed72"}], "item_content_type": "software"}, "cityofmist_playersguide": {"human_name": "City of Mist: Player's Guide\n", "machine_name": "cityofmist_playersguide", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Alchemy VTT", "publisher-url": "https://app.alchemyrpg.com/"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 1.0}, "subtitle_html": null, "description_text": "<p>Hit the rainy streets of an enigmatic metropolis as a modern-day legend in search for the truth. Investigate unsolved cases, uncover the stories of the city residents, and confront the hidden forces pulling the strings from beyond the veil of the Mist. Make hard calls about which aspect of your life to promote and which to neglect; then suffer the consequences. And when it all falls apart, stop holding back and become the unstoppable incarnation of your Mythos...</p><p>The Player's Guide includes everything essential for players of City of Mist, both old and new - an introduction to the setting, tools for creating unique modern fantasy characters, the complete cinematic game rules, and a dramatic character development system.</p><p>Features:</p><p>Play a modern incarnation of your favorite myth, legend, or fairy tale</p><p>Investigate crimes and wrongs committed by other reincarnated legends like you</p><p>Try a stat-less, class-less, hit-point-less system that drives narrative and cinematic action</p><p>Mix and match Themebooks to create countless different characters with unique playability</p><p>Evolve your character’s abilities based on her personal crises and breakthroughs</p><p>Immerse yourself in award-winning art and comics inspired by graphic novels</p><p>What's in this module:</p><p>Chapter 1: The Lowdown has the inside scoop on the life of a Rift (a Player Character) and the process of awakening to the legend within you. It also provides an introduction to the City.</p><p>Chapter 2: Who Are You? is a guide to the Exposition Session, in which you and your group create your City of Mist series. It includes the complete character creation system using themebooks (questionnaires), quick character creation options, a system of crew relationships, sample crew themes, and the crew themebook.</p><p>Chapter 3: Working the Case explains the game's cinematic rules system, focusing on the eight core moves, the four cinematic moves (Voiceover Monologue, Flashback, Montage, and Geek Out During Credits) and providing ample optional rules to customize your game.</p><p>Chapter 4: Moments of Truth describes the game’s signature non-linear character development system which drives your character to explore the Mystery of your Mythos and go through dramatic moments of transformation, such as loss of a loved one or gaining new powers.</p>", "user_ratings": {}, "developers": [{"developer-name": "Son of Oak Game Studio", "developer-url": "https://app.alchemyrpg.com/marketplace?item=63c64e792db11d69b30b6aaa"}], "item_content_type": "software"}, "cityofmist_mctoolkit": {"human_name": "City of Mist: MC Toolkit\n", "machine_name": "cityofmist_mctoolkit", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Alchemy VTT", "publisher-url": "https://app.alchemyrpg.com/"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 10.0}, "subtitle_html": null, "description_text": "<p>The Master of Ceremonies' (MC) Toolkit includes step-by-step guides for creating and running your own City of Mist series, as well as ample ready-to-play content: challenges, adversaries, arch-villains, and a full case - \"Gambling With Death\" - so you can start playing right off the bat.</p><p>What's in this module:</p><p>Chapter 1: Word on the Street describes four of the main City districts with sample locations and local Rifts, as well as additional districts and locations at the edge of town.</p><p>Chapter 2: Behind the Scenes is a detailed breakdown of the MC’s roles, a step-by-step guide on how to run sessions including a variety of tools to help make your game more cinematic, and an in-depth walkthrough for creating your own cases and designing your series based on the Iceberg model.</p><p>Chapter 3: This is MY City!, the villain chapter, contains the rules for creating and handling Dangers; a comprehensive Danger Profile directory containing dozens of Dangers to use in your games; a guide to Avatars and their operations with four ready-to-use Avatar profiles; and a special section on creating and using custom moves.</p><p>A full case: “Gambling with Death”</p>", "user_ratings": {}, "developers": [{"developer-name": "Son of Oak Game Studio", "developer-url": "https://app.alchemyrpg.com/marketplace?item=638a9b7488cfce0905f36b2f"}], "item_content_type": "software"}, "michaeljfoxfoundation": {"human_name": "Michael J. Fox Foundation for Parkinson's Research", "machine_name": "michaeljfoxfoundation", "youtube_link": "5qFM9LYwT1g", "callout": null, "publishers": [], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "subtitle_html": null, "description_text": "<p><em>Donations to support the&nbsp;<span data-sheets-value=\"{&quot;1&quot;:2,&quot;2&quot;:&quot;Michael J. Fox Foundation for Parkinsons Research&quot;}\" data-sheets-userformat=\"{&quot;2&quot;:391875,&quot;3&quot;:{&quot;1&quot;:0},&quot;4&quot;:[null,2,11982760],&quot;9&quot;:0,&quot;10&quot;:2,&quot;12&quot;:0,&quot;14&quot;:[null,2,0],&quot;15&quot;:&quot;arial,sans,sans-serif&quot;,&quot;16&quot;:10,&quot;17&quot;:0,&quot;18&quot;:0,&quot;19&quot;:0,&quot;21&quot;:0}\">Michael J. Fox Foundation for Parkinson's Research</span> are made to <a href=\"https://support.humblebundle.com/hc/en-us/articles/205183597\" target=\"_blank\" rel=\"noopener\">PayPal Giving Fund</a>, subject to its policies.</em></p>\n<p>Founded in 2000, The Michael J. Fox Foundation for Parkinson’s Research (MJFF) is dedicated to finding a cure for Parkinson's disease (PD) through an aggressively funded research agenda and to ensuring the development of improved therapies for those living with Parkinson's today. PD affects nearly 1 million people in the United States and more than 6 million people worldwide, a figure estimated to double by 2040 as the population ages and becomes at increasing risk for neurologic disorders. There is no known cure and the need for new Parkinson’s treatments has never been more critical.</p>\n<p>From inception, MJFF has worked to jolt Parkinson’s drug development out of a standstill. Our activities go far beyond funding basic research discoveries. We identify and fund innovative ideas in Parkinson’s disease discovery, including high-risk, high-reward opportunities; an approach that in less than two decades has transformed the broader approach in the Parkinson’s research field. We laser-focus on the targets that show real potential to help people, and proactively chaperone them along the complicated pipeline toward clinical trials. Positioned at the global nexus of Parkinson’s research, we strive to set the standard for impact and accountability. We constantly monitor costs to maximize the value of the philanthropic support we receive. As a result, since our founding, 88 cents of every dollar we spend goes straight to our research programs.</p>\n<p>Curing Parkinson’s is ambitious and we can’t do it alone. Visit&nbsp;<a href=\"http://michaeljfox.org/\" target=\"_blank\" data-saferedirecturl=\"https://www.google.com/url?q=http://michaeljfox.org/&amp;source=gmail&amp;ust=1554310282818000&amp;usg=AFQjCNHhDdu9J3e417sGA7RTZuJqEeIxng\" rel=\"noopener\">michaeljfox.org</a>&nbsp;for more information on how you can get involved today.</p>", "user_ratings": {}, "developers": [{"developer-name": "michaeljfox.org", "developer-url": "https://www.michaeljfox.org/"}], "item_content_type": null}, "cityofmist_locallegends": {"human_name": "City of Mist: Local Legends\n", "machine_name": "cityofmist_locallegends", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Alchemy VTT", "publisher-url": "https://app.alchemyrpg.com/"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 10.0}, "subtitle_html": null, "description_text": "<p>Local Legends takes a deep dive into the communities and subcultures of the City's districts, expanding them with more lore, new adversaries and allies, new player options, and adding three completely new districts to the City of Mist: the long-awaited Chinatown, the \"peaceful\" suburb of Happyville, and the cult-infested Campus district. Each of the expansion's 9 districts also includes a locally-focused case for your crew to investigate!</p><p>What's in this module:</p><p>A Guide to the City, an introduction to the City districts, narrated by fan favorite character and the City Herald's best investigative journalist, Lance Sullivan.</p><p>9 Expanded City Districts, each with its own case:</p><p>Chinatown. Includes the one-shot case An Antidote Foretold, and a new Logos themebook, Tradition.</p><p>Fortune Row. Includes the one-shot case All About the Mani, and rules on how to run heists in the City.</p><p>Happyville. Includes the full-length case Amnesia Town.</p><p>Independence. Includes the one-shot case The Unwanted Guest.</p><p>La Colonia de Sombras. Includes the one-shot case The Black Butterfly Murders.</p><p>The Sunken City. Includes the one-shot case Leviathan's Sorrow.</p><p>The Campus. Includes the one-shot case Words Fail, and a new Mythos themebook, Esoterica.</p><p>The Undertrash. Includes the one-shot case Where Light Fears to Tread.</p><p>Tourist Trap. Includes the one-shot case The Maestro of Chalk.</p><p>4 Small-Time Villain operations:</p><p>Puppet Show, featuring the Rift of Geppetto as a used-car salesman driven to kill by fatherly love.</p><p>Stone-Cold Beauty, featuring the Rift of Medusa as a vindictive supermodel turned gang leader.</p><p>One Thousand and One Crimes, featuring the Rift of Sinbad as a highrise window cleaner turned daring thief.</p><p>Outlawed, featuring the Rift of Robin Hood as a homeless vet raging against the system that wronged her.</p><p>Forged and Framed. A Case of Lying Lawyers and Museum Missings.</p>", "user_ratings": {}, "developers": [{"developer-name": "Son of Oak Game Studio", "developer-url": "https://app.alchemyrpg.com/marketplace?item=6716aaa8cb2ee4e6f3cc33aa"}], "item_content_type": "software"}, "cityofmist_nightsofpaynetown": {"human_name": "City of Mist: Nights of Payne Town\n", "machine_name": "cityofmist_nightsofpaynetown", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Alchemy VTT", "publisher-url": "https://app.alchemyrpg.com/"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 18.0}, "subtitle_html": null, "description_text": "<p>This City is going to hell. Here, ordinary people have the power of legends and no-one on the streets even knows. Everyone is hustling. Gods fight for their next paycheck while monsters control the drug trade. Why do we keep hurting ourselves? Do the stories inside us push us to kill? Or is it just our old wounds, buried out of sight and out of mind? The people who once tried to heal this City are now haunting it, drinking the misery of millions. All these wounded souls are stealing, backstabbing, killing, their pain glowing like neon in the night. That’s the way this City is. These are the Nights of Payne Town.</p><p>It is a time of turmoil in the City. The police are helpless against a new wave of crime, powered by forces they neither see nor understand. Ancient legends that were scheming in the shadows for decades are now finally enacting their insidious plans, raining chaos and suffering on the streets. The only ones who can stop this mayhem are nameless individuals, anti-heroes like your crew, caught in this mess unwillingly or all too willingly...</p><p>Behind it all lies a sordid truth and a malignant power that has been feeding on the misery of the City since its early days. But, even there, in the heart of darkness, there is hope... Can you find it?</p><p>What's in this module:</p><p>Nights of Payne Town is a story arc book, a collection of ten cases (adventures) that can be run individually or as an ongoing series (campaign), following the insidious operation of an all-powerful Avatar.</p><p>Each case contains everything you need to run a game of City of Mist, including a teaser for your players, the backstory, locations, clues, NPCs, Danger descriptions and maps.</p><p>Nights of Payne Town cases break down into three \"veins\", or sub-plots:</p><p>The Criminal Vein, cases involving the rise of an unstoppable crime baron, a violent self-proclaimed monarch, and the struggle for power over the City streets.</p><p>The Mystical Vein, cases following a magical arms race, where a mystery collector will stop at nothing to gather every form of magical object and being in the City; and</p><p>The Personal Vein, cases trailing the personal tragedy of the victims of a scheme to slowly and painfully destroy the very fabric of society in the City.</p><p>At the culmination of the story arc, these three veins combine into a single super-plot.</p><p>Among the modern-day legends featured are Hansel &amp; Gretel, the Wendigo, Goldilocks, the Snow Queen, a slew of characters from Arthurian legend, the Philosopher's Stone, King David, Paul Bunyan, Puckwudgies, and many more.</p>", "user_ratings": {}, "developers": [{"developer-name": "Son of Oak Game Studio", "developer-url": "https://app.alchemyrpg.com/marketplace?item=66ba5c8cfb1c332325bfeb2a"}], "item_content_type": "software"}, "cityofmist_shadowsandshowdowns": {"human_name": "City of Mist: Shadows & Showdowns\n", "machine_name": "cityofmist_shadowsandshowdowns", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Alchemy VTT", "publisher-url": "https://app.alchemyrpg.com/"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 10.0}, "subtitle_html": null, "description_text": "<p>Shadows &amp; Showdowns is an expansion for City of Mist which enhances the core rules and reveals much about the City and the powers behind the Mist - and beyond it!</p><p>What's in this module:</p><p>Chapter 1: If Dreams Could Kill, provides players new options for character creation and development. Six new themebooks, 50 new veteran improvements, ranging from deeper Mist awareness and control to enhancing your character's Mythos abilities, 24 ready-to-use Relic and Familiar theme kits, and a concept guide for quick and easy character building, complete with character creation tables using Legendary Archetypes and Noir Tropes.</p><p>Chapter 2: Overlooked Attractions, explores 40 new City locations and intriguing locals to use on-the-fly in your campaign. It introduces some of the City's most prominent movers and shakers, best-kept secret hideouts, and the ‘who’s who’ of street-level information brokering, all designed for a specific narrative situation such as the crew seeking more information, recovering from a violent encounter, or requiring arbitration or mediation with an Avatar.</p><p>Chapter 3: Don’t Believe The Truth, reveals the council of Avatars that runs the City, their individual operations, Rifts in their service, and the details of their shadowy agreement to maintain the status quo in the City. This chapter includes 6 new Avatar profiles of the reigning members of 'the Truth' - Chairman Chow (Tanhā, the buddhist force of desire), Ganesha (Ganesha, the elephant-headed Indian god who is the Remover of Obstacles), District Attorney Barbara King (Shango, the Orisha of Power and Dominion), Dr. Talbot Leyland (Prometheus), Rosaline (Romeo &amp; Juliet), and Monte Wolfe (The Boy Who Cried Wolf).</p><p>Chapter 4: Suits Unveiled, takes a deep dive into the Mist and its origins and into the secret organization behind it: the Gatekeepers. It offers an answer to the biggest question of them all - \"What is the Mist?\" - but mostly gives MCs the tools to create their own unique answers and backstories to the Gatekeeper organization and to the origins and nature of the Mist. Players will find complete rules for playing Gatekeeper characters or turning their Rift characters into Gatekeepers, including three new themebooks (Shrouding, Advanced Art, and Unit) and dozens of ready-to-use pick-and-play theme kits.</p>", "user_ratings": {}, "developers": [{"developer-name": "Son of Oak Game Studio", "developer-url": "https://app.alchemyrpg.com/marketplace?item=66bd1a7c896ed41be9e21c4b"}], "item_content_type": "software"}, "cityofmist_coresetenhancededition": {"human_name": "City of Mist: Core Set Enhanced Edition\n", "machine_name": "cityofmist_coresetenhancededition", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Alchemy VTT", "publisher-url": "https://app.alchemyrpg.com/"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 18.0}, "subtitle_html": null, "description_text": "<p>The most immersive way to experience City of Mist.</p><p>In this City, anyone could be a legend in disguise. King Arthur, Alice in Wonderland, or Tlaloc the Aztec Rain God live within regular Janes and Joes. The mythical is real, but no one can remember it. Millions of oblivious people walk these streets, thinking this City is ordinary, while the legendary skulk behind the veil of the Mist.</p><p>The City of Mist Core Set includes The Player's Guide and The MC Toolkit.</p><p>The Player's Guide:</p><p>Everything you need to create, play, and evolve City of Mist characters, including an introduction to the setting, tools for creating unique modern fantasy characters, the complete cinematic game rules, and a dramatic character development system.</p><p>The MC Toolkit:</p><p>All the guides and tools for creating and running your own City of Mist series, as well as ample ready-to-play content: challenges, adversaries, arch-villains, and a full case - \"\"Gambling With Death\"\" - so you can start playing right off the bat.</p><p>Alchemy Enhanced Edition:</p><p>Get the Alchemy Enhanced version of the City of Mist Core Set and experience the setting like never before with immersive motion overlays, ambient sounds, and an original dynamic audio score.</p><p>Enhanced Features</p><p>Fully animated cover scene</p><p>10 thematic motion overlays</p><p>10 ambient sound beds</p><p>10 minutes of dynamic audio (AE exclusive)</p><p>11 ready-to-play pre-built scenes</p>", "user_ratings": {}, "developers": [{"developer-name": "Son of Oak Game Studio", "developer-url": "https://app.alchemyrpg.com/marketplace?item=64a0a3d14e681359005a021b"}], "item_content_type": "software"}}, "charity_data": {"charity_items": {"michaeljfoxfoundation": {"machine_name": "michaeljfoxfoundation", "youtube_link": "5qFM9LYwT1g", "item_content_type": null, "subtitle_html": null, "description_text": "<p><em>Donations to support the&nbsp;<span data-sheets-value=\"{&quot;1&quot;:2,&quot;2&quot;:&quot;Michael J. Fox Foundation for Parkinsons Research&quot;}\" data-sheets-userformat=\"{&quot;2&quot;:391875,&quot;3&quot;:{&quot;1&quot;:0},&quot;4&quot;:[null,2,11982760],&quot;9&quot;:0,&quot;10&quot;:2,&quot;12&quot;:0,&quot;14&quot;:[null,2,0],&quot;15&quot;:&quot;arial,sans,sans-serif&quot;,&quot;16&quot;:10,&quot;17&quot;:0,&quot;18&quot;:0,&quot;19&quot;:0,&quot;21&quot;:0}\">Michael J. Fox Foundation for Parkinson's Research</span> are made to <a href=\"https://support.humblebundle.com/hc/en-us/articles/205183597\" target=\"_blank\" rel=\"noopener\">PayPal Giving Fund</a>, subject to its policies.</em></p>\n<p>Founded in 2000, The Michael J. Fox Foundation for Parkinson’s Research (MJFF) is dedicated to finding a cure for Parkinson's disease (PD) through an aggressively funded research agenda and to ensuring the development of improved therapies for those living with Parkinson's today. PD affects nearly 1 million people in the United States and more than 6 million people worldwide, a figure estimated to double by 2040 as the population ages and becomes at increasing risk for neurologic disorders. There is no known cure and the need for new Parkinson’s treatments has never been more critical.</p>\n<p>From inception, MJFF has worked to jolt Parkinson’s drug development out of a standstill. Our activities go far beyond funding basic research discoveries. We identify and fund innovative ideas in Parkinson’s disease discovery, including high-risk, high-reward opportunities; an approach that in less than two decades has transformed the broader approach in the Parkinson’s research field. We laser-focus on the targets that show real potential to help people, and proactively chaperone them along the complicated pipeline toward clinical trials. Positioned at the global nexus of Parkinson’s research, we strive to set the standard for impact and accountability. We constantly monitor costs to maximize the value of the philanthropic support we receive. As a result, since our founding, 88 cents of every dollar we spend goes straight to our research programs.</p>\n<p>Curing Parkinson’s is ambitious and we can’t do it alone. Visit&nbsp;<a href=\"http://michaeljfox.org/\" target=\"_blank\" data-saferedirecturl=\"https://www.google.com/url?q=http://michaeljfox.org/&amp;source=gmail&amp;ust=1554310282818000&amp;usg=AFQjCNHhDdu9J3e417sGA7RTZuJqEeIxng\" rel=\"noopener\">michaeljfox.org</a>&nbsp;for more information on how you can get involved today.</p>", "human_name": "Michael J. Fox Foundation for Parkinson's Research", "developers": [{"developer-name": "michaeljfox.org", "developer-url": "https://www.michaeljfox.org/"}], "publishers": [], "user_ratings": {}}}}, "from_bundle": {"machine_name": "citymistmythosawakenedcollectionforalchemyvtt_softwarebundle", "tile_short_name": "City of Mist Mythos Awakened Collection for Alchemy VTT", "short_marketing_blurb": "City of Mist x Alchemy VTT", "marketing_blurb": "Get City of Mist: Starter Set, City of Mist: Local Legends, City of Mist: Shadows & Showdowns, City of Mist: Nights of Payne Town, City of Mist: Core Set Enhanced Edition, and more!", "detailed_marketing_blurb": "Play the hottest RPG, <em>City of Mist</em>, with meaningful theatrical enhancements using the City of Mist Mythos Awakened Collection for Alchemy VTT! Start your journey on the right foot with the core set, Player’s Guide, and more. Feel empowered as a GM to push the envelope of your adventures with Alchemy’s unmatched enhancements like animated scenes, ambient sound, and music. Elevate your campaign’s immersion, scale, and overall experience with the City of Mist Mythos Awakened Collection for Alchemy VTT—and help support the Michael J. Fox Foundation with your purchase!", "author": "Alchemy RPG", "start_date|datetime": "2025-11-03T19:00:00", "end_date|datetime": "2025-11-24T19:00:00", "type": "bundle", "product_url": "/software/city-mist-mythos-awakened-collection-for-alchemy-vtt-software"}, "updated_at|datetime": "2025-11-04T03:19:54.939651", "first_seen_at|datetime": "2025-11-04T03:19:54.939651"}
{"machine_name": "pathfinderinfinitecelebrationkingmakerroll20_bookbundle", "author": "Roll20", "basic_data": {"eula": null, "human_name": "Humble RPG Bundle: Pathfinder Infinite - Celebration of Kingmaker by Roll20", "detailed_marketing_blurb": "The Stolen Lands are yours for the claiming, and all you need is our new bundle offering everything you need to launch your own Pathfinder Infinite Kingmaker Adventure Path campaign! This comprehensive kit includes the full Kingmaker Player’s Guide to get things, ahem, rolling; all the occult knowledge contained within the pages of Frontiers of Magic; the Boosted Bestiary to update your favorite Pathfinder creatures across multiple levels; the expanded Player Core 2, and much more! Gather your comrades and prepare to embark on the adventure of a lifetime, and help support Extra Life charity with your purchase! ", "short_marketing_blurb": "Create your kingdom", "media_type": "ebook", "description": "<p><strong>Create your kingdom.</strong> WThe Stolen Lands are yours for the claiming, and all you need is our new bundle offering everything you need to launch your own Pathfinder Infinite Kingmaker Adventure Path campaign! This comprehensive kit includes the full Kingmaker Player’s Guide to get things, ahem, rolling; all the occult knowledge contained within the pages of Frontiers of Magic; the Boosted Bestiary to update your favorite Pathfinder creatures across multiple levels; the expanded Player Core 2, and much more! Gather your comrades and prepare to embark on the adventure of a lifetime, and help support Extra Life charity with your purchase!</p>\n<p><strong>Pay $5 or more.</strong> Normally, the total cost for the ebooks in this bundle is as much as $312. Here at Humble Bundle, you choose the price and increase your contribution to upgrade your bundle! This bundle has a minimum $5 purchase. Pay $5 or more to access keys.</p>\n<p><strong>Read them anywhere.</strong> The ebooks in this bundle are available in pdf format, so they work on your computer, e-readers, iPads, cell phones, and a wide array of mobile devices! Instructions and a list of recommended reading programs can be found <a href=\"https://support.humblebundle.com/hc/articles/202712300\" rel=\"noopener\" target=\"_blank\">here</a>.</p>\n<p><strong>Support charity.</strong> Choose where the money goes - between the publisher and to support Extra Life. If you like what we do, you can leave us a Humble Tip too!</p>", "legal_disclaimer": null, "required_account_links": ["steam"], "end_time|datetime": "2025-11-22T19:00:00"}, "tier_item_data": {"boostedbestiary": {"human_name": "Boosted Bestiary", "machine_name": "boostedbestiary", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Roll20", "publisher-url": "https://www.pathfinderinfinite.com/en/product/396687/boosted-bestiary"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 15.0}, "subtitle_html": null, "description_text": "<p>Expand the Bestiary! The Boosted Bestiary takes more than 60 creatures from the Pathfinder Second Edition Bestiary and updates them across multiple levels, giving you more than 200 new monsters. Menace your players with chimeras from level 2 to 20, drakes from level 0 to 14, shoggoths from level 6 to 21, and many more creatures at many more levels! Every creature has a description of its new role and gets level-appropriate powers. From the lowly skumling to the mighty balor lord, the Boosted Bestiary presents all-new creatures at every level you need!</p>", "user_ratings": {}, "developers": [{"developer-name": "Ron Lundeen"}], "item_content_type": "game"}, "inkfinder": {"human_name": "Inkfinder", "machine_name": "inkfinder", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Roll20", "publisher-url": "https://www.pathfinderinfinite.com/en/product/393078/inkfinder"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 15.0}, "subtitle_html": null, "description_text": "<p>Player Options for Tattoo Artists and Their Canvases! Secrets of Magic gives the ground rules for tattooing Player Characters, and Lost Omens: Grand Bazaar extends those options with new tattoo formulas, but players may find themselves wanting additional options. That’s where Inkfinder comes in! This supplement provides over 100 tattoos of all levels and rarities. Players wanting to specialize their heroes in the crafting of tattoos might enjoy the tattoo artisan archetype, the tattooed warrior archetype, and a new alchemist research field.</p>", "user_ratings": {}, "developers": [{"developer-name": "W. Brian Lane"}], "item_content_type": "game"}, "everythingshields": {"human_name": "Everything Shields", "machine_name": "everythingshields", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Roll20", "publisher-url": "https://www.pathfinderinfinite.com/en/product/400727/everything-shields"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Take your shields to the next level! With the Everything Shields Pathfinder Second Edition supplement, you can create hundreds of customized shields and shield-focused characters. Do you want to play a swashbuckling, targe-wielding duelist whose shield can exude darkness on command when you get in a pinch? Or a mobile warrior who throws a mithral hoplon that returns after each attack? How about a witch who has etched a hex onto the face of their shield to make enemies falter when they attack? All these things and many more are possible with the additional shield content brought to you by Everything Shields.</p>", "user_ratings": {}, "developers": [{"developer-name": "Everything4Everybody, Tevis Woods"}], "item_content_type": "game"}, "kingmakeradventurepathroll20vtt": {"human_name": "Kingmaker Adventure Path | Roll20 VTT", "machine_name": "kingmakeradventurepathroll20vtt", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Roll20", "publisher-url": "https://www.pathfinderinfinite.com/en/product/443398/kingmaker-adventure-path-roll20-vtt"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>The Stolen Lands have long been the domain of bandits and monsters, but no longer! Your party has been granted a charter to explore these wilds, defeat its dangers, and build a brand new nation. Yet not everyone will welcome you as new neighbors, and powerful supernatural forces have their own plans for the region. Can you defeat your kingdom’s enemies and become one of the greatest new nations in the world? This product contains all six chapters of the original Kingmaker Adventure Path, expanded and updated for use with Pathfinder Second Edition; plus hundreds of pages of new content that expands the campaign to cover the full range of levels from 1 to 20; AND extensive rules for building and running kingdoms, settlements, and armies, along with narrative-based rules for quickly resolving mass combat!</p>", "user_ratings": {}, "developers": [{"developer-name": "Paizo"}], "item_content_type": "game"}, "playercore2expanded": {"human_name": "Player Core 2 Expanded", "machine_name": "playercore2expanded", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Roll20", "publisher-url": "https://www.pathfinderinfinite.com/en/product/513679/player-core-2-expanded"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Enjoying the remastered classes in Player Core 2 but wished there was more? How about a Swashbuckler that made explosive use out of Crafting, or an Investigator that carries with it just a hint of magical power to solve even crazier mysteries? Brought to you by 6 Infinite authors and specially tuned for the PF2e Remaster! This expansion includes 2 Alchemist Research Fields; 3 Barbarian Instincts; 2 Champion Causes plus a new Blessing; 2 Investigator Methodologies; 6 Monk feats, as well as 6 new Qi spells; 2 new Oracle Mysteries; 3 Sorcerer Bloodlines; and 5 Swashbuckler Styles, including 11 new Swashbuckler feats!</p>", "user_ratings": {}, "developers": [{"developer-name": "Conner Berkheiser, Joshua White, Sasha Laranoa Harving, Derry Luttrell, Raul \"Valor\" Padilla, Ruben \"Lyon\" Salazar"}], "item_content_type": "game"}, "smokeandsail_apathfinder2enavalwarfaresourcebook": {"human_name": "Smoke and Sail: a Pathfinder 2e Naval Warfare Sourcebook", "machine_name": "smokeandsail_apathfinder2enavalwarfaresourcebook", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Roll20", "publisher-url": "https://www.pathfinderinfinite.com/en/product/396152/smoke-and-sail-a-pathfinder-2e-naval-warfare-sourcebook"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Few environments conjure feelings of excitement and trepidation more acutely than the ocean, with its endless rhythm of churning waves and possibility for adventure. Tenacious crews sailing ships of all sizes make perilous journeys across the majestic vastness that stretches from horizon to horizon, certain that their vessel will carry them to shore under any sky and on any sea. This sourcebook provides a comprehensive ruleset for running such a vessel and engaging in thrilling, ship-based combat encounters.</p>", "user_ratings": {}, "developers": [{"developer-name": "Jamie Trollope, Paul Steen"}], "item_content_type": "game"}, "frontiersofmagic": {"human_name": "Frontiers of Magic", "machine_name": "frontiersofmagic", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Roll20", "publisher-url": "https://www.pathfinderinfinite.com/en/product/406118/frontiers-of-magic"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Magic is an ever-expanding field of study. Wizards construct new spells, druids befriend newly observed species, occultists uncover secrets thought lost, and clerics receive novel blessings. Magical theories might be developed and expanded for centuries before being taught in primary academies, and long-held indigenous magical practices might enter the magical zeitgeist elsewhere. Still other practices, like mesmerism and shapeshifting, are often closely guarded secrets. Regardless of how you get there, learning something new is exciting! This 141-page supplement of player options includes 2 new classes (Mesmerist and Shifter), 35 archetypes, new class options and feats for most spellcasting classes, spell skill actions, and over 60 new spells (including consolation cantrips).</p>", "user_ratings": {}, "developers": [{"developer-name": "W. Brian Lane"}], "item_content_type": "game"}, "cookingunleashed": {"human_name": "Cooking Unleashed", "machine_name": "cookingunleashed", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Roll20", "publisher-url": "https://www.pathfinderinfinite.com/en/product/425794/cooking-unleashed"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>All across Golarion, various delicious cuisines and meals are made everyday by chefs from various different cultures and backgrounds. Some alchemists in particular, dedicate themselves to mixing the art of alchemy with the culinary arts to create delicious and potent treats! While halflings may have been some of the earliest trailblazers of this blend of alchemy and cooking, many others have adopted these techniques throughout the inner sea!  If you wish to play a cook who can make use of potent alchemical foodstuffs or simply gain access to new options for alchemical food through feats and items, Cooking Unleashed is for you!</p>", "user_ratings": {}, "developers": [{"developer-name": "Conner Berkheiser"}], "item_content_type": "game"}, "impossibleexperimentstheguardianofgitnaroll20": {"human_name": "Impossible Experiments The Guardian of Gitna | Roll20", "machine_name": "impossibleexperimentstheguardianofgitnaroll20", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Roll20", "publisher-url": "https://www.pathfinderinfinite.com/en/product/437862/impossible-experiments-the-guardian-of-gitna-roll20"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 15.0}, "subtitle_html": null, "description_text": "<p>Impossible Experiments is a series of adventures, each spanning 1-2 levels. Each volume can be run individually or combined into an ongoing series. When the wizard-king Nex retreated into his Refuge over 4,000 years ago, speculation ran rampant as to what he would do in this space. At first, many assumed that he was restrategizing for the war with Geb, but as the decades and centuries ground on, wilder hypotheses were offered. One explanation claimed that Nex was experimenting to develop a new generation of magical warriors, spies, and minions whose presence would overwhelmingly tip the scales of war against Geb, and likely other nations to follow.</p>", "user_ratings": {}, "developers": [{"developer-name": "W. Brian Lane"}], "item_content_type": "game"}, "boostedbestiaryroll20": {"human_name": "Boosted Bestiary | Roll20", "machine_name": "boostedbestiaryroll20", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Roll20", "publisher-url": "https://www.pathfinderinfinite.com/en/product/437865/boosted-bestiary-roll20"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Fully converted for immediate use in the Roll210 VTT! The Boosted Bestiary takes more than 60 creatures from the Pathfinder Second Edition Bestiary and updates them across multiple levels, giving you more than 200 new monsters. Menace your players with chimeras from level 2 to 20, drakes from level 0 to 14, shoggoths from level 6 to 21, and many more creatures at many more levels! Every creature has a description of its new role and gets level-appropriate powers. From the lowly skumling to the mighty balor lord, the Boosted Bestiary presents all-new creatures at every level you need!</p>", "user_ratings": {}, "developers": [{"developer-name": "Ron Lundeen"}], "item_content_type": "game"}, "abominationvaultsgmsguide": {"human_name": "Abomination Vaults GMs Guide", "machine_name": "abominationvaultsgmsguide", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Roll20", "publisher-url": "https://www.pathfinderinfinite.com/en/product/373876/abomination-vaults-gms-guide"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 15.0}, "subtitle_html": null, "description_text": "<p>The Abomination Vaults Adventure Path is an extensive campaign in a sprawling megadungeon. Your players need the right tools to navigate its dangers, and you need the tools in this GM’s Guide to keep the action moving! Inside, you'll find new mini-adventures that connect to the dungeon, new wandering factions, a checklist of all the side quest the campaign offers, and full stat blocks for every single monster on every single level!</p>", "user_ratings": {}, "developers": [{"developer-name": "Ron Lundeen"}], "item_content_type": "game"}, "kitsuneofgolarion": {"human_name": "Kitsune of Golarion", "machine_name": "kitsuneofgolarion", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Roll20", "publisher-url": "https://www.pathfinderinfinite.com/en/product/381454/kitsune-of-golarion"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 15.0}, "subtitle_html": null, "description_text": "<p>Living clandestinely among Golarion's ancestries, kitsune make formidable foes and canny heroes. Kitsune of Golarion unlocks the full potential of this ancestry, detailing kitsune from every corner of the globe. An expansion on Lost Omens Ancestry Guide penned by the same authors who pen the Pathfinder Roleplaying Game.</p>", "user_ratings": {}, "developers": [{"developer-name": "Alexander Augunas, Aly Chen, Joan Hong, Dustin Knight, Ruvaid Virk, Sky Mahpiya Wall"}], "item_content_type": "game"}, "clericsplus": {"human_name": "Clerics+", "machine_name": "clericsplus", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Roll20", "publisher-url": "https://www.pathfinderinfinite.com/en/product/415864/clerics"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Guided by the holiest of powers and the most infernal of curses, Clerics+ is an expansion to the Cleric class to add new ways to play a scholar of the divine in Pathfinder 2nd Edition! However you praise the gods, whether it be through steel, service or secrets, Clerics+ is your ticket to playing the priests of Golarion in new, unbelievable ways! Pick up this balanced, vanilla+ expansion to Pathfinder 2e today, and PRAISE BE TO THE GODS!</p>", "user_ratings": {}, "developers": [{"developer-name": "Derry Luttrell, Tony Saunders, Team+"}], "item_content_type": "game"}, "extralife": {"human_name": "Extra Life / Children's Miracle Network Hospitals", "machine_name": "extralife", "youtube_link": "ZS7WRl7N1Ig", "callout": null, "publishers": [], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "subtitle_html": null, "description_text": "<p><em>Donations to support Extra Life / Children's Miracle Network Hospitals&nbsp;are made to the&nbsp;<a rel=\"nofollow noopener\" target=\"_blank\" href=\"https://support.humblebundle.com/hc/en-us/articles/205183597\" title=\"Link: https://support.humblebundle.com/hc/en-us/articles/205183597\">PayPal Giving Fund</a>, subject to its policies.</em></p>\n<p>Extra Life is a Children’s Miracle Network Hospitals fundraising program that empowers the gaming community to make a difference in the lives of local sick and injured kids. Participants fundraise year-round and during a 24-hour gaming marathon each fall.<br><br>Getting involved is as easy as signing up online at extra-life.org, asking your friends and family to donate, and pledging to play games in support of the Children’s Miracle Network Hospital of your choice. You can play from the comfort of your own home, playing any game you want.<br><br>Since 2008, Extra Life has raised more than $75 million for member hospitals. Play games, heal kids and join the community today at <a href=\"http://www.extra-life.org\" target=\"_blank\" rel=\"noopener\">www.extra-life.org</a>.</p>\n<p><strong>&nbsp;</strong></p>", "user_ratings": {}, "developers": [{"developer-name": "www.extra-life.org", "developer-url": "http://www.extra-life.org"}], "item_content_type": null}, "kingmaker_rostovhinterlandsandthegreenbelt": {"human_name": "Kingmaker - Rostov Hinterlands and the Greenbelt", "machine_name": "kingmaker_rostovhinterlandsandthegreenbelt", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Roll20", "publisher-url": "https://www.pathfinderinfinite.com/en/product/424578/kingmaker-rostov-hinterlands-and-the-greenbelt"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 5.0}, "subtitle_html": null, "description_text": "<p>Explore the Rostov Hinterlands and the Greenbelt in greater detail than ever: Expanded encounter descriptions, ideas for Empty hexes, 2 Camspsite Maps, 4 Battle Maps (Temple of the Elk, Oleg's Trading Post, Spider Den, Frogpond), and a series of helpful Screenshots to be used as handouts (first-person views).</p>", "user_ratings": {}, "developers": [{"developer-name": "Gremlin Brothers"}], "item_content_type": "game"}, "kingmaker_kamelands": {"human_name": "Kingmaker - Kamelands", "machine_name": "kingmaker_kamelands", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Roll20", "publisher-url": "https://www.pathfinderinfinite.com/en/product/431864/kingmaker-kamelands"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 5.0}, "subtitle_html": null, "description_text": "<p>OVER 50 MAP VARIANTS! 2 Campsite Maps (Bluff &amp; Badlands), Candlemere Island and Basement, Lizardking's Village, Mudbowl, Silverstep Lake Battle Map, Scythe tree (with bonus animated map), PLUS Wandering Monsters (Expanded Table) and Ideas for Empty Hexes (Six new ones!).</p>", "user_ratings": {}, "developers": [{"developer-name": "Gremlin Brothers"}], "item_content_type": "game"}, "nonanimalcompanionsroll20": {"human_name": "Non Animal Companions | Roll20", "machine_name": "nonanimalcompanionsroll20", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Roll20", "publisher-url": "https://www.pathfinderinfinite.com/en/product/443209/non-animal-companions-roll20"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Over 30 all new (non) Animal Companions ready to be slotted into your pathfinder 2e game! From an Owlcub to the Mimic, all the companions you'd want to join your party are here, featuring the Dragon Wyrmling, the Gelatinous Cube, the Giant Spider, the Imp, the Hydra, the Snapping Flytrap, the Purple-ish Wormling, and the Warg!</p>", "user_ratings": {}, "developers": [{"developer-name": "Nikola Ninkovic"}], "item_content_type": "game"}, "featsplus": {"human_name": "Feats+", "machine_name": "featsplus", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Roll20", "publisher-url": "https://www.pathfinderinfinite.com/en/product/490114/feats"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 5.0}, "subtitle_html": null, "description_text": "<p>Set out on your journey into previously unreachable heights with Feats+, a massive expansion to Pathfinder 2nd Edition's general feats and skill feats. Whether you're tackling flying opponents from the air, stoking the flames of fame on a world-wide level or stealing the very senses of your targets, Feats+ has over 330 feats to expand the pool of general feats you can choose from.</p>", "user_ratings": {}, "developers": [{"developer-name": "Derry Luttrell, Tony Saunders, Team+, Cerapter, Conner Berkheiser, Sen H.H.S."}], "item_content_type": "game"}, "lostomensancestries_dragonkin": {"human_name": "Lost Omens Ancestries: Dragonkin", "machine_name": "lostomensancestries_dragonkin", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Roll20", "publisher-url": "https://www.pathfinderinfinite.com/en/product/378138/lost-omens-ancestries-dragonkin"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 5.0}, "subtitle_html": null, "description_text": "<p>Dragonkin are the scions of dragons, drawing upon their draconic lineage for great power. Lost Omens Ancestries: Dragonkin presents a new versatle heritage for the second edition of the Pathfinder Roleplaying Game. The versatile heritage allows characters to tap into their draconic potential to breathe fire, grow deadly claws, take flight with powerful wings, and more. This product presents background information on dragonkin—including their place in Golarion, the new heritage, and 28 ancestry feats all written by veteran Second Edition designer, Luis Loza.</p>", "user_ratings": {}, "developers": [{"developer-name": "Luis Loza"}], "item_content_type": "game"}, "minotaursunleashed_apathfinder2ndeditionancestry": {"human_name": "Minotaurs Unleashed: A Pathfinder 2nd Edition Ancestry", "machine_name": "minotaursunleashed_apathfinder2ndeditionancestry", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Roll20", "publisher-url": "https://www.pathfinderinfinite.com/en/product/422349/minotaurs-unleashed-a-pathfinder-2nd-edition-ancestry"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 15.0}, "subtitle_html": null, "description_text": "<p>The minotaurs of Golarion are a powerful and brave band of people who have been overlooked by many over the years, considered by the common folk to be nothing more than violent monsters and worshippers of the demon lord Baphomet. What many don’t know however, is that there are a number of diverse minotaur cultures across Golarion that seek a different path and have long since forged their own destiny. If you wish to play a powerful and cunning ancestry with a complex and untold history, Minotaurs Unleashed is for you!</p>", "user_ratings": {}, "developers": [{"developer-name": "Conner Berkheiser"}], "item_content_type": "game"}, "playercore1expanded": {"human_name": "Player Core 1 Expanded", "machine_name": "playercore1expanded", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Roll20", "publisher-url": "https://www.pathfinderinfinite.com/en/product/460420/player-core-1-expanded"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 5.0}, "subtitle_html": null, "description_text": "<p>Do you find that Player Core 1 doesn't have a subclass to fit? Whether you are looking for a Cleric spy, a swaggering Rogue, or a Druid with a will of Steel, you will find myriad options within, made by 4 Infinite Masters and specially tuned for the PF2e Remaster! This expansion includes 2 New Bard Muses, 1 new Cleric Domain &amp; a new Doctrine, 2 new Druid Orders, a small collection of new Fighter feats, 1 new Ranger Edge, 1 new Rogue Racket, 4 new Witch Patrons, 4 new Wizard Schools &amp; a new Thesis, and feats to go with them all!</p>", "user_ratings": {}, "developers": [{"developer-name": "Conner Berkheiser, Arkon, Sasha Laranoa Harving, Derry Luttrell"}], "item_content_type": "game"}, "kingmaker_tuskwater": {"human_name": "Kingmaker - Tuskwater", "machine_name": "kingmaker_tuskwater", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Roll20", "publisher-url": "https://www.pathfinderinfinite.com/en/product/430893/kingmaker-tuskwater"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 15.0}, "subtitle_html": null, "description_text": "<p>A guide to the Tuskwater region for the Kingmaker Adventure Path (2nd Edition includes): a revised and expanded encounter list; six new \"Empty Hex\" ideas that can be randomly generated; a full bonus dungeon (THE WITCHING WELL), plus OVER 50 MAP CONFIGURATIONS including Roll20-ready files; a few bonus snowy maps; other locations such as Staglord Fort, Old Crackjaw, Old Beldame, Lonely Barrow, and Hateful Hermit (and wow is he hateful!).</p>", "user_ratings": {}, "developers": [{"developer-name": "Gremlin Brothers"}], "item_content_type": "game"}, "talesfromthedarkarchivetheisleinthemistroll20": {"human_name": "Tales from the Dark Archive The Isle in the Mist | Roll20", "machine_name": "talesfromthedarkarchivetheisleinthemistroll20", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Roll20", "publisher-url": "https://www.pathfinderinfinite.com/en/product/437860/tales-from-the-dark-archive-the-isle-in-the-mist-roll20"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 5.0}, "subtitle_html": null, "description_text": "<p>Sitting on a simply-carved stone throne in the dank darkness, the single frosted eye watches with eager anticipation in the seeing glass as the imprudent mortals talk of her. That same eye gleams in anticipation as it lands upon a little child, wrapped tightly into the lap of a listening mother, then catches sight of the glamour of the dancing water bugs. Wetness drips from her matted hair as she lovingly strokes the impish creature on her lap. With a grating voice, she speaks, “Yes, she will do nicely! Go and fetch her to me, my lovely precious one. Soon she shall join us!” The Isle In The Mist is a one-session Pathfinder Second Edition Adventure For Level 3 and will supplement the adventures found within the Dark Archive rulebook by Paizo.</p>", "user_ratings": {}, "developers": [{"developer-name": "Tom Robinson"}], "item_content_type": "game"}, "archetypesplus": {"human_name": "Archetypes+", "machine_name": "archetypesplus", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Roll20", "publisher-url": "https://www.pathfinderinfinite.com/en/product/450292/archetypes"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 15.0}, "subtitle_html": null, "description_text": "<p>No two heroes are alike, and with Archetypes+, a massive supplement with 300+ Feats, you can expand your world of adventure like never before. Delve deep into dungeons to fight terrible foes, battle with new skills and abilities from beyond our realm, or sell some items for a bargain price. The choice is yours! Archetypes+ both expands archetypes with few feats, adds incredible flavour to ones with great mechanics but no real stories, and adds several brand new archetypes to play with!</p>", "user_ratings": {}, "developers": [{"developer-name": "Derry Luttrell, Tony Saunders, Conner Berkheiser, Grady Wang, Arkon, Sasha Laranoa Harving, Team+"}], "item_content_type": "game"}, "golarionunseen_bloodlines": {"human_name": "Golarion Unseen: Bloodlines", "machine_name": "golarionunseen_bloodlines", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Roll20", "publisher-url": "https://www.pathfinderinfinite.com/en/product/399088/golarion-unseen-bloodlines"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 15.0}, "subtitle_html": null, "description_text": "<p>Golarion Unseen: Bloodlines offers a view into the expanded options for Sorcerers. Have you always wanted to play sorcerer with a connection to Time, or maybe even the ancient Serpentfolk from before the age of darkness? Well look no further! With 20 new bloodlines and 60 new focus spells, this book provides a lot of genealogy to uncover!</p>", "user_ratings": {}, "developers": [{"developer-name": "John Holmes"}], "item_content_type": "game"}}, "charity_data": {"charity_items": {"extralife": {"machine_name": "extralife", "youtube_link": "ZS7WRl7N1Ig", "item_content_type": null, "subtitle_html": null, "description_text": "<p><em>Donations to support Extra Life / Children's Miracle Network Hospitals&nbsp;are made to the&nbsp;<a rel=\"nofollow noopener\" target=\"_blank\" href=\"https://support.humblebundle.com/hc/en-us/articles/205183597\" title=\"Link: https://support.humblebundle.com/hc/en-us/articles/205183597\">PayPal Giving Fund</a>, subject to its policies.</em></p>\n<p>Extra Life is a Children’s Miracle Network Hospitals fundraising program that empowers the gaming community to make a difference in the lives of local sick and injured kids. Participants fundraise year-round and during a 24-hour gaming marathon each fall.<br><br>Getting involved is as easy as signing up online at extra-life.org, asking your friends and family to donate, and pledging to play games in support of the Children’s Miracle Network Hospital of your choice. You can play from the comfort of your own home, playing any game you want.<br><br>Since 2008, Extra Life has raised more than $75 million for member hospitals. Play games, heal kids and join the community today at <a href=\"http://www.extra-life.org\" target=\"_blank\" rel=\"noopener\">www.extra-life.org</a>.</p>\n<p><strong>&nbsp;</strong></p>", "human_name": "Extra Life / Children's Miracle Network Hospitals", "developers": [{"developer-name": "www.extra-life.org", "developer-url": "http://www.extra-life.org"}], "publishers": [], "user_ratings": {}}}}, "from_bundle": {"machine_name": "pathfinderinfinitecelebrationkingmakerroll20_bookbundle", "tile_short_name": "Pathfinder Infinite - Celebration of Kingmaker by Roll20", "short_marketing_blurb": "Create your kingdom", "marketing_blurb": "Get <em>Feats+</em>, <em>Frontiers of Magic</em>, <em>Kingmaker - Kamelands</em>, <em>Player Core 2 Expanded</em>, <em>Boosted Bestiary | Roll20</em>, <em>Kingmaker Adventure Path | Roll20 VTT</em>, and more!", "detailed_marketing_blurb": "The Stolen Lands are yours for the claiming, and all you need is our new bundle offering everything you need to launch your own Pathfinder Infinite Kingmaker Adventure Path campaign! This comprehensive kit includes the full Kingmaker Player’s Guide to get things, ahem, rolling; all the occult knowledge contained within the pages of Frontiers of Magic; the Boosted Bestiary to update your favorite Pathfinder creatures across multiple levels; the expanded Player Core 2, and much more! Gather your comrades and prepare to embark on the adventure of a lifetime, and help support Extra Life charity with your purchase! ", "author": "Roll20", "start_date|datetime": "2025-11-01T18:00:00", "end_date|datetime": "2025-11-22T19:00:00", "type": "bundle", "product_url": "/books/pathfinder-infinite-celebration-kingmaker-roll20-books"}, "updated_at|datetime": "2025-11-02T03:22:49.683335", "first_seen_at|datetime": "2025-11-02T03:22:49.683335"}
