{"machine_name": "hobbiesandgamesfordummieswiley_bookbundle", "author": "Wiley", "basic_data": {"eula": null, "human_name": "Humble Book Bundle: Hobbies and Games for Dummies by Wiley", "detailed_marketing_blurb": "Have you ever wanted to pick up a new hobby? Learn how to play sports and create using your hands with help from our latest For Dummies Bundle. The experts at Wiley can prepare you for anything with ebooks like <em>Manga For Dummies</em>, <em>Pickleball For Dummies</em>, <em>Welding For Dummies</em>, and much more. Impress your friends and stay active alongside them today with our Hobbies and Games for Dummies bundle. Plus, your purchase helps support Safe In Our World. ", "short_marketing_blurb": "Read up before hitting the courts", "media_type": "ebook", "description": "<p><strong>Read up before hitting the courts.</strong> Have you ever wanted to pick up a new hobby? Learn how to play sports and create using your hands with help from our latest For Dummies Bundle. The experts at Wiley can prepare you for anything with ebooks like <em>Manga For Dummies</em>, <em>Pickleball For Dummies</em>, <em>Welding For Dummies</em>, and much more. Impress your friends and stay active alongside them today with our Hobbies and Games for Dummies bundle. Plus, your purchase helps support Safe In Our World.</p>\n<p><strong>Pay $1 or more.</strong> Normally, the total cost for the ebooks in this bundle is as much as $495. Here at Humble Bundle, you choose the price and increase your contribution to upgrade your bundle! This bundle has a minimum $1 purchase.</p>\n<p><strong>Read them anywhere.</strong> The ebooks in this bundle are available in PDF and ePub formats, so they work on your computer, e-readers, iPads, cell phones, and a wide array of mobile devices! Instructions and a list of recommended reading programs can be found <a href=\"https://support.humblebundle.com/hc/articles/202712300\" rel=\"noopener\" target=\"_blank\">here</a>.</p>\n<p><strong>Support charity.</strong> Choose where the money goes - between the publisher and to support Safe in Our World. If you like what we do, you can leave us a Humble Tip too!</p>", "legal_disclaimer": null, "required_account_links": ["steam"], "end_time|datetime": "2025-02-22T19:00:00"}, "tier_item_data": {"soccerfordummies3rdedition": {"human_name": "Soccer For Dummies, 3rd Edition", "machine_name": "soccerfordummies3rdedition", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Wiley", "publisher-url": "https://www.wiley.com/en-us/Soccer+For+Dummies%2C+3rd+Edition-p-9781119893677"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 1.0}, "subtitle_html": null, "description_text": "<p>Soccer For Dummies, Third Edition, is a comprehensive guide to the most popular sport in the world. You'll get a beginner's history of soccer, learn the rules of the game, and what each player on the field is expected to do, the tactics they employ, and the skills they need to master.</p><p>Soccer For Dummies, Third Edition will give you all the information about the best players and teams in the world, descriptions of various leagues around the globe, and the lowdown on where you can find soccer on television, online, in newspapers, magazines, books, movies, and on TV.</p>", "user_ratings": {}, "developers": [{"developer-name": "Tom Dunmore"}], "item_content_type": "ebook"}, "bettingonhorseracingfordummies2ndedition": {"human_name": "Betting on Horse Racing For Dummies, 2nd Edition", "machine_name": "bettingonhorseracingfordummies2ndedition", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Wiley", "publisher-url": "https://www.wiley.com/en-us/Betting+on+Horse+Racing+For+Dummies%2C+2nd+Edition-p-9781119909156"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 10.0}, "subtitle_html": null, "description_text": "<p>Ride into the winners circle with Dummies</p><p>Betting on Horse Racing For Dummies 2e is the spectators' inside guide to finding their way around the racetrack. This easy-to-understand book teaches readers everything they need to know to play, have fun, and win money in the world of horse racing. Betting on Horse Racing For Dummies 2e is packed with solid information on identifying the racing breeds as well as their strengths and weaknesses, sizing up the jockey, understanding the importance and role of a trainer, placing bets, managing money, and more. For readers who can't make it to the track, coverage will be devoted to wagering online, taking advantage of Off Track Betting sites, apps, and more.</p><p>Updates include:</p><ul><li>Handicapping resources</li><li>Changes in betting menus</li><li>Synthetic racing surfaces</li></ul>", "user_ratings": {}, "developers": [{"developer-name": "Richard Eng"}], "item_content_type": "ebook"}, "formulaoneracingfordummies2ndedition": {"human_name": "Formula One Racing For Dummies, 2nd Edition", "machine_name": "formulaoneracingfordummies2ndedition", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Wiley", "publisher-url": "https://www.wiley.com/en-us/Formula+One+Racing+For+Dummies%2C+2nd+Edition-p-9781394206407"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 10.0}, "subtitle_html": null, "description_text": "<p>Formula One is the pinnacle of motor sports, filled with drama around personalities, team dynamics, strategies, politics, and rivalries that have turned the sport into a global sensation. Formula One Racing For Dummies, Second Edition is a guide to the contemporary F1 scene, written by an industry export, providing an overview of the sport for the uninitiated, and plenty of insider anecdotes for the die-hard enthusiast. </p><p>Whats new:</p><p>Updates to reflect current team managers and drivers</p><p>Updated information regarding media coverage and where to get the latest F1 info</p><p>Revamped chapter covering new formats, rules, and regulations</p><p>The anatomy of an F1 car - rewritten to reflect new technical regulations, info about hybrid engines, and Halo/modern safety systems</p><p>Updated photos and illustrations</p><p>Up-to-date information on points structure, championships, various pit stops, new tracks, night racing, and F1 sponsors</p>", "user_ratings": {}, "developers": [{"developer-name": "Jonathan Noble"}], "item_content_type": "ebook"}, "cardgamesfordummies3rdedition": {"human_name": "Card Games For Dummies, 3rd Edition", "machine_name": "cardgamesfordummies3rdedition", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Wiley", "publisher-url": "https://www.wiley.com/en-us/Card+Games+For+Dummies%2C+3rd+Edition+-p-9781119880448"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 10.0}, "subtitle_html": null, "description_text": "<p>YOUR TURN, DUMMIES</p><p>Theres more to card games than learning the rules. Card Games For Dummies 3rd Edition will take card game enthusiasts to the next level and explain the tips and tricks that can turn game night into some serious competition. Get the low-down on poker, blackjack, Bridge, and even Go Fish.</p><p>INSIDE:</p><p>The rules for all your favorite card games Becoming a winner Expanded coverage for online gaming</p>", "user_ratings": {}, "developers": [{"developer-name": "Barry Rigal"}], "item_content_type": "ebook"}, "woodworkingfordummies2ndedition": {"human_name": "Woodworking For Dummies, 2nd Edition", "machine_name": "woodworkingfordummies2ndedition", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Wiley", "publisher-url": "https://www.wiley.com/en-us/Woodworking+For+Dummies%2C+2nd+Edition-p-9781119986515"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 18.0}, "subtitle_html": null, "description_text": "<p>SAND WORDWORKING DOWN TO THE BASICS WITH DUMMIES </p><p>Woodworking For Dummies 2nd Edition guides new and amateur woodworkers through the process of creating beautiful works of wooden art. Start with the basics, like what tools will get the job done. Differentiate between the different types of wood. Make plans for a successful project. The craft of woodworking has never been more accessible than with the experts at Dummies guiding woodworkers along the way. </p><p>UPDATES:</p><p>The most cutting edge tools for the project </p><p>Step-by-step explanations </p><p>Easy to follow photos and guides</p>", "user_ratings": {}, "developers": [{"developer-name": "Jeff Strong"}], "item_content_type": "ebook"}, "mangafordummies2ndedition": {"human_name": "Manga For Dummies, 2nd Edition", "machine_name": "mangafordummies2ndedition", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Wiley", "publisher-url": "https://www.wiley.com/en-us/Manga+For+Dummies%2C+2nd+Edition-p-9781394281121"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 18.0}, "subtitle_html": null, "description_text": "<p>Manga For Dummies, Second Edition is a step-by-step guide that shows beginners and aspiring or professional artists how to develop the basic skills of manga figure drawing and how to create manga characters, from rough sketch stage through final renderings. Youll learn about the history of manga, and its various genres, get acquainted with the most influential manga artists, and discover the tools that you need to get started with drawing manga. You will build your skills, using basic drawing exercises, and learn how to draw the essential components of any manga character. Youll learn the key principles of perspective that will allow you to add interest and depth to your drawings, and how to create the illusion of motion, and emotion, by using different types of lines. Youll learn how to create scripts and storyboards, and all of the other key elements that go into a good manga story.</p><p>New to this edition:</p><ul><li>Find out about the latest digital illustration tools</li><li>Understand how social media can be used as a tool for gaining recognition and displaying your artwork</li><li>An introduction to Clip Studio Paint</li><li>Featuring larger illustrations to provide greater clarity</li></ul>", "user_ratings": {}, "developers": [{"developer-name": "Kensuke Okabayashi"}], "item_content_type": "ebook"}, "rugbyfordummies4thedition": {"human_name": "Rugby For Dummies, 4th Edition", "machine_name": "rugbyfordummies4thedition", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Wiley", "publisher-url": "http://www.wiley.com/en-us/search?pq=https://www.wiley.com/en-us/Rugby+For+Dummies%2C+4th+Edition-p-9781394170555"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 10.0}, "subtitle_html": null, "description_text": "<p>Rugby For Dummies Fourth Edition provides readers with a look at how the game is played, offers strategies for winning, and covers every level of the sport, from high school to college, including women's rugby and the international leagues. This new edition addresses changes to the sport's rules, includes new player bios, looks at how the womens game has grown, and how rugby has become more popular throughout North America.</p>", "user_ratings": {}, "developers": [{"developer-name": "Mathew Brown"}], "item_content_type": "ebook"}, "weldingfordummies2ndedition": {"human_name": "Welding For Dummies, 2nd Edition", "machine_name": "weldingfordummies2ndedition", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Wiley", "publisher-url": "https://www.wiley.com/en-us/Welding+For+Dummies%2C+2nd+Edition-p-9781119849650"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 18.0}, "subtitle_html": null, "description_text": "<p>Welding For Dummies 2nd Edition is designed to serve the needs of the home do-it-yourself welder, as well as skilled trade workers who weld (from farmers and mechanics to machinists and designers) as well as those attending a trade/technical school who are looking for a course supplement. It explains each major welding method, including oxyfuel, electron beam, laser beam, resistance, electric arch, and forge welding. Welding For Dummies also provides information and tips on the practice and usage of these different welding techniques and outlines the required training for welding certification. Updates include incorporating new welding technologies.</p>", "user_ratings": {}, "developers": [{"developer-name": "Steven Robert Farnsworth"}], "item_content_type": "ebook"}, "fantasyfootballfordummies2ndedition": {"human_name": "Fantasy Football For Dummies, 2nd Edition", "machine_name": "fantasyfootballfordummies2ndedition", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Wiley", "publisher-url": "https://www.wiley.com/en-us/Fantasy+Football+For+Dummies%2C+2nd+Edition-p-9781119883340"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 18.0}, "subtitle_html": null, "description_text": "<p>Fantasy Football For Dummies, Second Edition, is a comprehensive guide to understanding how fantasy football works, what the various fantasy league options are, and how to draft and manage your fantasy team. The book is filled with helpful tips and strategizes to help maximize your chances of winning. Youll learn how to be a successful fantasy team owner, manager, and coach, and how to change your roster effectively, week-to-week.</p><p>Whats New:</p><ul><li>Daily Fantasy explained - this is a quick version of fantasy football, dominated by Fan Duel and DraftKings, that involves just one day or one week of games. This model is primarily a paid competition where winnings are funded by other players entrance fees.</li><li>Mobile apps - how to use the best apps to manage your teams and player check stats, update rosters, and communicate with fantasy leagues while on the go.</li><li>The flex position and PPR (point per reception) explained, with information on how to draft strategically to take advantage of these options and rules</li><li>Coverage of NFL rule changes that have taken place since the first edition published, and have had an impact on fantasy football</li></ul>", "user_ratings": {}, "developers": [{"developer-name": "Martin L. Schulman"}], "item_content_type": "ebook"}, "sportscardcollectingandinvestingfordummies": {"human_name": "Sports Card Collecting & Investing For Dummies", "machine_name": "sportscardcollectingandinvestingfordummies", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Wiley", "publisher-url": "https://www.wiley.com/en-us/Sports+Card+Collecting+&+Investing+For+Dummies-p-9781394225064"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 18.0}, "subtitle_html": null, "description_text": "<p>Sports Card Collecting quality control and how to spot card damage; understanding card grading and grading scales; an overview of the history and eras of sports cards; how to find and safely buy, sell and trade on trusted marketplaces;; how to build your collection, how to price and sell your cards; using data to price your cards correctly; how to spot fake cards; tips for finding great deals online and at card shows; tips for how to navigate card shows; how to flip cards for a profit; how to take care of, display, and store your cards; and how to use social media to connect with other collectors and expand your collecting circle.</p>", "user_ratings": {}, "developers": [{"developer-name": "Geoff Wilson"}], "item_content_type": "ebook"}, "casinogamblingfordummies2ndedition": {"human_name": "Casino Gambling For Dummies, 2nd Edition", "machine_name": "casinogamblingfordummies2ndedition", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Wiley", "publisher-url": "https://www.wiley.com/en-us/Casino+Gambling+For+Dummies%2C+2nd+Edition-p-9781119873143"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 18.0}, "subtitle_html": null, "description_text": "<p>Double down on your gaming knowledge before you hit the tablesCasinos can be intimidating places for the first-time visitor. Between all the gaming choices, the distractions of lights and sound, and the fear of losing money, it's easy to miss out on a good time trying to beat the odds. Relax -- this book offers insight from a professional gambler who knows the ropes of casino gambling as well as how to explain it all in easy-to-understand terms. Learn the lay of the land in a typical casino then settle in to bust a dealer at blackjack, bluff your way to a pot in poker, or just pick your lucky number at roulette. You'll also find advice on the various video gambling options, including online casinos, as well as sports betting. Be ready to cash in your winnings!</p><p>Inside...</p><ul><li>Getting familiar with a typical casino</li><li>Understanding the odds (hint - they're usually against you)</li><li>Knowing casino etiquete before you arrive</li><li>Drawing winning cards in blackjack and poker</li><li>Rolling a win in craps or roulette</li><li>Outwitting video poker and slots </li><li>Paying a visit to the sports book</li><li>Gambling online from the comfort of home</li></ul>", "user_ratings": {}, "developers": [{"developer-name": "Kevin Blackwood"}], "item_content_type": "ebook"}, "footballfordummiesusaedition7thedition": {"human_name": "Football For Dummies, USA Edition, 7th Edition", "machine_name": "footballfordummiesusaedition7thedition", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Wiley", "publisher-url": "https://www.wiley.com/en-us/Football+For+Dummies%2C+USA+Edition%2C+7th+Edition-p-9781394181278"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 1.0}, "subtitle_html": null, "description_text": "<p>Football For Dummies, Seventh Edition gives you the working knowledge that you need to follow the game of football and enjoy the game with friends, family, or whomever you watch football with. This book is for everyone who is interested in football and wants to get familiar with the sport, including its history, so they can watch games in person and on television, follow all the action, and enjoy football games to the maximum.</p>", "user_ratings": {}, "developers": [{"developer-name": "Howie Long"}], "item_content_type": "ebook"}, "texasholdemfordummies2ndedition": {"human_name": "Texas Hold'em For Dummies, 2nd Edition", "machine_name": "texasholdemfordummies2ndedition", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Wiley", "publisher-url": "https://www.wiley.com/en-us/Texas+Hold'em+For+Dummies%2C+2nd+Edition-p-9781119873112"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 1.0}, "subtitle_html": null, "description_text": "<p>Don't flop at the poker table! Increase your know-how and increase your chip stack!Royal flush? The river? Big slick? Are these code names for some spy or superhero movie? Nope - they're terms you'll hear thrown around the table when you're playing Texas Hold'em, the most popular poker game at casinos and online sites. Get to know how to use the lingo and draw your way to winning hands with this book. Updated to include expanded information about online poker and improving your mental poker game, it provides insight to game play, winning strategies, and how to take your new skills to the Internet, a friendly game with neighbors, or to the mysterious poker room at the casino.</p><p>Inside:</p><ul><li>Ranking the hands of poker</li><li>Taking in the basic rules</li><li>Applying betting strategies</li><li>Improving your player reads</li><li>Adding bluffing to your game</li><li>Finding the online site to fit your skill</li><li>Braving a poker room</li><li>Adding meditation to your mental game</li></ul>", "user_ratings": {}, "developers": [{"developer-name": "Mark Harlan"}], "item_content_type": "ebook"}, "bikingfordummies": {"human_name": "Biking For Dummies", "machine_name": "bikingfordummies", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Wiley", "publisher-url": "https://www.wiley.com/en-us/Biking+For+Dummies-p-9781394218738"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 18.0}, "subtitle_html": null, "description_text": "<p>With tens of thousands of new cyclists hitting the roads, greenways, and trails, Cycling For Dummies is here to educate and entertain these new riders, and will also be a trusted resource for experienced cyclers. With the rapid growth of e-bikes as both recreation and transportation alternatives, as well as people looking to move from the Peloton to outdoor cycling, Cycling For Dummies will answer all of your questions. E-bike technology is advancing quickly, and there are safety factors to consider, from equipment selection, features and technology, to battery storage and charging, even deciding which class of e-bike should be considered based on how and where it will be used. Cycling For Dummies will walk you through the process and explain your options clearly. Youll also learn about different types of bicycles and how to choose the right one for you; how and where to buy a bike; basic bicycle features and technology; youll learn about necessary cycling gear and equipment; how to set up and use your bike; basic bicycle maintenance and suggested tools; how to ride safely and follow the rules of the road; where to ride and how to find the best trails; and basic training plans to get faster and ride farther.</p>", "user_ratings": {}, "developers": [{"developer-name": "Tyler Benedict"}], "item_content_type": "ebook"}, "cricketfordummies3rdedition": {"human_name": "Cricket For Dummies, 3rd Edition", "machine_name": "cricketfordummies3rdedition", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Wiley", "publisher-url": "https://www.wiley.com/en-us/Cricket+For+Dummies%2C+3rd+Edition-p-9781394164783"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 10.0}, "subtitle_html": null, "description_text": "<p>Cricket For Dummies Third Edition will help you understand the basics of the game, so that you can enjoy watching matches, and even set up a casual game with friends. The book includes clear explanations of the game's laws, step-by-step guides to techniques and tactics, and coverage of the tournaments, leagues around the globe, and great players. </p><p>Cricket For Dummies Third Edition provides a thorough introduction to the sport. This edition is updated to provide more information about Twenty20 cricket, coverage of the womens game, IPL, and Major and Minor League Cricket in the U.S.</p>", "user_ratings": {}, "developers": [{"developer-name": "Julian Knight"}], "item_content_type": "ebook"}, "coincollectingfordummies3rdedition": {"human_name": "Coin Collecting For Dummies, 3rd Edition", "machine_name": "coincollectingfordummies3rdedition", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Wiley", "publisher-url": "https://www.wiley.com/en-us/Coin+Collecting+For+Dummies%2C+3rd+Edition-p-9781119862697"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 18.0}, "subtitle_html": null, "description_text": "<p>Coin Collecting For Dummies, 3rd Edition, provides the latest information on: how to get started in coin collecting; how coin grading works; determining coin values, and navigating the growing trend of buying and evaluating coins online. It's the perfect resource for coin collectors of all ages! </p><p>Inside: </p><p>- Packed with lots of interesting facts, tips, and clear warnings for the beginning collector </p><p>- Covers every part of numismatics, including buying, grading, selling, handling, and storing, </p><p>- Helps collectors decide which type of coins to collect and how to assemble or diversify a great collection </p><p>- Learn how to evaluate coins based on age, condition, rarity, and more </p><p>Updates: </p><p>- Updated chapter covering coin grading/grading services </p><p>- Expanded coverage of the primary role that auction houses play in the coin collecting industry </p><p>- Updated photos, illustrations, and content focusing on recently discovered rare coins, and newly-released coins (U.S. Mint) </p><p>- Updated chapter covering proper storage and handling of coin collections</p>", "user_ratings": {}, "developers": [{"developer-name": "Neil S. Berman"}], "item_content_type": "ebook"}, "pickleballfordummies": {"human_name": "Pickleball For Dummies", "machine_name": "pickleballfordummies", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Wiley", "publisher-url": "https://www.wiley.com/en-us/Pickleball+For+Dummies-p-9781119895152"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 18.0}, "subtitle_html": null, "description_text": "<p>The game with the funny name was created in the 1960's and is, today, the fastest growing sport in America. We take you through the hows of the game. In true Dummies fashion, the material is easy to understand and appropriate for newbies as well as advanced players. We cover it all from scoring, serving, dinking, places to play, and getting more involved in the community. No need to be intimidated - you've got Dummies on your side of the court to give you all the best tips and tricks from expert authors. If you're in a pickle because you don't know anything about this popular game, Pickleball For Dummies will teach you everything you need to know.</p><p>Inside:</p><ul><li>Learn the rules and stroke fundamentals</li><li>Intro to the fun, social aspects of the game</li><li>Advanced strategies that will raise an experienced player to next level</li><li>Tips for tournament players and club organizers</li></ul>", "user_ratings": {}, "developers": [{"developer-name": "Mo Nard"}], "item_content_type": "ebook"}, "drawingfordummies3rdedition": {"human_name": "Drawing For Dummies, 3rd Edition", "machine_name": "drawingfordummies3rdedition", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Wiley", "publisher-url": "https://www.wiley.com/en-us/Drawing+For+Dummies%2C+3rd+Edition-p-9781394199211"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 10.0}, "subtitle_html": null, "description_text": "<p>Drawing For Dummies, Third Edition, provides readers with a fun, easy way to learn the drawing basics and gives them the tools they need to learn the basics and move on to more advanced techniques. Whether you are a beginner, or a more advanced artist, Drawing For Dummies, Third Edition is a helpful, user-friendly resource that meets learners where they are. The author will show readers how to implement a solid, manageable approach to drawing that works no matter what they are drawing. </p><p>This revised edition includes the following updates:</p><ul><li>A greater focus on intriguing aspects of artmaking that dont require special equipment or abilities. </li><li>Readers are introduced to fundamental shifts in attention needed to see the world in a way that is helpful for learning to draw it and are invited to use any materials they have on hand to explore their inner vision and creative responses through drawing exercises.</li><li>Clearer explanations for more challenging concepts - the author will use new objects to get points across in a simpler way that will make it easier for the reader to understand each step</li><li>More step-by-step illustrations will be included and key images will be enlarged so that they are easier to read and study</li></ul>", "user_ratings": {}, "developers": [{"developer-name": "Jamie Platt"}], "item_content_type": "ebook"}, "sailingfordummies3rdedition": {"human_name": "Sailing For Dummies, 3rd Edition", "machine_name": "sailingfordummies3rdedition", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Wiley", "publisher-url": "https://www.wiley.com/en-us/Sailing+For+Dummies%2C+3rd+Edition-p-9781119867258"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 18.0}, "subtitle_html": null, "description_text": "<p>AHOY DUMMIES! Sailing For Dummies 3rd Edition can give any land lubber their sea legs. Learn how to sail the ocean blue, or at least, how to launch the boat. Get started with the sailing basics like tying knots, turning sails, understanding sea conditions, making sense of nautical terms. Whether youre learning to sail for the first time, or youre practically a pirate, this book is the need-to-read reference that will stay at your helm for years to come.</p><p>INSIDE:</p><ul><li>Nautical terms to know</li><li>How to get where youre going</li><li>Knots, sails, and other moving parts</li><li>Choosing the right boat for you</li></ul>", "user_ratings": {}, "developers": [{"developer-name": "J. J. Fetter"}], "item_content_type": "ebook"}, "safeinourworld": {"human_name": "Safe in Our World", "machine_name": "safeinourworld", "youtube_link": null, "callout": null, "publishers": [], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "subtitle_html": null, "description_text": "<p><span><em>Donations to support Safe in Our World are made to &nbsp;<a href=\"https://support.humblebundle.com/hc/en-us/articles/205183597\" target=\"_blank\" rel=\"noopener\">PayPal Giving Fund</a>, subject to its policies.</em></span></p>\n<p><span>The main goal of Safe In Our World is to foster worldwide mental health awareness in the video games industry and wider community. We work with the industry to advocate for better mental health and wellbeing support, helping employers implement policies, training, and resources. We also reach out to gamers to signpost to life-saving resources, raise awareness, and share vital information about mental illness. We strive to eliminate the stigma surrounding mental health, to make it a natural topic of discussion, and to promote the dialogue so people are not afraid to reach out for help if they need it.</span></p>", "user_ratings": {}, "developers": [], "item_content_type": null}, "skateboardingfordummies": {"human_name": "Skateboarding For Dummies", "machine_name": "skateboardingfordummies", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Wiley", "publisher-url": "https://www.wiley.com/en-us/Skateboarding+For+Dummies-p-9781394150007"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 18.0}, "subtitle_html": null, "description_text": "<p>Skateboarding is a fun, challenging, and inclusive sport that can also be a powerful outlet for self-expression. Skateboarding For Dummies will teach you about the history and evolution of skateboarding; skateboard etiquette; board basics; how to master the coolest tricks, grabs, and grinds; and how to skate safely and avoid injury. </p><p>You will also learn how skateboarding can bring positivity to your life and how it can help your self-esteem, help you build confidence, and teach you how to express yourself through your skating style.</p>", "user_ratings": {}, "developers": [{"developer-name": "Daewon Song"}], "item_content_type": "ebook"}}, "charity_data": {"charity_items": {"safeinourworld": {"machine_name": "safeinourworld", "youtube_link": null, "item_content_type": null, "subtitle_html": null, "description_text": "<p><span><em>Donations to support Safe in Our World are made to &nbsp;<a href=\"https://support.humblebundle.com/hc/en-us/articles/205183597\" target=\"_blank\" rel=\"noopener\">PayPal Giving Fund</a>, subject to its policies.</em></span></p>\n<p><span>The main goal of Safe In Our World is to foster worldwide mental health awareness in the video games industry and wider community. We work with the industry to advocate for better mental health and wellbeing support, helping employers implement policies, training, and resources. We also reach out to gamers to signpost to life-saving resources, raise awareness, and share vital information about mental illness. We strive to eliminate the stigma surrounding mental health, to make it a natural topic of discussion, and to promote the dialogue so people are not afraid to reach out for help if they need it.</span></p>", "human_name": "Safe in Our World", "developers": [], "publishers": [], "user_ratings": {}}}}, "from_bundle": {"machine_name": "hobbiesandgamesfordummieswiley_bookbundle", "tile_short_name": "Hobbies and Games for Dummies by Wiley", "short_marketing_blurb": "Read up before hitting the courts", "marketing_blurb": "Get <em>Biking For Dummies</em>, <em>Pickleball For Dummies</em>, <em>Skateboarding For Dummies</em>, <em>Manga For Dummies, 2nd Edition</em>, <em>Welding For Dummies, 2nd Edition</em>, <em>Woodworking For Dummies, 2nd Edition</em>, and more!", "detailed_marketing_blurb": "Have you ever wanted to pick up a new hobby? Learn how to play sports and create using your hands with help from our latest For Dummies Bundle. The experts at Wiley can prepare you for anything with ebooks like <em>Manga For Dummies</em>, <em>Pickleball For Dummies</em>, <em>Welding For Dummies</em>, and much more. Impress your friends and stay active alongside them today with our Hobbies and Games for Dummies bundle. Plus, your purchase helps support Safe In Our World. ", "author": "Wiley", "start_date|datetime": "2025-02-01T19:00:00", "end_date|datetime": "2025-02-22T19:00:00", "type": "bundle", "product_url": "/books/hobbies-and-games-for-dummies-wiley-books"}, "updated_at|datetime": "2025-02-02T03:03:34.939318", "first_seen_at|datetime": "2025-02-02T03:03:34.939318"}
