{"machine_name": "summersplash_bundle", "author": "Publishers", "basic_data": {"eula": null, "human_name": "Summer Splash", "detailed_marketing_blurb": "Dive into great water-themed games with the all-new Summer Splash Bundle. Defend the heir to the crabby kingdom using expert strategy and coral reefs as defense in <em>Crab God</em>. Leap through a kid-friendly action-platformer set on the island of Mara in <em>Koa and the 5 Pirates of Mara</em>. Explore the dark depths of the ocean with an unparalleled sense of atmosphere in <em>ABZU</em>, and more. Play great games that emphasize ocean conservation—and help support Coral Guardian with your purchase.", "short_marketing_blurb": "From the beach to your gaming setup", "media_type": "game", "description": "<p><strong>From the beach to your gaming setup.</strong> Dive into great water-themed games with the all-new Summer Splash Bundle. Defend the heir to the crabby kingdom using expert strategy and coral reefs as defense in <em>Crab God</em>. Leap through a kid-friendly action-platformer set on the island of Mara in <em>Koa and the 5 Pirates of Mara</em>. Explore the dark depths of the ocean with an unparalleled sense of atmosphere in <em>ABZU</em>, and more. Play great games that emphasize ocean conservation—and help support Coral Guardian with your purchase.</p>\n<p><strong>Pay $4 or more.</strong> Normally, the total cost for the games in this bundle is as much as $164. Here at Humble Bundle, you choose the price and increase your contribution to upgrade your bundle! This bundle has a minimum $4 purchase. Pay $4 or more to access Steam keys.</p>\n<p><strong>Redeem on Steam.</strong> All of the games in this bundle are available on Steam for Windows. Please review the system requirements <a href=\"https://support.humblebundle.com/hc/en-us/articles/38533311046171\">here</a> prior to purchasing.</p>\n<p><strong>Support charity.</strong> Choose where the money goes - between the publishers and to support Coral Guardian. If you like what we do, you can leave us a Humble Tip too!</p>", "legal_disclaimer": null, "required_account_links": ["steam"], "end_time|datetime": "2025-07-17T01:00:00"}, "tier_item_data": {"blazingsails": {"human_name": "Blazing Sails", "machine_name": "blazingsails", "youtube_link": "Nlq3-ECVsvA", "callout": "<p>88% Positive on Steam</p>\n<p><span style=\"color: #ef9741;\">Yarr! Hit the high seas and band together with your friends in this fast paced PVP with multiple game modes</span></p>", "publishers": [{"publisher-name": "Iceberg", "publisher-url": "https://www.iceberg-games.com/"}], "side_box_art_text": null, "third_party_subscribe_text": null, "min_price|money": {"currency": "USD", "amount": 8.0}, "subtitle_html": null, "description_text": "<strong class=\"hmb\">Explore different game-modes! </strong> <br><br>In <strong> Treasure Hunt </strong> you and your crew must search islands for treasure chests! Treasures can be turned in at one of the 2 outposts at the centre of the map in exchange for gold. Get more gold than your enemies to win! <br><br>Our <strong> Battle Royale </strong> offers a unique take on the genre. Enjoy a dynamic mix of swashbuckling on dry land and epic naval battles! Sink every other crew to emerge victorious. <br><br>Tired of looting? No problem! Jump straight into the action in our all new <strong> Galleon Conquest </strong> game mode. Experience movie-like broadside battles with a HUGE Galleon! Frag pirates, sink other ships and capture flags to win!<strong class=\"hmb\"><br><br>Part of the ship, part of the crew </strong> <br><br>Who knew being a pirate actually takes teamwork? Well, it does! Along with your fellow crew members you'll need to steer, repair and re-supply your ship while besieging enemy crews. Communication and cooperation are essential to secure a victory! <br><strong class=\"hmb\"><br>Choose your vessel! </strong> <br><br>A variety of ship types offer distinctly different play styles for your crew. The Brigantine is the classic - with a hull that can take a pounding and some serious firepower. The Junk Ship is smaller, faster and packs a front-facing cannon for daring head-on assaults! The Bomb Vessel is especially powerful at long distances with its unique mortar cannon. For the smaller crews there's a 2-player Sloop. But don't let its size fool you! The Sloop can easily go toe to toe with the bigger 4-player ships. <br><strong class=\"hmb\"><br>Equip a variety of legendary pirate arrrms </strong> <br><br>Change your playstyle based on the weapons you plunder. Take to the crow’s nest with your trusty sharpshooter, or board an enemy ship with the legendary life-stealing Sword of the Sea! Like something more explosive? Try the shoulder-cannon or fish-launcher. To each their own! <br><strong class=\"hmb\"><br><br>Build-A-Buccaneer </strong> <br><br>No two ships or pirates are the same! Show off your booty with a swath of customisable parts, clothing and accessories - embroidered jackets, gilded hulls, golden peg legs - you’ll get real fancy, real fast", "user_ratings": {}, "developers": [{"developer-name": "Iceberg Interactive", "developer-url": "https://www.iceberg-games.com/"}, {"developer-name": "Get Up Games", "developer-url": "https://www.blazingsails.com/"}], "item_content_type": "game"}, "aquariumdesigner": {"human_name": "Aquarium Designer", "machine_name": "aquariumdesigner", "youtube_link": "Qbujk2p8uO8", "callout": "<p>86% Positive on Steam</p>\n<p><span style=\"color: #ef9741;\">Create your perfect dream Aquarium!</span></p>", "publishers": [{"publisher-name": "Playway S.A", "publisher-url": "https://playway.com/en/"}], "side_box_art_text": null, "third_party_subscribe_text": null, "min_price|money": {"currency": "USD", "amount": 4.0}, "subtitle_html": null, "description_text": "Have you ever dreamed about your own aquarium? Do you already have one, but it’s not enough? Or maybe you want to test yourself before having the real fish tank? <i>Aquarium Designer</i> is a game for you! In <i>Aquarium Designer</i> you can design and create realistic fish tanks of various scales - from small fish tanks to large aquariums. Fill them with all the kinds of different aquatic species - angelfish, bettas, goldfish, and many, many more! <i>Aquarium Designer</i> creates an opportunity to make an ideal aquarium and behold your creation! <br><br>In <i>Aquarium Designer</i> you design the aquariums for the customers and earn money to buy new elements to use in the future! Restaurants, hotels, offices, or even a rich businessman’s residence - every place can benefit from a colorful fish tank teeming of life! Read the client’s design brief, choose the shape and size of the fish tank, then add all the necessary equipment - filters, water conditioners, and air pumps. Throw in some gravel, decorations, and fish and there it is - ready for use! The better you do the more money you earn! <br><br>Every professional needs some time off! In <i>Aquarium Designer</i> you can enjoy creating your very own fish tank in two creative modes - Casual and Realistic. You can try different configurations and elements, but always remember about the future residents of your fish tank - that means the fish of course! Different species have different needs and require specific conditions. And if anything goes wrong, you can always try again - no animals will be harmed!", "user_ratings": {}, "developers": [{"developer-name": "Sigur Studio", "developer-url": "https://sigurstudios.com/"}], "item_content_type": "game"}, "coralguardian": {"human_name": "Coral Guardian", "machine_name": "coralguardian", "youtube_link": null, "callout": null, "publishers": [], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "subtitle_html": null, "description_text": "<span><em>Donations to support&nbsp;Coral Guardian&nbsp;are made to <a href=\"https://support.humblebundle.com/hc/en-us/articles/205183597\" target=\"_blank\" rel=\"noopener\">PayPal Giving Fund</a>, subject to its policies.</em><br><br>Coral Guardian's mission is to protect and restore coral ecosystems worldwide, by working hand in hand with local communities who depend on them.</span>", "user_ratings": {}, "developers": [], "item_content_type": null}, "ultimatefishingsimulator": {"human_name": "Ultimate Fishing Sim", "machine_name": "ultimatefishingsimulator", "youtube_link": "gEQanGX65T0", "callout": "<p>89% Positive on Steam</p>\n<p><span style=\"color: #ef9741;\">Fish any time anywhere, and the fish are always biting!</span></p>", "publishers": [{"publisher-name": "Ultimate Games S.A.", "publisher-url": "https://ultimate-games.com/"}], "side_box_art_text": null, "third_party_subscribe_text": null, "min_price|money": {"currency": "USD", "amount": 4.0}, "subtitle_html": null, "description_text": "<p><i> Ultimate Fishing Simulator is a comprehensive fishing simulator that allows using various techniques, in different places around the world, and most importantly, you don’t need a permanent connection to the Internet for it. </i></p>\n<p>If you are bored of waiting for fish to take you and falling asleep in front of the computer, you have played a bad game! In the Ultimate Fishing Simulator, this will never happen. Select the appropriate equipment and bait, cast your line, and wait for a bite. Success is guaranteed.</p>\n<p>In addition to traditional fishing techniques, in Ultimate Fishing Simulator you’ll also find a winter map where you will be able to go ice fishing! Buy an auger at the store, find a suitable location and drill an air hole. But not too small, so that you can remove the fish.</p>\n<p>There are two modes of difficulties in the Ultimate Fishing Simulator, thanks to which there is something for everyone. Normal Mode allows you to enjoy the game in all its glory. In normal mode, all the features in the game are included. Realistic Mode requires more patience and efficiency from the player. Fish will be biting less and will fight longer. Some game features in this mode are disabled, such as the underwater camera.</p>\n<p>Every fisherman likes to admire his trophies. Some release their fish, and other stuff and hang them on their walls. In Ultimate Fishing Simulator you can exactly do the same! Decide what you want to do with the fish you catch. Sell? Release? Stuff? The choice is yours.</p>\n<p>If the maps available in the game bore you, you can create your own. Be creative and build your dream fishery that you can share with other players thanks to the built-in level editor. Enjoy fishing with your friends in your favorite, family fishery. What more could you ask for?</p>\n<strong class=\"hmb\">FEATURES </strong> <br>\n<ul>\n<li>\n<p><strong> No micropayments </strong> - no need to worry about your wallet. You buy the game once and you play it as long as you like.</p>\n</li>\n<li>\n<p>The largest selection of fishing techniques from among all the games available on the market:</p>\n<ul>\n<li>\n<p><strong> Float fishing </strong> – a classic fishing technique, ideal for beginners or those looking for calm and relaxation,</p>\n</li>\n<li>\n<p><strong> Bottom fishing </strong> – bait feeders, ground baits, rod pods, bite indicators - we have everything you need to catch a 50 kg carp,</p>\n</li>\n<li>\n<p><strong> Spinning </strong> – the most popular fishing method in the world. Dozens of different baits, rods and reels</p>\n</li>\n<li>\n<p><strong> Fly fishing </strong> – you can’t find fish? Look for rings on the surface of the water and for certain you’ll find some fish near them. Prepare a nymph and make a precession cast</p>\n</li>\n<li>\n<p><strong> Sea fishing </strong> – get ready for extreme conditions and supernatural effort. Marlins are not as gentle as pikes or huchens. A unique fight and an unforgettable experience are waiting for you!</p>\n</li>\n<li>\n<p><strong> Surfcasting </strong> – set up the pods, prepare the strongest braid that you have, and cast the bait into the deep dark blue</p>\n</li>\n<li>\n<p><strong> Ice fishing </strong> – grab an auger, find a suitable location, and start drilling a hole!</p>\n</li>\n</ul>\n<p></p>\n</li>\n<li>\n<p>Powerful equipment in the game - rod pods, indicators, ground baits, nymphs, streamers, feeders, and much, much more!</p>\n</li>\n<li>\n<p>7 realistic fisheries from around the world, 2 additional ones are available during the winter and in the open ocean.</p>\n</li>\n<li>\n<p>Levels of difficulty - Normal and Realistic</p>\n</li>\n<li>\n<p>Multiplayer game mode – Meet players from around the world, exchange opinions and insights, or challenge your rivals in tournaments. Prove who is the best in the world and climb in the official rankings.</p>\n</li>\n<li>\n<p>Camera with a view of the bait - i.e. an underwater camera that will allow you to observe the underwater life of fish and adjust the appropriate technique to the given conditions in the waters</p>\n</li>\n<li>\n<p>24-hour day cycle! If you have not caught any fish during the day, try at night</p>\n</li>\n<li>\n<p>Dynamic weather – the weather is just as changeable and unpredictable as real life. Atmospheric phenomena such as temperature, mist, wind, rain, and snow</p>\n</li>\n<li>\n<p>Tournaments - private/public/global. Do you want to play against your friends? Invite them to a game and run a private tournament. If you are looking for challenges, take part in global tournaments where you’ll face players from around the world.</p>\n</li>\n<li>\n<p>The possibility of touring lakes, rivers, or oceans on boats, yachts, and small speedboats</p>\n</li>\n<li>\n<p>The only fishing simulator in the world with advanced editor levels that will allow you to create your dream map with your favorite fish</p>\n</li>\n<li>\n<p>Unique trophy room in which you can admire fish that you caught</p>\n</li>\n<li>\n<p>Licensed equipment by <strong> SAKURA (SERT S.A.S) </strong></p>\n</li>\n<li>\n<p>The possibility of playing without an Internet connection (offline)*</p>\n</li>\n</ul>\n<p><i> * A connection to the Internet is required to play the game in multiplayer mode. </i></p>", "user_ratings": {}, "developers": [{"developer-name": "Bit Golem", "developer-url": "http://bitgolemgames.com/presskit/"}], "item_content_type": "game"}, "fishing_northatlantic": {"human_name": "Fishing North Atlantic", "machine_name": "fishing_northatlantic", "youtube_link": "r1v0yr5jMHY", "callout": "<p>73% Positive on Steam</p>\n<p><span style=\"color: #ef9741;\">The peak of virtual Commercial Fishing in the North Atlantic. Keep your ship and gear at tip quality shape as you fish in beautiful Nova Scotia.</span></p>", "publishers": [{"publisher-name": "rokaplay", "publisher-url": "https://www.rokaplay.com/"}], "side_box_art_text": null, "third_party_subscribe_text": null, "min_price|money": {"currency": "USD", "amount": 8.0}, "subtitle_html": null, "description_text": "The sequel to the popular simulation game <strong> Fishing: Barents Sea </strong> invites you to put on your captain’s hat once again: Explore the large ocean of Nova Scotia, try your hand at entirely new fishing methods and enjoy huge range of highly detailed ships in the commercial fishing simulator <strong> <i>Fishing: North Atlantic</i> </strong> . <br><br>Discover majestic world of <i> Canadian Nova Scotia </i> while admiring the vast diversity of ocean life. Explore the fishing zones with upgradable ships and gear as you progress in your career. <br><br>Like our predecessor game <strong> Fishing Barents Sea </strong> , <strong> <i>Fishing: North Atlantic</i> </strong> makes you experience an atmospheric and realistic game world based on real maps, boats and fish species. Get ready to enjoy new weather systems with upgraded atmospheric effects, North American Vessels and fishing techniques like harpoons, deep-line-buoy-fishing and lobster pots. Purchasing larger boats and better gear will increase your fisherman skills. <br><br><strong> <i>Fishing: North Atlantic</i> </strong> offers you 27 ships at your disposal for all types of fishing styles and fishing techniques like the harpooning, which is used to hunt swordfish and tuna. Start with harpooning, then work your way up to setting deep lines, catching snow crabs or lobster. As well as longline, net and trawling. Do you have what it takes to fulfill this challenging task? <br><br>Plan the course of your fishing career throughout the whole year: Brave rain and snow while looking for the best fishing areas, but make sure that you are not in danger of exceeding your quotas! The new advanced fish-AI will require the use of GPS and sonar to follow the movement of your prey depending on weather and season. <strong class=\"hmb\"> <br><br>Key Features </strong> <br>\n<ul>\n<li><i> Fishing methods </i> – Harpooning, Deepline, Lobster, Crabbing, Longline, Net, Trawling </li>\n<li><i> Fish species </i> – Swordfish, Tuna, Lobster, Snow Crab, Cod, Haddock, Pollack, Redfish, Mackerel, Silver Hake </li>\n<li>Advanced watershader and weather system, with realistic weather data from the area </li>\n<li>Dynamic fish prices – Other fishingboats will also fish and deliver fish at the ports, which affects the prices </li>\n<li>Dynamic fish habitats – Fish will swim around the map through the yearly seasons </li>\n<li>27 real handcrafted boats available from fishing industry licensepartners </li>\n<li>Huge map over <i> Nova Scotia, Canada </i> (200x300km) with six realistic ports </li>\n<li>Fishing industry license partners - A.F. Theriaul &amp; Son, Skipasyn, Scanmar, Hermes, Selfa and Moen Marin</li>\n</ul>", "user_ratings": {}, "developers": [{"developer-name": "Misc Games", "developer-url": "https://www.miscgames.com/"}], "item_content_type": "game"}, "crabgod": {"human_name": "Crab God", "machine_name": "crabgod", "youtube_link": "apuqVdMiZ9U", "callout": "<p>85% Positive on Steam</p>\n<p><span style=\"color: #ef9741;\">Sheperd your colony of crabs and make safe the Egg of the next Crab God. Make waves, praise the claw!</span></p>", "publishers": [{"publisher-name": "Firesquid", "publisher-url": "https://firesquid.games/"}], "side_box_art_text": null, "third_party_subscribe_text": null, "min_price|money": {"currency": "USD", "amount": 12.0}, "subtitle_html": null, "description_text": "Become the Guardian of the Abyss and lead the Great Migration to bring forth the next <i>Crab God</i> 🦀 Use your growing knowledge and great power to command your loveable crab babies (Crablings) to restore your ocean domain and protect your successor’s egg as you venture into the watery depths. <br><strong class=\"hmb\"><br><br>Grow Your Crabling Colony </strong> <br>Raise your Crablings! Nurture their personalities and potential as they worship you, build mighty coral reefs, fend off threats, and collect food for the journey ahead. Name them. Upgrade them. Grow your unique colony and guide them with your mighty claw as they become the next generation of ocean caretakers. <br><strong class=\"hmb\"><br><br>Lead the Great Migration </strong> <br>It is time for a new <i>Crab God</i> to rise and protect the oceans and it is your job to lead a successful migration, taking your egg to the depths where it can hatch. Balance the growth of your colony with the safety of your egg, otherwise, you will need to return to the shallows and start the migration anew. <br><strong class=\"hmb\"><br><br>Cultivate a Vibrant Underwater Ecosystem </strong> <br>Reintroduce a healthy and vibrant diversity back to the ocean, and protect it from predators seeking easy prey. Varied sea life will sustain your colony. Unlock new combinations of flora and fauna to create a beautiful underwater environment. <br><strong class=\"hmb\"><br><br>Real World Change </strong> <br>Working with dots.eco, your in-game progression will help contribute to actual ocean conservation efforts. As you cultivate the great reefs of the <i>Crab God</i>, you will also be helping to sustain the beautiful world environment that inspires games like ours. <br><strong class=\"hmb\"><br><br>!UPDATE! Crabling Customisation </strong> <br>Make each of your precious Crablings unique by customising their color, accessories, tools and more! You can even unlock little fish buddies to keep them company as you play.", "user_ratings": {}, "developers": [{"developer-name": "Chaos Theory Games", "developer-url": "https://www.chaostheorygames.com/"}], "item_content_type": "game"}, "abzu": {"human_name": "Abzu", "machine_name": "abzu", "youtube_link": "wsHTdVtu6tE", "callout": "<p>93% Positive on Steam</p>\n<p><span style=\"color: #ef9741;\">\"A beautiful underwater adventure that evokes the dream of diving!\"</span></p>", "publishers": [{"publisher-name": "505 Games", "publisher-url": "http://www.505games.com/"}], "side_box_art_text": null, "third_party_subscribe_text": null, "min_price|money": {"currency": "USD", "amount": 8.0}, "subtitle_html": null, "description_text": "<p>From the art director of Journey® and Flower®, ABZÛ is a beautiful underwater adventure that evokes the dream of diving.</p>\n<p>Immerse yourself in a vibrant ocean world full of mystery and bursting with color and life. Perform fluid acrobatics as the Diver using graceful swimming controls. Discover hundreds of unique species based on real creatures and form a powerful connection with the abundant sea life</p>\n<p>Interact with schools of thousands of fish that procedurally respond to you, each other, and predators. Linger in epic seascapes and explore aquatic ecosystems modeled with unprecedented detail.</p>\n<p>Descend into the heart of the ocean where ancient secrets lie forgotten. But beware, dangers lurk in the depths. \"ABZÛ\" is from the oldest mythologies; AB, meaning water, and ZÛ, meaning to know. ABZÛ is the ocean of wisdom.</p>", "user_ratings": {}, "developers": [{"developer-name": "Giant Squid", "developer-url": "http://giantsquidstudios.com/"}], "item_content_type": "game"}, "koaandthefivepiratesofmara": {"human_name": "Koa and the Five Pirates of Mara", "machine_name": "koaandthefivepiratesofmara", "youtube_link": "6KvtCCkwWxI", "callout": "<p>89% Positive on Steam</p>\n<p><span style=\"color: #ef9741;\">Join Koa and Napopo on a 3D platformer adventure through the islands of Mara!</span></p>", "publishers": [], "side_box_art_text": null, "third_party_subscribe_text": null, "min_price|money": {"currency": "USD", "amount": 12.0}, "subtitle_html": null, "description_text": "Join series favorite Koa and her friend Napopo on an action-packed journey through the world of Mara! Traverse wild islands, dodge cunning traps, and defeat the pirate bosses in this loving tribute to classic platforming adventures. <br>\n<ul>\n<li>Eight worlds to discover and explore. Each level has its own theme, traps, and bits of story.</li>\n<li>Sail through the ocean and upgrade your boat to reach every corner of Mara.</li>\n<li>Full of memorable characters. Meet all kinds of characters and help them.</li>\n<li>Discover all kinds of hidden secrets, challenges, and collectibles!</li>\n<li>Upgrade and customize the city of Qälis and get a lot of new skins and backpacks for Koa.</li>\n</ul>\nUnlock an archipelago piece by piece. From sandy beaches to bubbling volcanoes, there’s no shortage of charming and colorful islands to visit, each one chock full of secrets and collectibles. Each level offers beautiful visuals rich with detail and depth. <br><br>Relax and unwind - or knuckle down and challenge yourself! From newcomers to speedrunners, Koa and the Five Pirates is a buccaneering adventure for all.", "user_ratings": {}, "developers": [{"developer-name": "Chibig"}, {"developer-name": "Talpa Games"}, {"developer-name": "Undercoders"}], "item_content_type": "game"}, "strandedsails-explorersofthecursedislands": {"human_name": "Stranded Sails - Explorers of the Cursed Islands", "machine_name": "strandedsails-explorersofthecursedislands", "youtube_link": "gUpKo9DPwnU", "callout": "<p>72% Positive on Steam</p>\n<p><span style=\"color: #ef9741;\">Survive, farm, and cook in this Casual open world farming adventure on the Cursed Islands</span></p>", "publishers": [{"publisher-name": "rokaplay", "publisher-url": "https://www.rokaplay.com/"}], "side_box_art_text": null, "third_party_subscribe_text": null, "min_price|money": {"currency": "USD", "amount": 4.0}, "subtitle_html": null, "description_text": "Stranded Sails is a <strong> family-friendly single-player open world farming adventure in a relaxing caribbean setting </strong> . A linear quest line guides you through the world and story with a lot to discover on the wayside. Set up camp and start farming. Manage your energy and cook to stock up on food reserves. Explore the Cursed Islands to find useful items, rewarding activities, hidden secrets and more. Decorate the shacks of your crew members to improve your relationship with them and earn advantageous perks. Uncover the mysteries of the archipelago, lift the curse and maybe even convince your crew to stay! <br><br>Explore the Cursed Islands by foot and boat to <strong> find useful items, fishing spots, rewarding activities and hidden secrets </strong> . Stock up on food reserves and manage your energy while travelling. <br><br>Set up and expand your camp with your own little farm, shacks for your crew members and more. Cook food and craft items to prepare for your exploration trips.<br><br><strong> Decorate </strong> your crew members shacks to improve your relationship with them. Give gifts to unlock new decorations and provide stew for the crew to earn useful upgrades for your tools, farm and more.<br><br>Earn powerful relationship perks that allow you to sprint faster, gain bonus loot and much, much more!<br><br><strong> Try before you buy - Stranded Sails - Prologue: </strong> <br><br><a href=\"https://store.steampowered.com/app/1026100/Stranded_Sails__Prologue/\"> https://store.steampowered.com/app/1026100/Stranded_Sails__Prologue/ </a> <strong class=\"hmb\"> <br><br>Story </strong> <br>Uncover the mystery of the Cursed Islands and lift their curse, guided by a linear quest line. Complete your adventure by leaving the islands or convincing your crew to stay! <strong class=\"hmb\"> <br><br>Open World </strong> <br>Complete island activities like \"Monkey Chase\" and \"Watchful Seagulls\" to acquire shiny plunder. Find fishing spots all over the islands and catch fish to cook especially energizing meals! Find and spend key shards at ancient portal stones to fast travel to locations you have visited before. <strong class=\"hmb\"> <br><br>Camp </strong> <br>Plant seeds you find while exploring to farm crops and harvest cooking ingredients. Discover new cooking recipes in a puzzle-like minigame. Combine different components at your workbench to craft new items. Expand your camp by building various structures provided by your crew as a reward for the stew. <strong class=\"hmb\"> <br><br>Crew </strong> <br>Decorate the shacks of your crew members to improve your relationship with them and earn powerful perks. Find gifts while exploring and give them to your crew to unlock new decorations. Provide stew for the crew and receive useful rewards like tool upgrades, farm expansions and more! <strong class=\"hmb\"> <br><br>Collectibles </strong> <br>Find hidden collectibles to unlock different wearable outfits, golden tools, hats and lore artifacts.", "user_ratings": {}, "developers": [{"developer-name": "Alchemist Interactive", "developer-url": "https://www.alchemist.email/our-studio/"}], "item_content_type": "game"}}, "charity_data": {"charity_items": {"coralguardian": {"machine_name": "coralguardian", "youtube_link": null, "item_content_type": null, "subtitle_html": null, "description_text": "<span><em>Donations to support&nbsp;Coral Guardian&nbsp;are made to <a href=\"https://support.humblebundle.com/hc/en-us/articles/205183597\" target=\"_blank\" rel=\"noopener\">PayPal Giving Fund</a>, subject to its policies.</em><br><br>Coral Guardian's mission is to protect and restore coral ecosystems worldwide, by working hand in hand with local communities who depend on them.</span>", "human_name": "Coral Guardian", "developers": [], "publishers": [], "user_ratings": {}}}}, "from_bundle": {"machine_name": "summersplash_bundle", "tile_short_name": "Summer Splash", "short_marketing_blurb": "From the beach to your gaming setup", "marketing_blurb": "Get <em>Abzu</em>, <em>Crab God</em>, <em>Aquarium Designer</em>, and more!", "detailed_marketing_blurb": "Dive into great water-themed games with the all-new Summer Splash Bundle. Defend the heir to the crabby kingdom using expert strategy and coral reefs as defense in <em>Crab God</em>. Leap through a kid-friendly action-platformer set on the island of Mara in <em>Koa and the 5 Pirates of Mara</em>. Explore the dark depths of the ocean with an unparalleled sense of atmosphere in <em>ABZU</em>, and more. Play great games that emphasize ocean conservation—and help support Coral Guardian with your purchase.", "author": "Publishers", "start_date|datetime": "2025-07-02T18:00:00", "end_date|datetime": "2025-07-17T01:00:00", "type": "bundle", "product_url": "/games/summer-splash"}, "updated_at|datetime": "2025-07-03T03:25:48.670302", "first_seen_at|datetime": "2025-07-03T03:25:48.670302"}
