{"machine_name": "betterwith4friendscoopbundle_bundle", "author": "Publishers", "basic_data": {"eula": null, "human_name": "Better with 4 Friends! Co-Op Bundle", "detailed_marketing_blurb": "Grab your besties for a co-op game night with the all-new Better With 4 Friends Bundle! Play a variety of hilarious and wacky indie games designed to get the whole squad laughing. Lay track before the train crashes in <em>Unrailed!</em>, turn moving day into pure chaos in <em>Moving Out</em>, and battle blazes together in <em>Embr</em>—plus so much more. Pay what you want for this laugh-packed collection and help support the Michael J. Fox Foundation with your purchase!", "short_marketing_blurb": "Grab the gang—let's game!", "media_type": "game", "description": "<p><strong>Grab the gang—let's game!</strong> Grab your besties for a co-op game night with the all-new Better With 4 Friends Bundle! Play a variety of hilarious and wacky indie games designed to get the whole squad laughing. Lay track before the train crashes in <em>Unrailed!</em>, turn moving day into pure chaos in <em>Moving Out</em>, and battle blazes together in <em>Embr</em>—plus so much more. Pay what you want for this laugh-packed collection and help support the Michael J. Fox Foundation with your purchase!</p>\n<p><strong>Pay $10 or more.</strong> Normally, the total cost for the games in this bundle is as much as $154. Here at Humble Bundle, you choose the price and increase your contribution to upgrade your bundle! This bundle has a minimum $10 purchase. Pay $10 or more to access Steam keys.</p>\n<p><strong>Redeem on Steam.</strong> All of the games in this bundle are available on Steam for Windows — and some for Mac and Linux too.</p>\n<p><strong>Support charity.</strong> Choose where the money goes - between the publishers and to support Michael J. Fox Foundation. If you like what we do, you can leave us a Humble Tip too!</p>", "legal_disclaimer": null, "required_account_links": ["steam"], "end_time|datetime": "2025-08-23T03:00:00"}, "tier_item_data": {"portalknights": {"human_name": "Portal Knights", "machine_name": "portalknights", "youtube_link": "CXxAjHeBViI", "callout": "<p>83% Positive on Steam</p>\n<p><span style=\"color: #ef9741;\">A 3D sandbox action RPG with crafting elements, often described as a blend of Minecraft and an action RPG. (Steam Deck Playable)</span></p>", "publishers": [{"publisher-name": "505 Games", "publisher-url": "http://www.505games.com/"}], "side_box_art_text": null, "third_party_subscribe_text": null, "min_price|money": {"currency": "USD", "amount": 10.0}, "subtitle_html": null, "description_text": "Prove yourself a Portal Knight by levelling up your character, crafting epic weapons, and vanquishing foes in real-time in this cooperative, 3D sandbox action RPG. <br><br>Explore dozens of randomly-generated islands! Build almost anything! In a world torn apart by the Fracture and terrorized by the Hollow King, you and your friends are its only hope! <br><br><strong> Craft your adventure. Forge your hero. Become the ultimate Portal Knight! </strong> <strong class=\"hmb\"> <br><br>Key Features </strong> <br>\n<div><img height=\"200\" src=\"https://hb.imgix.net/5677cd54f4e96105a340e67eda104af561d88bda.png?auto=compress,format&amp;s=b1ade81b55339d9560298f8fa1aa1768\" width=\"600\"></div>\n<ul>\n<li>Play as a Warrior, Mage or Ranger, then customize your appearance, abilities, and gear. Unlock amazing new talents as you level up!</li>\n<li>Build almost anything using dozens of materials and furnishings – including NPCs! Unlock private islands where you can build your own castle to store your treasured belongings and to show off to your friends!</li>\n<li>Vanquish enemies in real-time tactical combat! Consider carefully a foe's unique strengths and weaknesses as you choose from a variety of weapons, spells, and special abilities!</li>\n<li>Use the mysterious Portals to travel between dozens of randomly generated 3D sandbox worlds. Collect resources for crafting in caves, lakes, and dungeons filled with surprises.</li>\n<li>Play with friends in 4-person cooperative multiplayer or on a 2-player split screen. Work together to build awe-inspiring architecture and explore dangerous dungeons or play separately.</li>\n<li>Architect your own island! Create AMAZING structures quickly and easily in Creative Mode and share them with your friends on the Steam Workshop!</li>\n<li>Vanquish the Greatbeasts – the most vicious and dangerous \"boss\" creatures in all the realm. Each has their own hideous hideaway.</li>\n<li>Explore a world filled with colorful characters, aid them in their quests, and bring them to your castle!</li>\n<li>Take the adventure to ever-changing landscapes as you complete quests and earn exclusive items during random events across the fractured world.</li>\n</ul>", "user_ratings": {}, "developers": [{"developer-name": "Keen Games", "developer-url": "http://www.keengames.com/"}], "item_content_type": "game"}, "towerfall_ascension": {"human_name": "Towerfall Ascension", "machine_name": "towerfall_ascension", "youtube_link": "PePm9lYQ038", "callout": "<p>95% Positive on Steam</p>\n<p><span style=\"color: #ef9741;\">A beloved 2D archery combat arena game designed for intense local multiplayer (though it also has single-player/co-op modes). Players control archers and battle it out in single-screen arenas, aiming to eliminate opponents by shooting them with arrows or stomping on their heads. (Steam Deck Playable)</span></p>", "publishers": [{"publisher-name": "Maddy Makes Games", "publisher-url": "https://www.mattmakesgames.com/"}], "side_box_art_text": null, "third_party_subscribe_text": null, "min_price|money": {"currency": "USD", "amount": 10.0}, "subtitle_html": null, "description_text": "<h4>Summary</h4>\n<p><i>TowerFall Ascension</i>&nbsp;is the definitive version of the hit archery combat game. Inspired by classics from the golden age of couch multiplayer, it's a 4-player local party game centering around hilarious, intense versus matches. The core mechanics are simple and accessible, but hard to master and combat is fierce. Loot treasure chests for game-changing power-ups, master the art of catching arrows out of the&nbsp;<g class=\"gr_ gr_30 gr-alert gr_gramm gr_disable_anim_appear Punctuation only-del replaceWithoutSep\" id=\"30\" data-gr-id=\"30\">air,</g>&nbsp;or descend on your foes and stomp them into submission.&nbsp;<i>TowerFall</i>&nbsp;is best played competitively with friends, cross-legged on the floor within punching distance of each other.</p>\nNew in Ascension is the 1- or 2-player co-op Quest mode. Players work together, fighting off a variety of monsters and enemy archers across the land of&nbsp;<i>TowerFall</i>. It's a new adventure to explore when you don't have more friends handy to square off against.<br /><br />\n<h4>Features</h4>\n<ul>\n<li>Brand new 1- or 2-player co-op Quest mode</li>\n<li>50 additional Versus arenas, for a total of 120 unique maps</li>\n<li>More game-changing power-ups, such as Drill Arrows that burrow through walls</li>\n<li>4 new unlockable, playable archers, for a total of 8</li>\n<li>A huge list of variants to customize your matches - a total of 67 ways to mix things up</li>\n<li>Plenty of hidden secrets and surprises to discover with your friends</li>\n</ul>", "user_ratings": {}, "developers": [{"developer-name": "EXOK Games, Maddy Makes Games Inc.", "developer-url": "https://exok.com/"}], "item_content_type": "game"}, "movingout": {"human_name": "Moving Out", "machine_name": "movingout", "youtube_link": "pumc6ablUc8", "callout": "<p>82% Positive on Steam</p>\n<p><span style=\"color: #ef9741;\">Join up with your friends and move furniture rom the house to the truck by any means necessary. Perfect for a couch co-op session that will likely involve a lot of shouting and laughter. (Steam Deck Playable)</span></p>", "publishers": [{"publisher-name": "Team 17", "publisher-url": "https://www.team17.com/"}], "side_box_art_text": null, "third_party_subscribe_text": null, "min_price|money": {"currency": "USD", "amount": 10.0}, "subtitle_html": null, "description_text": "<i>Moving Out</i> is a ridiculous physics-based moving simulator that brings new meaning to \"couch co-op\"! <br><br>Are you ready for an exciting career in furniture? As a newly certified Furniture Arrangement & Relocation Technician, you’ll take on moving jobs all across the busy town of Packmore. Smooth Moves may not be the biggest moving company, but there’s no task too dangerous or strange for this busy team of go-getters. Grow your business to brave new heights, recruit colourful customizable characters, and save your town from furniture peril!<strong class=\"hmb\"><br><br>Co-op! </strong> <br>Enjoy the story mode solo as an independent contractor or team up with some friends. Up to four players can cozy up on the couch to argue over the best way to move a couch. <strong> Test your skills AND your friendship! </strong> <strong class=\"hmb\"> <br><br>Physics! </strong> <br>Are pesky doors and windows standing in your furniture’s way? Just blast through them with physics! Lift, toss and smash your way to the fastest times!<strong class=\"hmb\"><br><br>Action! </strong> <br>Learn the ropes in a series of increasingly precarious and fantastical moving jobs. How a bed gets from point A to point B is never a straight line, so throw out the training manual and get creative!<strong class=\"hmb\"><br><br>Adventure! </strong> <br>Every moving company starts small, but as your reputation ranks up, so do your destinations. Move through sleepy suburbs, frenzied farms, haunted houses, virtual reality and lands beyond! <strong class=\"hmb\"> <br><br>Characters! </strong> <br>Recruit a unique cast of colorful characters, each packed with a passion for manual labor!<strong class=\"hmb\"><br><br>Assist Mode! </strong> <br>Are you a rookie? No problem! Adjust the game’s difficulty so anyone can play! <br><br><strong> Don’t wait! </strong> Grab your friends and become a certified moving master in <i>Moving Out</i>!", "user_ratings": {}, "developers": [{"developer-name": "SMG Studio", "developer-url": "http://smgstudio.com/"}, {"developer-name": "Devm Games", "developer-url": "https://www.devm-games.com/"}], "item_content_type": "game"}, "spiderheck": {"human_name": "SpiderHeck", "machine_name": "spiderheck", "youtube_link": "tU4cYnH3rfw", "callout": "<p>93% Positive on Steam</p>\n<p><span style=\"color: #ef9741;\">Spiders and laser swords! The unique physics system allows for hilarious and unpredictable moments as you swing, stab, and shoot your way around arenas. Duel to the death in versus modes or team up with friends to fight off swarms of enemies in wave survival. (Steam Deck Verified)</span></p>", "publishers": [{"publisher-name": "Tiny Build", "publisher-url": "https://www.tinybuild.com/"}], "side_box_art_text": null, "third_party_subscribe_text": null, "min_price|money": {"currency": "USD", "amount": 10.0}, "subtitle_html": null, "description_text": "<strong>A fast physics-based brawler where you'll get dozens of \"holy heck, did I just do that? that was so cool\" moments. </strong> <br><br><strong> One-hit death </strong> <br>One wrong move and you are out! With 25 weapons as dangerous to you as they are to your enemies, every battle feels like dancing on a razor’s edge. <br><br><strong> Web swinging &amp; wall crawling </strong> <br>Run on ceilings and ramp up wild speed using physics- based web swinging. <br><br><strong> Wild maps </strong> <br>55 maps to keep your fights fresh with various physics obstacles or hazards, and you can always grab more from the Steam Workshop! <br><br><strong> Versus </strong> <br>Battle friends and randoms in intense acrobatic showdowns or epicly clumsy battles. <br><br><strong> Co-op </strong> <br>Fight off waves of enemies, slowly gaining various upgrades as you try your best to “avoid” friendly fire. <br><br><strong> Play alone </strong> <br>Test your skills by completing a variety of themed combat and parkour challenges. <br><br><strong> Editor </strong> <br>Design your own versus maps, parkour courses, and combat challenges to test yourself or your friends. <br><br><strong> Customization </strong> <br>The spiders are bald - help them unlock cool hats by completing achievements! <br><i><br>Disclaimer: this is not Australia simulator. </i>", "user_ratings": {}, "developers": [{"developer-name": "Neverjam"}], "item_content_type": "game"}, "michaeljfoxfoundation": {"human_name": "Michael J. Fox Foundation for Parkinson's Research", "machine_name": "michaeljfoxfoundation", "youtube_link": "5qFM9LYwT1g", "callout": null, "publishers": [], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "subtitle_html": null, "description_text": "<p><em>Donations to support the&nbsp;<span data-sheets-value=\"{&quot;1&quot;:2,&quot;2&quot;:&quot;Michael J. Fox Foundation for Parkinsons Research&quot;}\" data-sheets-userformat=\"{&quot;2&quot;:391875,&quot;3&quot;:{&quot;1&quot;:0},&quot;4&quot;:[null,2,11982760],&quot;9&quot;:0,&quot;10&quot;:2,&quot;12&quot;:0,&quot;14&quot;:[null,2,0],&quot;15&quot;:&quot;arial,sans,sans-serif&quot;,&quot;16&quot;:10,&quot;17&quot;:0,&quot;18&quot;:0,&quot;19&quot;:0,&quot;21&quot;:0}\">Michael J. Fox Foundation for Parkinson's Research</span> are made to <a href=\"https://support.humblebundle.com/hc/en-us/articles/205183597\" target=\"_blank\" rel=\"noopener\">PayPal Giving Fund</a>, subject to its policies.</em></p>\n<p>Founded in 2000, The Michael J. Fox Foundation for Parkinson’s Research (MJFF) is dedicated to finding a cure for Parkinson's disease (PD) through an aggressively funded research agenda and to ensuring the development of improved therapies for those living with Parkinson's today. PD affects nearly 1 million people in the United States and more than 6 million people worldwide, a figure estimated to double by 2040 as the population ages and becomes at increasing risk for neurologic disorders. There is no known cure and the need for new Parkinson’s treatments has never been more critical.</p>\n<p>From inception, MJFF has worked to jolt Parkinson’s drug development out of a standstill. Our activities go far beyond funding basic research discoveries. We identify and fund innovative ideas in Parkinson’s disease discovery, including high-risk, high-reward opportunities; an approach that in less than two decades has transformed the broader approach in the Parkinson’s research field. We laser-focus on the targets that show real potential to help people, and proactively chaperone them along the complicated pipeline toward clinical trials. Positioned at the global nexus of Parkinson’s research, we strive to set the standard for impact and accountability. We constantly monitor costs to maximize the value of the philanthropic support we receive. As a result, since our founding, 88 cents of every dollar we spend goes straight to our research programs.</p>\n<p>Curing Parkinson’s is ambitious and we can’t do it alone. Visit&nbsp;<a href=\"http://michaeljfox.org/\" target=\"_blank\" data-saferedirecturl=\"https://www.google.com/url?q=http://michaeljfox.org/&amp;source=gmail&amp;ust=1554310282818000&amp;usg=AFQjCNHhDdu9J3e417sGA7RTZuJqEeIxng\" rel=\"noopener\">michaeljfox.org</a>&nbsp;for more information on how you can get involved today.</p>", "user_ratings": {}, "developers": [{"developer-name": "michaeljfox.org", "developer-url": "https://www.michaeljfox.org/"}], "item_content_type": null}, "flingtothefinish": {"human_name": "Fling to the Finish", "machine_name": "flingtothefinish", "youtube_link": "rjDKCsJqLss", "callout": "<p>86% Positive on Steam</p>\n<p><span style=\"color: #ef9741;\">A racing game for multiple friends where you're tethered together and have to fling yourselves....to the Finish line! (Steam Deck Verified)</span></p>", "publishers": [{"publisher-name": "Daedalic LLC", "publisher-url": "https://www.daedalic.com/"}], "side_box_art_text": null, "third_party_subscribe_text": null, "min_price|money": {"currency": "USD", "amount": 10.0}, "subtitle_html": null, "description_text": "In <i>Fling to the Finish</i>, teams of two players race through colorful, chaotic obstacle courses while tethered by a stretchy elastic rope. <br>When you and your friends first pick up the game your rope will get tangled in practically everything you pass. But as you quickly improve your communication skills you'll learn that the rope is your biggest asset. <br><br>Experienced players can use the rope to swing around perilous obstacles, and fling their partner up ledges before they fall to their doom. When partners master using their rope, they're capable of acrobatic feats unachievable in any other platformer! <br><br>Teams can show off their skills by competing in online or local races with a bunch of other players!<br><br>This control scheme is great for local co-op, and adds an extra dimension to the game. While you push and pull each other in game, try not to do the same in real life!", "user_ratings": {}, "developers": [{"developer-name": "SplitSide Games", "developer-url": "https://www.splitsidegames.com/"}], "item_content_type": "game"}, "rivalsofaether": {"human_name": "Rivals of Aether", "machine_name": "rivalsofaether", "youtube_link": "cFCf6Vurbq8", "callout": "<p>96% Positive on Steam</p>\n<p><span style=\"color: #ef9741;\">An indie platform fighter inspired by games like Super Smash Bros. It features unique characters representing different elemental powers (Fire, Water, Air, Earth), each with distinct movesets and abilities that can also affect the stage itself. (Steam Deck Playable)</span></p>", "publishers": [{"publisher-name": "Fornace", "publisher-url": "https://rivalsofaether.com/"}], "side_box_art_text": null, "third_party_subscribe_text": null, "min_price|money": {"currency": "USD", "amount": 10.0}, "subtitle_html": null, "description_text": "<p><strong>Overview</strong></p>\n<p><em>RIVALS OF AETHER</em><span>&nbsp;</span>is an indie fighting game set in a world where warring civilizations summon the power of Fire, Water, Air, and Earth. Choose a Rival to bring into the battlefield and manipulate the powers of the classical elements and animal movement. Praised for its competitive gameplay and intensive training tools,<span>&nbsp;</span><em>Rivals of Aether</em><span>&nbsp;</span>is the perfect entry to the Platform Fighter genre.</p>\n<p><strong>Game Features</strong></p>\n<ul>\n<li>Choose VERSUS MODE to duke it out in competitive 1v1 or 2v2 fights, or jump into a free-for-all.</li>\n<li>Play STORY MODE to learn the backstory behind each rival and begin to uncover the hidden mysteries of Aether.</li>\n<li>Dive into ABYSS MODE to see how many waves of shadowy fighters you can defeat and reach the leaderboards alone or with a friend. Customize your Abyss Mode builds and challenge your friends in ABYSS VERSUS.</li>\n<li>Take your skills online in ONLINE VERSUS ! Play against your friends or test your skills in RANKED MODE to climb the leaderboard.</li>\n<li>Study TUTORIAL MODE to hone your skills from beginner to advanced lessons. Or boot up PRACTICE MODE to get your hands on all the frame data and hitbox visualizations.</li>\n</ul>\n<p><strong>Rivals</strong></p>\n<p>Zetterburn, a son of the ruling family of the Firelands, is an experienced and hardened warrior. In battle, Zetterburn uses no weapons except for his razor-sharp claws and ability to control flame.</p>\n<ul>\n<li>BURN DAMAGE - Zetterburn's special attacks can set opponents on fire, causing them additional damage over time.</li>\n<li>WILD FIRE - Zetterburn's Down Special places flames on the stage. These flames stay for a period of time, burning any opponents who come in contact with them.</li>\n<li>FIRE AMP - When an opponent is burning, Zetterburn's Strong Attacks can absorb the flames and launch the burned enemy twice as far, making for an effective killing blow.</li>\n</ul>\n<p>Orcane is a playful trickster, notorious for escaping even the most precarious of situations. He can transform into water and confuse enemies with a spray of bubbles.</p>\n<ul>\n<li>PUDDLE TELEPORTATION - Orcane creates a puddle with his Neutral Special or Down Special. He can then teleport to his puddle using his Up Special as a powerful vertical blow or an effective recovery when launched off the stage.</li>\n<li>BUBBLE EVAPORATION - Orcane can turn his puddle into a pillar of bubbles with his Down Special to trap enemies above the puddle.</li>\n<li>WATER AMP - When standing on top of his puddle, Orcane can consume the water underneath him to perform powerful Strong Attacks with far greater range and knockback.</li>\n</ul>\n<p>The youngest trainee in the history of the Air Academy, Wrastor has never lived by anyone's rules but his own. Currently an Aerial Ace for the Air Armada, Wrastor is wrecking havoc among the Armada's enemies and generals alike.</p>\n<ul>\n<li>WINGED FLIGHT - Wrastor can jump 4 times, making him incredible at controlling the air and recovering from the toughest falls even when things look grim.</li>\n<li>WIND CURRENT - Wrastor can create a Wind Current with his Forward Special, allowing him to move faster within it and chase his targets more effectively.</li>\n<li>AERIAL ACE - Wrastor performs his charged Strong Attacks in the air instead of on the ground, a first for this genre.</li>\n</ul>\n<p>Kragg is a defender of the colossal Aetherian Forest. Deliberate and loyal, he is one of the infamous Wall Runners who patrol the Rock Wall. Unlike other Wall Runners, Kragg has the legendary ability to control the earth with his will.</p>\n<ul>\n<li>ROCK HURL - Kragg can pull a rock out of the ground and hurl it at opponents. After it leaves his hands, the rock becomes a solid piece of stage that either Kragg or other players can break.</li>\n<li>DEFENSE BALL - Kragg can curl into a ball and roll toward enemies. Although he can be damaged while in ball form, he cannot be knocked away.</li>\n<li>EARTH PILLAR - Kragg can summon a pillar of earth to his feet regardless of where he is. If Kragg is about to fall to his death, this move can quickly turn his situation around.</li>\n</ul>\n<p>Forsburn is the disgraced, eldest son of the Firelands' ruling family. After being condemned by the Fire Council and his own brother, Forsburn found refuge in a group of outsiders who had rejected the flame and mastered the way of smoke.</p>\n<ul>\n<li>SMOKE SCREEN - Forsburn can use his Neutral Special to obscure the battlefield allowing Forsburn to remain hidden inside a cloud of smoke.</li>\n<li>DECOY - Through his Forward Special, Forsburn can create a smoke facsimile of himself that can attack opponents. The illusory Forsburn breaks into smoke after being hit by a single attack.</li>\n<li>CONSUME/COMBUST - By using his Down Special, Forsburn can consume his smoke clouds back into his body. After consuming three clouds, Forsburn is charged up and can use Down Special again to combust: knocking opponents away at high speed.</li>\n</ul>\n<p>Maypul is the self-appointed Guardian of the Aetherian Forest. She commands fearful respect throughout the forest for her unhesitating vigilantism. She uses her agility to trap any unknown intruders before they even realize she is there.</p>\n<ul>\n<li>WATCHER'S MARK - Maypul can use her Seeds or her Watcher's Dash to mark opponents, making them susceptible to her following attacks.</li>\n<li>WRAPPED UP - After marking her targets, Maypul can use her Strong Attacks or her trusty Plant to wrap marked opponents in place allowing her to follow up with another attack.</li>\n<li>SLING SHOT - Maypul can use her vines to sling toward marked opponents, allowing her to elude attacks and quickly close distances.</li>\n</ul>\n<p>Absa is a famed engineer and martialist of the Elders of the Air Alliance. Despite the laws of the Elders, Absa secretly developed storm techniques in the caves of the Archai mountains.</p>\n<ul>\n<li>CLOUD CONTROL - Absa can place a cloud using her Neutral or Forward Special. This cloud hangs in the air until Absa bursts it by tapping her Neutral Special and knocking enemies away.</li>\n<li>THUNDER BOLT - Absa can charge her Neutral Special to create a powerful lightning blast that connects her to her cloud. All opponents caught between the two will be knocked away at high speeds.</li>\n<li>CONDENSED STORM - Absa focuses the power of a lightning bolt to the tip of her hoof. If she can line up one of her aerial kicks perfectly, she unleashes great power.</li>\n</ul>\n<p>Etalus is a legendary warrior in his native land. He is one of the last surviving members of the Harbor Guard and uses the power of ice to augment his massive strength.</p>\n<ul>\n<li>HOME ICE ADVANTAGE: Etalus can use his Forward Special or Forward Tilt to freeze the ground beneath him in order to slide across on the icy surface.</li>\n<li>ARMORED UP: When standing on ice, Etalus can use his Neutral Special to absorb the ice and create ice armor around his body.</li>\n<li>AVALANCHE: Etalus can use his Down Special to shatter all nearby ice, instantly freezing any enemies who are standing on it.</li>\n</ul>\n<p>&nbsp;</p>", "user_ratings": {}, "developers": [{"developer-name": "Aether Studios", "developer-url": "https://rivalsofaether.com/"}], "item_content_type": "game"}, "embr": {"human_name": "Embr", "machine_name": "embr", "youtube_link": "hfAUUCk8Zqc", "callout": "<p>87% Positive on Steam</p>\n<p><span style=\"color: #ef9741;\">You're an under qualified freelance firefighter fighting fires for profit...with your friends!</span></p>", "publishers": [{"publisher-name": "Curve", "publisher-url": "https://curvegames.com/"}], "side_box_art_text": null, "third_party_subscribe_text": null, "min_price|money": {"currency": "USD", "amount": 10.0}, "subtitle_html": null, "description_text": "<p>Team up with friends to become the most über firefighters money can buy. Rush into burning buildings filled with dangerous hazards, valuables, and top-of-the-line security systems. Fight fires, save lives, salvage goods, and make life-changing money. Buy high tech tools with advanced upgrades, and fresh outfits that unlock new ways to play.</p>\n<p>There’s plenty of fire to go around! Play by yourself or join a response crew of up to 4 players online, with dynamic difficulty that adapts to the size of your team.</p>\n<p>Play through 25 unique levels across 3 districts filled with traps, hazards, and escalating danger.</p>\n<p>There’s more than one way to be a hero. Break down doors, smash windows, fix electrical circuits, clear gas leaks, evade security systems, and do whatever you can to get the job done and get paid.</p>\n<p>Earn five star ratings to attract the attention of wealthy customers. And if you’re short on cash, try snatching a few valuables while the clients aren’t looking.</p>\n<p>Create the ultimate private firefighting experience with a range of tools, upgrades, vehicles, and outfits. Leap off tall buildings with the greatest of ease with the fall-damage reducing Dummy Helmet, defy gravity with the patented Double Jump Baseball Cap, slip on a pair of insulated gloves to survive a brush with those pesky electrical hazards, or try any one of the 17 equipment options available.</p>\n<p><i>Embr</i> will keep you coming back for more with new mission types, daily and weekly challenges, and plenty of achievements to hunt.</p>", "user_ratings": {}, "developers": [{"developer-name": "Muse Games", "developer-url": "https://musegames.com/"}], "item_content_type": "game"}, "unrailed": {"human_name": "Unrailed!", "machine_name": "unrailed", "youtube_link": "5bT74jk-liA", "callout": "<p>93% Positive on Steam</p>\n<p><span style=\"color: #ef9741;\">Chop down trees, mine resources, craft tracks, and manage upgrades, all while dealing with environmental hazards and keeping the train from derailing on an endlessly extending train track! (Steam Deck Playable)</span></p>", "publishers": [{"publisher-name": "Daedalic LLC", "publisher-url": "https://www.daedalic.com/"}], "side_box_art_text": null, "third_party_subscribe_text": null, "min_price|money": {"currency": "USD", "amount": 10.0}, "subtitle_html": null, "description_text": "<i>Unrailed!</i> is a chaotic online and couch co-op multiplayer railroad construction game where you work together with your friends as a team to build a train track across endless procedurally generated worlds. Master encounters with its inhabitants, upgrade your train and keep it from derailing! <strong class=\"hmb\"> <br><br>BUILD A TRACK FURTHER THAN EVER BEFORE </strong> <br><br>Gather resources and craft tracks to extend your railroad to prevent your train from reaching the end. But watch out - there is only one tool of each type. Co-operation and co-ordination of your team is essential to survive this increasingly challenging journey!<strong class=\"hmb\"><br><br>PLOUGH YOUR WAY THROUGH THE WORLD </strong> <br><br>Every world is unique! You and your team will have to master ever new challenges to stay on track!<strong class=\"hmb\"><br><br>ATTACH NEW WAGONS TO MASTER THE UNKNOWN </strong> <br><br>Upgrade your train to be prepared for whatever is about to come. Get an atomic engine, upgrade your crafting wagon, attach a supercharger or choose from a vast range of other options. <br><strong class=\"hmb\"><br>PLAY WITH OR AGAINST YOUR FRIENDS </strong> <br><br>Play cooperatively with up to four players in a single team or challenge the co-op skills of your friends in a two versus two game. <strong class=\"hmb\"> <br><br>OVERVIEW </strong> <br><br>\n<ul>\n<li>An intense and chaotic railroad construction experience </li>\n<li>Online and local couch co-op multiplayer (also mixing both possible) </li>\n<li>Procedurally generated worlds with 4 different difficulty levels </li>\n<li>Dynamic weather system &amp; day and night cycle </li>\n<li>Game modes: Endless, Quick, Sandbox (up to 4 players) and Versus (2 vs 2 players) </li>\n<li>Distinct biomes (5+) </li>\n<li>A bunch of upgradable wagons (10+) to modify your train in Endless mode </li>\n<li>Unlockable characters </li>\n<li>A replay system </li>\n<li>Online highscores with replays </li>\n<li>Simple controls &amp; split keyboard and split controller mode </li>\n<li>Blocky to the core</li>\n</ul>", "user_ratings": {}, "developers": [{"developer-name": "Indoor Astronaut", "developer-url": "https://indoorastronaut.ch/"}], "item_content_type": "game"}}, "charity_data": {"charity_items": {"michaeljfoxfoundation": {"machine_name": "michaeljfoxfoundation", "youtube_link": "5qFM9LYwT1g", "item_content_type": null, "subtitle_html": null, "description_text": "<p><em>Donations to support the&nbsp;<span data-sheets-value=\"{&quot;1&quot;:2,&quot;2&quot;:&quot;Michael J. Fox Foundation for Parkinsons Research&quot;}\" data-sheets-userformat=\"{&quot;2&quot;:391875,&quot;3&quot;:{&quot;1&quot;:0},&quot;4&quot;:[null,2,11982760],&quot;9&quot;:0,&quot;10&quot;:2,&quot;12&quot;:0,&quot;14&quot;:[null,2,0],&quot;15&quot;:&quot;arial,sans,sans-serif&quot;,&quot;16&quot;:10,&quot;17&quot;:0,&quot;18&quot;:0,&quot;19&quot;:0,&quot;21&quot;:0}\">Michael J. Fox Foundation for Parkinson's Research</span> are made to <a href=\"https://support.humblebundle.com/hc/en-us/articles/205183597\" target=\"_blank\" rel=\"noopener\">PayPal Giving Fund</a>, subject to its policies.</em></p>\n<p>Founded in 2000, The Michael J. Fox Foundation for Parkinson’s Research (MJFF) is dedicated to finding a cure for Parkinson's disease (PD) through an aggressively funded research agenda and to ensuring the development of improved therapies for those living with Parkinson's today. PD affects nearly 1 million people in the United States and more than 6 million people worldwide, a figure estimated to double by 2040 as the population ages and becomes at increasing risk for neurologic disorders. There is no known cure and the need for new Parkinson’s treatments has never been more critical.</p>\n<p>From inception, MJFF has worked to jolt Parkinson’s drug development out of a standstill. Our activities go far beyond funding basic research discoveries. We identify and fund innovative ideas in Parkinson’s disease discovery, including high-risk, high-reward opportunities; an approach that in less than two decades has transformed the broader approach in the Parkinson’s research field. We laser-focus on the targets that show real potential to help people, and proactively chaperone them along the complicated pipeline toward clinical trials. Positioned at the global nexus of Parkinson’s research, we strive to set the standard for impact and accountability. We constantly monitor costs to maximize the value of the philanthropic support we receive. As a result, since our founding, 88 cents of every dollar we spend goes straight to our research programs.</p>\n<p>Curing Parkinson’s is ambitious and we can’t do it alone. Visit&nbsp;<a href=\"http://michaeljfox.org/\" target=\"_blank\" data-saferedirecturl=\"https://www.google.com/url?q=http://michaeljfox.org/&amp;source=gmail&amp;ust=1554310282818000&amp;usg=AFQjCNHhDdu9J3e417sGA7RTZuJqEeIxng\" rel=\"noopener\">michaeljfox.org</a>&nbsp;for more information on how you can get involved today.</p>", "human_name": "Michael J. Fox Foundation for Parkinson's Research", "developers": [{"developer-name": "michaeljfox.org", "developer-url": "https://www.michaeljfox.org/"}], "publishers": [], "user_ratings": {}}}}, "from_bundle": {"machine_name": "betterwith4friendscoopbundle_bundle", "tile_short_name": "Better with 4 Friends! Co-Op Bundle", "short_marketing_blurb": "Grab the gang—let's game!", "marketing_blurb": "Get <em>Embr</em>, <em>Unrailed!</em>, <em>Moving Out</em>, <em>Spider Heck</em>, <em>Portal Knights</em>, <em>Rivals of Aether</em>, and more!", "detailed_marketing_blurb": "Grab your besties for a co-op game night with the all-new Better With 4 Friends Bundle! Play a variety of hilarious and wacky indie games designed to get the whole squad laughing. Lay track before the train crashes in <em>Unrailed!</em>, turn moving day into pure chaos in <em>Moving Out</em>, and battle blazes together in <em>Embr</em>—plus so much more. Pay what you want for this laugh-packed collection and help support the Michael J. Fox Foundation with your purchase!", "author": "Publishers", "start_date|datetime": "2025-08-01T18:00:00", "end_date|datetime": "2025-08-23T03:00:00", "type": "bundle", "product_url": "/games/better-with-4-friends-coop-bundle"}, "updated_at|datetime": "2025-08-02T03:28:54.052451", "first_seen_at|datetime": "2025-08-02T03:28:54.052451"}
