{"machine_name": "speedrunningwithawesomegdq_bundle", "author": "Publishers", "basic_data": {"eula": null, "human_name": "Speedrunning with Awesome GDQ", "detailed_marketing_blurb": "Race to the finish at breakneck speed in our Speedrunning with Awesome Games Done Quick Bundle! This amazing bundle features standout speed-running titles like the ones featured at the Games Done Quick—a semiannual charity event that celebrates the passion and community of Speed Runners. These games are perfect for savvy speed runners and those new to the hobby like <em>Have a Nice Death</em>, <em>Ori and the Blind Forest</em>, <em>Sonic Lost World</em>, and more. Explore the world of speed running and support the Prevent Cancer Foundation with your purchase!", "short_marketing_blurb": "How fast can you go?", "media_type": "game", "description": "<p><strong>How fast can you go?</strong> Race to the finish at breakneck speed in our Speedrunning with Awesome Games Done Quick Bundle! This amazing bundle features standout speed-running titles like the ones featured at the Games Done Quick—a semiannual charity event that celebrates the passion and community of Speed Runners. These games are perfect for savvy speed runners and those new to the hobby like <em>Have a Nice Death</em>, <em>Ori and the Blind Forest</em>, <em>Sonic Lost World</em>, and more. Explore the world of speed running and support the Prevent Cancer Foundation with your purchase!</p>\n\n<p><strong>Pay $12 or more.</strong> Normally, the total cost for the games in this bundle is as much as $169. Here at Humble Bundle, you choose the price and increase your contribution to upgrade your bundle! This bundle has a minimum $12 purchase. Pay $12 or more to access Steam keys.</p>\n\n<p><strong>Redeem on Steam.</strong> All of the games in this bundle are available on Steam for Windows. Please check out the full system requirements <a href=\"https://support.humblebundle.com/hc/articles/32094643779483\">here</a> prior to purchasing.</p>\n\n<p><strong>Support charity.</strong> Choose where the money goes - between the publishers and to support Prevent Cancer Foundation. If you like what we do, you can leave us a Humble Tip too!</p>", "legal_disclaimer": null, "required_account_links": ["steam"], "end_time|datetime": "2025-01-18T02:00:00"}, "tier_item_data": {"preventcancerfoundation": {"human_name": "Prevent Cancer Foundation", "machine_name": "preventcancerfoundation", "youtube_link": "KZw4XKncDgo", "callout": null, "publishers": [], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "subtitle_html": null, "description_text": "<em>Donations to support the Prevent Cancer Foundation&nbsp;are made to the&nbsp;<a rel=\"nofollow\" target=\"_blank\" href=\"https://support.humblebundle.com/hc/en-us/articles/205183597\">PayPal Giving Fund</a>, subject to its policies.</em><br><br>Founded in 1985, the Prevent Cancer Foundation has been a leader in cancer prevention and early detection.&nbsp; As the only nonprofit in the United States solely focused on cancer prevention and early detection, the Foundation has been referred to as \"the candle that ignited a bonfire\" in the field of prevention.&nbsp; Investing more than $138 million over the past 29 years, the Prevent Cancer Foundation has always focused its resources on cancers that can be prevented through healthy lifestyle choices or early detection.<br><br>Each year, more than 1.6 million Americans are diagnosed with cancer and more than 500,000 will die from the disease.&nbsp; However, research shows that up to 60 percent of cancer cases and more than 50 percent of cancer deaths are preventable - with the knowledge we have today.<br>The Foundation has spent the last three decades working for:<br>\n<ul>\n<li>Reducing the cancer mortality rate by focusing on individual behaviors, engaging in public policy discussions and funding on prevention and early detection research.</li>\n<li>Raising awareness of all preventable cancers across all populations.</li>\n<li>Making prevention knowledge and early detection services more accessible for people in medically underserved communities.</li>\n<li>Collaborating with partners to maximize the effectiveness and reach of the prevention and early detection programs and message.</li>\n</ul>", "user_ratings": {}, "developers": [{"developer-name": "www.preventcancer.org", "developer-url": "http://www.PreventCancer.org"}], "item_content_type": null}, "newsuperluckystale": {"human_name": "New Super Lucky's Tale", "machine_name": "newsuperluckystale", "youtube_link": "-tVULwjePHw", "callout": "Streaming Mon Jan 6th at 1:37am PT", "publishers": [], "side_box_art_text": null, "third_party_subscribe_text": null, "min_price|money": {"currency": "USD", "amount": 12.0}, "subtitle_html": null, "description_text": "Join Lucky on his thrilling journey through the Book of Ages, a magical artifact that opens doors to amazing worlds. Meet new friends, explore exciting lands, and recover the missing pages from the evil sorcerer Jinx and his villainous family, the dreaded Kitty Litter. <br><br>• Featuring a huge variety of gameplay, from expansive 3D hubs, to story-based adventure levels, 2D side-scrolling challenges, rewarding mini-games, mind-bending puzzles, and thrilling boss battles. <br><br>• Thousands of collectibles to gather, tons of rewarding secrets to discover, a cast of memorable characters, and an entire wardrobe of costumes for the stylish adventurer. <br><br>• Designed to delight and challenge players of all ages and skill levels. <br><br>• A complete re-imagining of the original Super Lucky's Tale, featuring redesigned and new levels, a fully rotatable camera, tighter movement control, and major overhauls to nearly every other aspect, including the story, cinematics, music, and more. <br><br>Jump, burrow, and tail swipe your way to victory in this love letter to classic 3D platformers!", "user_ratings": {}, "developers": [{"developer-name": "Playful Corp.", "developer-url": "https://playfulstudios.com/"}], "item_content_type": "game"}, "condemned_criminal_origins": {"human_name": "Condemned: Criminal Origins", "machine_name": "condemned_criminal_origins", "youtube_link": null, "callout": "Streaming Tues Jan 7th at 8:54pm PT", "publishers": [{"publisher-name": "SEGA", "publisher-url": "http://www.sega.com/"}], "side_box_art_text": null, "third_party_subscribe_text": null, "min_price|money": {"currency": "USD", "amount": 12.0}, "subtitle_html": null, "description_text": "<html>\n <head>\n </head>\n <body>\n  What twists the mind of an ordinary human into a serial killer?\n  <br>\n  <br>\n  Assigned to the Serial Crimes Unit, Agent Ethan Thomas must answer this question, and bring the worst of society to justice. His solve rate is the best in the bureau....perhaps too good.\n  <br>\n  <br>\n  While investigating the growing list of serial killers, Agent Thomas concludes that something is twisting the bodies and souls of those that society has left behind. The homeless, addicted and deranged are rising from the city’s underbelly and committing mindless acts of violence. Could there be an unseen connection between the increasing brutality of the latest serial killings and the increasing crime rate? This question is pushed to the forefront after Agent Thomas is framed for the murder of two police officers. Now he must solve the murders to stop the killings, and exonerate himself from the crimes of which he is accused.\n  <br>\n  <br>\n  As FBI agent Ethan Thomas, you rely on sharp instincts and sophisticated forensic tools to investigate crime scenes, collect evidence, and find clues that will lead you to the killers. With danger lurking in every shadow, you need whatever weapons you can find to stay alive. If you run out of bullets, you’ll have to fight with a fire axe, shovel, pipe, two-by-four, or whatever you can pry from the environment around you. You’ll need to make sure nothing stops you as you try to uncover exactly who...or what is behind the grisly killings plaguing the city.\n </body>\n</html>", "user_ratings": {}, "developers": [{"developer-name": "Monolith", "developer-url": "http://www.lith.com/"}], "item_content_type": "game"}, "haveanicedeath": {"human_name": "Have a Nice Death", "machine_name": "haveanicedeath", "youtube_link": "Pl0EaPUpar0", "callout": "Check out allison8bit's speedrun from Frost Fatales 2023", "publishers": [{"publisher-name": "Gearbox Publishing", "publisher-url": "https://www.gearboxpublishing.com/"}], "side_box_art_text": null, "third_party_subscribe_text": null, "min_price|money": {"currency": "USD", "amount": 12.0}, "subtitle_html": null, "description_text": "Discover and explore the darkly-charming, procedurally-generated departments of Death Inc., where you’ll meet a diverse cast of memorable characters—like your affable pumpkin-headed assistant, Pump Quinn—who are always willing to share the latest office gossip <br><br>Sharpen your skills (and scythe) through fast-paced hack n’ slash combat, utilizing over 30 unique weapons and spells you can find and upgrade to create devastating combinations <br><br>Since Death can’t die, use what you’ve learned and earned to overcome the numerous minions and bosses in each department of Death Incorporated... over and over. A performance review after every run guarantees that you’ll unlock interesting items and upgrades that will help you progress on your journey <br><br>Taking more power for yourself is a controversial move in Death Incorporated’s company culture. For instance, adopting a Curse upgrade for yourself might result in the Labor Inspector granting your subordinates enhanced powers, or worse, raising the cost of koffee and other items that are vital to your work output", "user_ratings": {}, "developers": [{"developer-name": "Magic Design Studios", "developer-url": "https://www.magicdesignstudios.com/"}], "item_content_type": "game"}, "bpm_bulletsperminute": {"human_name": "BPM: BULLETS PER MINUTE", "machine_name": "bpm_bulletsperminute", "youtube_link": "ixmfu1vvWOI", "callout": "Streaming Thurs Jan 9th at 10:52pm PT", "publishers": [], "side_box_art_text": null, "third_party_subscribe_text": null, "min_price|money": {"currency": "USD", "amount": 12.0}, "subtitle_html": null, "description_text": "<strong>\n WARNING: BPM contains flashing images. If you experience epileptic seizures or blackouts when exposed to certain light patterns or flashing lights, immediately stop playing BPM and consult your doctor before resuming.\n</strong>\n<br>\n<br>\nFight as a mighty Valkyrie to repel the forces of the underworld from invading the world of Asgard.\n<br>\n<br>\n<strong>\n Gameplay\n</strong>\n<br>\nIn BPM, all of your actions and the actions of your enemies are tied to the beat of the music. Your enemies perform a dance-like sequence of attacks to an epic rock opera. BPM is inspired by retro shooters of the 90’s. It is fast, frenetic and rhythmical. You can double jump, dash, rocket jump and bunny hop to evade your opponents.\n<br>\n<br>\nYour goal is to reach the end of randomly generated dungeons, collecting different weapons, abilities and items each time you play. These weapons and abilities can radically alter the way you play, making each playthrough unique.\n<br>\n<br>\nYou must defeat 7 bosses to reach the final boss. Each boss moves and attacks in a unique way that you must learn to exploit if you want to succeed. Some attacks require you to jump over fields of lava, some to dodge fast projectiles, some to hold fast for a beat.\n<strong class=\"hmb\">\n <br>\n <br>\n Features:\n</strong>\n<br>\n<ul>\n <li>\n  Shoot, jump and dodge to the beat while battling hordes of enemies.\n  <br>\n </li>\n <li>\n  Fight powerful bosses in challenging boss battles that will push you to the edge.\n  <br>\n </li>\n <li>\n  Explore randomly generated dungeons.\n  <br>\n </li>\n <li>\n  Choose from 10 different characters with unique strengths and weaknesses.\n  <br>\n </li>\n <li>\n  Wield a powerful arsenal of weapons, all with different behaviour for firing and reloading to the beat of the soundtrack.\n  <br>\n </li>\n <li>\n  Battle a diverse array of enemies, each with unique rhythmic behaviours.\n  <br>\n </li>\n <li>\n  Get overpowered and fire shotgun rockets while flying through the air.\n  <br>\n </li>\n <li>\n  Utilize abilities that radically alter the way you play the game, from teleport to freezing bolts.\n  <br>\n </li>\n <li>\n  Equip over 60 items that buff your character in unique and interesting ways.\n  <br>\n </li>\n <li>\n  Experience an epic rock opera soundtrack.\n  <br>\n </li>\n <li>\n  Challenge modes for extra gameplay.\n </li>\n</ul>", "user_ratings": {}, "developers": [{"developer-name": "Awe Interactive", "developer-url": "https://www.aweinteractive.com/"}], "item_content_type": "game"}, "sonic_lostworld": {"human_name": "Sonic Lost World", "machine_name": "sonic_lostworld", "youtube_link": "9QtUG2oENYo", "callout": "Streaming Wed Jan 8th at 6:45am PT", "publishers": [{"publisher-name": "SEGA", "publisher-url": "http://www.sega.com/"}], "side_box_art_text": null, "third_party_subscribe_text": null, "min_price|money": {"currency": "USD", "amount": 12.0}, "subtitle_html": null, "description_text": "In his latest plot to defeat Sonic and rule the world, Dr. Eggman has harnessed the power of menacing creatures known as the Deadly Six. However, when the Deadly Six rise up against their new master, Sonic must unite with his arch nemesis Eggman and explore the mystical Lost Hex in order to take them on head-to-head. Use Sonic&rsquo;s amazing new moves &amp; incredible Colour Powers to speed across a variety of unique terrains, racing inside, outside &amp; upside down in every level.<br /><br /><strong>NEW MOVES</strong><br />Sonic moves like never before. Vault over obstacles, free run up &amp; along walls &amp; sky dive between islands at lightning speed. Plus the Spin Dash is back!<br /><br /><strong>COLOR POWERS</strong><br />New &amp; improved Colour Powers. Sonic can now fly through the air, tear up levels &amp; explode into enemies. He&rsquo;s more powerful than ever!<br /><br /><strong>NEW WORLD</strong><br />Speed through a variety of exhilarating levels. Explore massive mind-bending courses, vast underground tunnels &amp; colossal structures in the sky as you run inside, outside &amp; upside down.<br /><br /><strong>BOSS BATTLES</strong><br />Save the world one fight at a time. Take on each of the devious Deadly Six in dynamic boss battles which test all of Sonic&rsquo;s moves &amp; power-ups.<br /><br /><strong>PLUS &ndash; Now with new and improved PC Features:</strong><br /><br />\n<ul>\n<li><span style=\"font-size: 12px; line-height: 18px;\">60 FPS gameplay&nbsp;</span></li>\n<li><span style=\"font-size: 12px; line-height: 18px;\">HD resolution support&nbsp;</span></li>\n<li><span style=\"font-size: 12px; line-height: 18px;\">Full PC Gamepad + Keyboard support&nbsp;</span></li>\n<li><span style=\"font-size: 12px; line-height: 18px;\">Full Steam functionality</span></li>\n</ul>", "user_ratings": {}, "developers": [{"developer-name": "Sonic Team", "developer-url": "http://www.sonicteam.com/"}], "item_content_type": "game"}, "shenmue1and2": {"human_name": "Shenmue I & II", "machine_name": "shenmue1and2", "youtube_link": "29dKeykIDbI", "callout": "Streaming Mon Jan 6th at 11:06pm PT", "publishers": [{"publisher-name": "SEGA", "publisher-url": "http://sega.com/"}], "side_box_art_text": null, "third_party_subscribe_text": null, "min_price|money": {"currency": "USD", "amount": 12.0}, "subtitle_html": null, "description_text": "Originally released for the Dreamcast in 2000 and 2001, <i>Shenmue I &amp; II</i> is an open world action adventure combining jujitsu combat, investigative sleuthing, RPG elements, and memorable mini-games. It pioneered many aspects of modern gaming, including open world city exploration, and was the game that coined the Quick Time Event (QTE). It was one of the first games with a persistent open world, where day cycles to night, weather changes, shops open and close and NPCs go about their business all on their own schedules. Its engrossing epic story and living world created a generation of passionate fans, and the game consistently makes the list of “greatest games of all time”. <strong class=\"hmb\"> <br><br>Story </strong><br>A tale of revenge. <br><br>In 1986, teenage jujitsu artist Ryo Hazuki returns to the dojo of his father, Iwao Hazuki, only to witness his murder by a Chinese man, Lan Di. Lan Di steals a mysterious artifact known as the Dragon Mirror. Ryo vows to avenge his father’s death and sets out tracing Lan Di’s path. <br><br>The first game in the series, Shenmue begins the tale as Ryo travels around Yokosuka, Japan, gathering clues about his father’s murder and dealing with nefarious gangsters along the way. <br><br>The sequel Shenmue II continues Ryo’s quest, this time crossing the sea to Hong Kong, China. Ryo ventures deeper into the criminal underworld, meeting martial arts masters who aid him on his journey and offer insight into his father’s death, and unravels the mysteries of the Dragon Mirror that his father kept hidden. <strong class=\"hmb\"> <br><br>Gameplay </strong><br>\n<ul>\n<li>Take the role of <strong> Ryo Hazuki. </strong></li>\n<li>Explore a 3D open world searching for clues, examining objects, and talking to NPCs.</li>\n<li>Battle enemies and bosses making full use of the moves of Hazuki-style jujitsu.</li>\n<li>Beat quick-time events (QTEs) and mini-games.</li>\n</ul>\n<strong class=\"hmb\">Key features </strong><br><br><strong> The best Shenmue experience </strong><br>Pioneering Dreamcast classics available for the first time on PC <br>Updated user interface <br>Choice of modern or classic controls <br>Japanese audio available for the first time for a global audience <br>Fully scalable screen resolutions <br><br><strong> An epic legend </strong> <br>A tale of revenge on a grand scale <br>Solve the mystery of your father’s murder <br>An experience never to be forgotten <br><br><strong> The world feels alive </strong> <br>Talk to anyone, scour the world for clues <br>NPCs live independent lives on their own schedule <br>Faithful recreations of 1980s Japan and Hong Kong, China <br>Distract yourself with arcade games, collectibles, duck racing, and more", "user_ratings": {}, "developers": [{"developer-name": "D3T", "developer-url": "https://d3tltd.com/"}], "item_content_type": "game"}, "oriandtheblindforest": {"human_name": "Ori and the Blind Forest", "machine_name": "oriandtheblindforest", "youtube_link": "PkwPNStI1CM", "callout": "Streaming Sun Jan 5th at 1:56pm PT", "publishers": [{"publisher-name": "Xbox Game Studios", "publisher-url": "https://www.xbox.com/en-US/xbox-game-studios"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 12.0}, "subtitle_html": null, "description_text": "The forest of Nibel is dying. After a powerful storm sets a series of devastating events in motion, an unlikely hero must journey to find his courage and confront a dark nemesis to save his home. “<i>Ori and the Blind Forest</i>” tells the tale of a young orphan destined for heroics, through a visually stunning action-platformer crafted by Moon Studios for PC. Featuring hand-painted artwork, meticulously animated character performance, and a fully orchestrated score, “<i>Ori and the Blind Forest</i>” explores a deeply emotional story about love and sacrifice, and the hope that exists in us all.\n", "user_ratings": {}, "developers": [{"developer-name": "Moon Studios GmbH", "developer-url": "https://www.orithegame.com/moon-studios/"}], "item_content_type": "game"}}, "charity_data": {"charity_items": {"preventcancerfoundation": {"machine_name": "preventcancerfoundation", "youtube_link": "KZw4XKncDgo", "item_content_type": null, "subtitle_html": null, "description_text": "<em>Donations to support the Prevent Cancer Foundation&nbsp;are made to the&nbsp;<a rel=\"nofollow\" target=\"_blank\" href=\"https://support.humblebundle.com/hc/en-us/articles/205183597\">PayPal Giving Fund</a>, subject to its policies.</em><br><br>Founded in 1985, the Prevent Cancer Foundation has been a leader in cancer prevention and early detection.&nbsp; As the only nonprofit in the United States solely focused on cancer prevention and early detection, the Foundation has been referred to as \"the candle that ignited a bonfire\" in the field of prevention.&nbsp; Investing more than $138 million over the past 29 years, the Prevent Cancer Foundation has always focused its resources on cancers that can be prevented through healthy lifestyle choices or early detection.<br><br>Each year, more than 1.6 million Americans are diagnosed with cancer and more than 500,000 will die from the disease.&nbsp; However, research shows that up to 60 percent of cancer cases and more than 50 percent of cancer deaths are preventable - with the knowledge we have today.<br>The Foundation has spent the last three decades working for:<br>\n<ul>\n<li>Reducing the cancer mortality rate by focusing on individual behaviors, engaging in public policy discussions and funding on prevention and early detection research.</li>\n<li>Raising awareness of all preventable cancers across all populations.</li>\n<li>Making prevention knowledge and early detection services more accessible for people in medically underserved communities.</li>\n<li>Collaborating with partners to maximize the effectiveness and reach of the prevention and early detection programs and message.</li>\n</ul>", "human_name": "Prevent Cancer Foundation", "developers": [{"developer-name": "www.preventcancer.org", "developer-url": "http://www.PreventCancer.org"}], "publishers": [], "user_ratings": {}}}}, "from_bundle": {"machine_name": "speedrunningwithawesomegdq_bundle", "tile_short_name": "Speedrunning with Awesome GDQ", "short_marketing_blurb": "How fast can you go?", "marketing_blurb": "Get <em>Shenmue I & II</em>, <em>Sonic Lost World</em>, <em>Have a Nice Death</em>, <em>Ori and the Blind Forest</em>, and more!", "detailed_marketing_blurb": "Race to the finish at breakneck speed in our Speedrunning with Awesome Games Done Quick Bundle! This amazing bundle features standout speed-running titles like the ones featured at the Games Done Quick—a semiannual charity event that celebrates the passion and community of Speed Runners. These games are perfect for savvy speed runners and those new to the hobby like <em>Have a Nice Death</em>, <em>Ori and the Blind Forest</em>, <em>Sonic Lost World</em>, and more. Explore the world of speed running and support the Prevent Cancer Foundation with your purchase!", "author": "Publishers", "start_date|datetime": "2025-01-03T19:00:00", "end_date|datetime": "2025-01-18T02:00:00", "type": "bundle", "product_url": "/games/speedrunning-with-awesome-gdq"}, "updated_at|datetime": "2025-01-04T03:04:26.810840", "first_seen_at|datetime": "2025-01-04T03:04:26.810840"}
{"machine_name": "pianoandmorefordummieswiley_bookbundle", "author": "Wiley", "basic_data": {"eula": null, "human_name": "Humble Music Book Bundle: Piano and More for Dummies by Wiley", "detailed_marketing_blurb": "Hit all the right keys with our latest music bundle from Wiley! Get ebooks to teach you piano and other general musical skills like <em>Piano & Keyboard All-in-One For Dummies</em>, <em>Music Composition For Dummies</em>, <em>Songwriting For Dummies</em>, and <em>Piano Exercises For Dummies</em>. The experts behind the <em>For Dummies</em> series have been helping with reading and learning a variety of skills for more than 30 years, and their lessons will have you creating original music with ease. Plus, your purchase directly helps support Music Will— a nonprofit supporting future generations of musicians.", "short_marketing_blurb": "Piano playing made easy", "media_type": "ebook", "description": "<p><strong>Piano playing made easy.</strong> Hit all the right keys with our latest music bundle from Wiley! Get ebooks to teach you piano and other general musical skills like <em>Piano &amp; Keyboard All-in-One For Dummies</em>, <em>Music Composition For Dummies</em>, <em>Songwriting For Dummies</em>, and <em>Piano Exercises For Dummies</em>. The experts behind the <em>For Dummies</em> series have been helping with reading and learning a variety of skills for more than 30 years, and their lessons will have you creating original music with ease. Plus, your purchase directly helps support Music Will— a nonprofit supporting future generations of musicians.</p>\n<p><strong>Pay $1 or more.</strong> Normally, the total cost for the ebooks in this bundle is as much as $357. Here at Humble Bundle, you choose the price and increase your contribution to upgrade your bundle! This bundle has a minimum $1 purchase.</p>\n<p><strong>Read them anywhere.</strong> The ebooks in this bundle are available in PDF, PRC, and ePub formats, so they work on your computer, e-readers, iPads, cell phones, and a wide array of mobile devices! Instructions and a list of recommended reading programs can be found <a href=\"https://support.humblebundle.com/hc/articles/202712300\" rel=\"noopener\" target=\"_blank\">here</a>.</p>\n<p><strong>Support charity.</strong> Choose where the money goes - between the publisher and to support MusicWill. If you like what we do, you can leave us a Humble Tip too!</p>", "legal_disclaimer": null, "required_account_links": ["steam"], "end_time|datetime": "2025-01-23T19:00:00"}, "tier_item_data": {"vinylrecordcollectingfordummies": {"human_name": "Vinyl Record Collecting For Dummies", "machine_name": "vinylrecordcollectingfordummies", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Wiley", "publisher-url": "http://www.wiley.com/en-us/search?pq=1394226640"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 18.0}, "subtitle_html": null, "description_text": "<p>Vinyl Record Collecting for Dummies truly conveys the excitement of this hobby, and the thrill of hunting for new and rare records. This book is a handy resource for both the seasoned collector and the beginner, telling the story of the hobby since its beginnings with wax cylinders and 78s, while focusing on the hobby as it exists today. Youll learn: how to determine a records value or availability; how to research future purchases; how to select and buy a record player/system suitable for your current needs, and as your collection grows; how to build a collection while sticking to a budget; how to find records at record fairs, flea markets, thrift stores, antique stores, traditional record stores, and online; guidance on how to navigate the multitude of sites that offer both new and used records for sale; how to care for, store, and properly maintain your records; the advantages and pitfalls of buying and selling by mail; information about different music genres, such as rock, pop, classical, jazz, folk, reggae, country, stage shows and soundtracks, international/World Music, electronica and spoken word; how records are manufactured and the difference between an analog and a digital remaster and different vinyl types; and the grading systems used to determine the quality and value of a record.</p>", "user_ratings": {}, "developers": [{"developer-name": "Thompson"}], "item_content_type": "ebook"}, "musiccompositionfordummies3rdedition": {"human_name": "Music Composition For Dummies", "machine_name": "musiccompositionfordummies3rdedition", "youtube_link": null, "callout": "3rd Edition", "publishers": [{"publisher-name": "Wiley", "publisher-url": "http://www.wiley.com/en-us/search?pq=1394266413"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 18.0}, "subtitle_html": null, "description_text": "<p>Music Composition For Dummies explains how to use music theory to write music in a variety of forms. This edition will include: Updates to the chapter on Composition Software, as technology has evolved and new programs have been developed since the last edition, like the translation program ScoreCloud, the mobile app Music Studio, and A.I. services like SoundRaw Updated vocabulary, musical examples, and reading and listening lists An expanded chapter on effort shapes Overhaul of the chapter on composing for commercial consumption to incorporate BandCamp, YouTube, SoundExchange, TuneCore, and other electronic streaming services How to compose shorter songs for platforms with limited run times, like TikTok New information on composing for a rhythm section A refresh of the Part of Tens</p>", "user_ratings": {}, "developers": [{"developer-name": "Jarrett"}], "item_content_type": "ebook"}, "pianofordummies3rdedition": {"human_name": "Piano For Dummies", "machine_name": "pianofordummies3rdedition", "youtube_link": null, "callout": "3rd Edition", "publishers": [{"publisher-name": "Wiley", "publisher-url": "http://www.wiley.com/en-us/search?pq=1119700973"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 10.0}, "subtitle_html": null, "description_text": "<p>Piano For Dummies, 3rd Edition, is an all-encompassing guide for new or current piano enthusiasts. This updated edition includes online companion material as well as e-books for those who learn on-the-go.</p>", "user_ratings": {}, "developers": [{"developer-name": "Leonard Corp"}], "item_content_type": "ebook"}, "singingexercisesfordummieswithcd": {"human_name": "Singing Exercises For Dummies", "machine_name": "singingexercisesfordummieswithcd", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Wiley", "publisher-url": "http://www.wiley.com/en-us/search?pq=111970104X"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 18.0}, "subtitle_html": null, "description_text": "<p>Singing Exercises For Dummies provides exercises and drills that give singers a vocal workout. Following along with the book and the online content, readers can learn to refine their technique, develop consistency, build power and endurance, and increase their vocal range. Whether studying under a tutor or developing their own training plan, Singing Exercises For Dummies provides readers the opportunity for both practice and perfection.</p>", "user_ratings": {}, "developers": [{"developer-name": "Phillips"}], "item_content_type": "ebook"}, "singingfordummies3rdedition": {"human_name": "Singing For Dummies", "machine_name": "singingfordummies3rdedition", "youtube_link": null, "callout": "3rd Edition", "publishers": [{"publisher-name": "Wiley", "publisher-url": "http://www.wiley.com/en-us/search?pq=1119842964"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 10.0}, "subtitle_html": null, "description_text": "<p>Get the keys to getting in tuneAlmost everyone sings along with the radio or in the shower. Boosting your natural talents to being on the level with the stars you see on stage or hear on record takes more than knowing the lyrics and the tune. This book shares the techniques and exercises professional singers use to improve their tone, pitch, and articulation. Packed with advice from an expert who's been a professional singer and regarded vocal coach, you'll discover how to develop the physical skills to build breath control, expand your range, and apply your techniques to a new song. Inside... Get to know your natural range Build physical tools to help with singing Polish up the tone of your voice Sing with clear articulation Expand range and flexibility Work with a pro coach Prepare for an audition</p>", "user_ratings": {}, "developers": [{"developer-name": "Phillips"}], "item_content_type": "ebook"}, "pianoandkeyboardall-in-onefordummies2ndedition": {"human_name": "Piano & Keyboard All-in-One For Dummies", "machine_name": "pianoandkeyboardall-in-onefordummies2ndedition", "youtube_link": null, "callout": " 2nd Edition", "publishers": [{"publisher-name": "Wiley", "publisher-url": "http://www.wiley.com/en-us/search?pq=1119700841"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 18.0}, "subtitle_html": null, "description_text": "<p>Piano And Keyboard All-In-One For Dummies encompasses everything you need to get started on the piano, or even build upon the current skills you have.</p><p>This all-in-one includes content from:</p><p>Piano For Dummies, 3rd Edition</p><p>Piano Exercises For Dummies</p><p>Keyboard For Dummies</p><p>Music Theory For Dummies, 4th Edition</p><p>The online component for this title, hosted at Dummies.com, includes companion audio tracks that demonstrate techniques and sounds found in the book.</p>", "user_ratings": {}, "developers": [{"developer-name": "Day"}], "item_content_type": "ebook"}, "musicbusinessfordummies": {"human_name": "Music Business For Dummies", "machine_name": "musicbusinessfordummies", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Wiley", "publisher-url": "http://www.wiley.com/en-us/search?pq=1119049652"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 18.0}, "subtitle_html": null, "description_text": "<p>Becoming successful in music has never been easy and recent disruptions and transformations to the music business have made the prospect more daunting than ever before. Music Business For Dummies explains the ins and outs of the music business for artists and businesspeople entering the industry. Key content coverage includes: Industry basics breaks down the ins and outs of the music business in todays digital world where file-sharing, streaming, and iTunes have transformed the industry Solo act or forming a band/picking your team finding the right players, agents/business managers/etc. Rehearsing/recording/performing getting the most out of your investments Ways to capitalize on your work songwriting/music publishing, getting your songs placed, licensing/royalties/etc., record deals, iTunes, Amazon, etc./new music distribution models Direct publishing, copyright, royalties and other income sources Branding/promotion/marketing/merchandising getting the word out and building your brand Feed/sustain/grow Various ways to continue growth and get exposureopening act, getting gigs, going on tour, etc.</p>", "user_ratings": {}, "developers": [{"developer-name": "Weisman"}], "item_content_type": "ebook"}, "musictheoryfordummies4thedition": {"human_name": "Music Theory For Dummies", "machine_name": "musictheoryfordummies4thedition", "youtube_link": null, "callout": "4th Edition", "publishers": [{"publisher-name": "Wiley", "publisher-url": "http://www.wiley.com/en-us/search?pq=1119575524"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 18.0}, "subtitle_html": null, "description_text": "<p>Music Theory For Dummies, tracks to a typical Music Theory course at the college level, breaking difficult concepts down to a manageable size for understanding and retention.</p>", "user_ratings": {}, "developers": [{"developer-name": "Pilhofer"}], "item_content_type": "ebook"}, "keyboardfordummies": {"human_name": "Keyboard For Dummies", "machine_name": "keyboardfordummies", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Wiley", "publisher-url": "http://www.wiley.com/en-us/search?pq=1118705491"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 1.0}, "subtitle_html": null, "description_text": "<p>Keyboard For Dummies explains the ins-and-outs of modern keyboards and helps readers get the most out of their capabilities. Key content coverage includes: An overview of the types of keyboards available today (personal/portables, digital pianos, synthesizers, organs, etc.) and how they differ from acoustic pianos Expert advice on choosing the right keyboard for your wants/needs (for yourself, for a child, to learn to play piano, to have fun, etc.); and how to shop and compare the various models A close look at the types of sounds an electronic keyboard offers and how to achieve them Information on understanding and using a wide range of common keyboard effects (such as reverb, chorus, etc.), as well as onboard drum rhythms and other accompaniment features Step-by-step instruction on how to connect and use keyboards anywhere using external speakers, amps, home stereos, computers, and tablets Guidance on how to use keyboard software and applications to get the most out of keyboard technology Beyond the book: The multimedia component for this title will be hosted at Dummies.com and includes companion audio tracks that demonstrate techniques and sounds found in the book, helping readers to better understand concepts and examples in the text.</p>", "user_ratings": {}, "developers": [{"developer-name": "Kovarsky"}], "item_content_type": "ebook"}, "classicalmusicfordummies3rdedition": {"human_name": "Classical Music For Dummies", "machine_name": "classicalmusicfordummies3rdedition", "youtube_link": null, "callout": "3rd Edition", "publishers": [{"publisher-name": "Wiley", "publisher-url": "http://www.wiley.com/en-us/search?pq=1119847745"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 18.0}, "subtitle_html": null, "description_text": "<p>AS CLASSIC AS IT GETS Classical Music For Dummies, 3e tells the story of classical music while adding can't miss songs to your music library. Study up on the greatest composers like Bach and Beethoven, and learn the differences between the romantic style of classical music and the Baroque style. And, it's all easy to read with the fun Dummies style guiding the way. Classical Music For Dummies, 3eis the key to impressing all music aficionados at your next dinner party. Dummies.com has interactive elements to complement and add to, Classical Music For Dummies, 3e. The online component includes bonus material such as videos and audio tracks to help readers better understand concepts and techniques from the book. The 3rd edition will include expanded references as well. INSIDE: What is classical music The entire history of music in 80 pages The greatest hits in classical music Classical music timeline Field guide to the orchestra A look inside the mind of a composer A diverse look at the history of classical music Music suggestions.</p>", "user_ratings": {}, "developers": [{"developer-name": "Pogue"}], "item_content_type": "ebook"}, "littlekidsrock": {"human_name": "Music Will", "machine_name": "littlekidsrock", "youtube_link": null, "callout": null, "publishers": [], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "subtitle_html": null, "description_text": "<p><em>Donations to support Musci Will are made to &nbsp;<a href=\"https://support.humblebundle.com/hc/en-us/articles/205183597\" target=\"_blank\" rel=\"noopener\">PayPal Giving Fund</a>, subject to its policies.</em></p>\n<p>Music Will runs the largest nonprofit music program in the US public school system. Our teachers currently serve over 500,000 students in more than 600 cities and towns across the country.<br><br>We believe that music education is a right, not a privilege, and it should reflect the cultures of the students it serves.<br><br>That’s why, for two decades now, our programs have taught students such popular American genres as rock, pop, R&amp;B, Latin, rap and country—alongside styles already taught in schools, such as classical and jazz.<br><br>Today, a national network of K-12 districts has adopted the Music Will program as their own.<br><br>More than 70 colleges and universities now teach our approach to their music education majors. Several state departments of education have partnered with Music Will to grow music education in the schools they serve.<br><br>Our mission of transforming lives by transforming music education has grown into a movement.</p>", "user_ratings": {}, "developers": [], "item_content_type": null}, "homerecordingfordummies6thedition": {"human_name": "Home Recording For Dummies", "machine_name": "homerecordingfordummies6thedition", "youtube_link": null, "callout": "6th Edition", "publishers": [{"publisher-name": "Wiley", "publisher-url": "http://www.wiley.com/en-us/search?pq=111971110X"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 18.0}, "subtitle_html": null, "description_text": "<p>Record anywhere with your portable studioIt no longer requires a professional studio to record great music. The tools to create a multi-track song can be found on home computers, tablets, or even smartphones. Home Recording For Musicians For Dummies de-mystifies the world of recording by walking would-be producers and engineers through the steps of recording or creating tracks, making edits, mixing, and mastering into a final product you can share with the world. The book covers how to apply proven recording methods whether you're using a digital device, a computer with recording software, or standalone home recording gear.Inside... Choose the studio that fits your needs Acquire the necessary hardware Get to know different microphones Discover tips on recording live instruments Record using virtual instruments Build rhythm tracks and loops Edit, mix and master your recording.</p>", "user_ratings": {}, "developers": [{"developer-name": "Strong"}], "item_content_type": "ebook"}, "pianoexercisesfordummies2ndedition": {"human_name": "Piano Exercises For Dummies", "machine_name": "pianoexercisesfordummies2ndedition", "youtube_link": null, "callout": "2nd Edition", "publishers": [{"publisher-name": "Wiley", "publisher-url": "http://www.wiley.com/en-us/search?pq=1119873207"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 18.0}, "subtitle_html": null, "description_text": "<p>Tips for making the right and left hand work togetherLearning to play piano comes with benefits beyond adding beautiful music to your life. Studies have shown learning piano can reduce stress, improve memory, and even bolster your reading and math comprehension. Why wait for your physician to prescribe exercise to help with these things when you can improve yourself and start a fun hobby by learning piano. This book offers specific exercises designed to coordinate your hands, get to know chords and scales on the keys, and build the techniques you need to enjoy the adulation that comes from performing classical and modern piano pieces.Inside Build a pre-practice routine Improve your technique one finger at a time Reduce tension in your playing Explore new and unique scales Add your feet to the party Jump around the keybord (while remaining seated) Add fancy tricks Discover the habits of famous composers</p>", "user_ratings": {}, "developers": [{"developer-name": "Pearl"}], "item_content_type": "ebook"}, "songwritingfordummies_2e": {"human_name": "Songwriting For Dummies", "machine_name": "songwritingfordummies_2e", "youtube_link": null, "callout": "2nd Edition", "publishers": [{"publisher-name": "Wiley", "publisher-url": "http://www.wiley.com/en-us/search?pq=1119675650"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 18.0}, "subtitle_html": null, "description_text": "<p>Songwriting 101 -- get a grip on everything you need to know to write a song, from learning to listen to your \"inner voice\" to creating a \"mood\" and everything in between  Jaunt around the genres -- discover the variety of musical genres and find your fit, whether it's rock, pop, R&amp;B, gospel, country, or more  Let the lyrics out -- master the art of writing lyrics, from finding your own voice to penning the actual words to using hooks, verses, choruses, and bridges  Make beautiful music -- find your rhythm, make melodies, and use chords to put the finishing touches on your song  Work the Web -- harness online marketing and social networks like Facebook, Twitter, and others to get your music heard by a whole new audience.</p>", "user_ratings": {}, "developers": [{"developer-name": "Peterik"}], "item_content_type": "ebook"}}, "charity_data": {"charity_items": {"littlekidsrock": {"machine_name": "littlekidsrock", "youtube_link": null, "item_content_type": null, "subtitle_html": null, "description_text": "<p><em>Donations to support Musci Will are made to &nbsp;<a href=\"https://support.humblebundle.com/hc/en-us/articles/205183597\" target=\"_blank\" rel=\"noopener\">PayPal Giving Fund</a>, subject to its policies.</em></p>\n<p>Music Will runs the largest nonprofit music program in the US public school system. Our teachers currently serve over 500,000 students in more than 600 cities and towns across the country.<br><br>We believe that music education is a right, not a privilege, and it should reflect the cultures of the students it serves.<br><br>That’s why, for two decades now, our programs have taught students such popular American genres as rock, pop, R&amp;B, Latin, rap and country—alongside styles already taught in schools, such as classical and jazz.<br><br>Today, a national network of K-12 districts has adopted the Music Will program as their own.<br><br>More than 70 colleges and universities now teach our approach to their music education majors. Several state departments of education have partnered with Music Will to grow music education in the schools they serve.<br><br>Our mission of transforming lives by transforming music education has grown into a movement.</p>", "human_name": "Music Will", "developers": [], "publishers": [], "user_ratings": {}}}}, "from_bundle": {"machine_name": "pianoandmorefordummieswiley_bookbundle", "tile_short_name": "Piano and More for Dummies by Wiley", "short_marketing_blurb": "Piano playing made easy", "marketing_blurb": "Get <em>Keyboard For Dummies</em>, <em>Songwriting For Dummies</em>, <em>Home Recording For Dummies</em>, <em>Piano Exercises For Dummies</em>, <em>Music Composition For Dummies</em>, <em>Piano & Keyboard All-in-One For Dummies</em>, and more!", "detailed_marketing_blurb": "Hit all the right keys with our latest music bundle from Wiley! Get ebooks to teach you piano and other general musical skills like <em>Piano & Keyboard All-in-One For Dummies</em>, <em>Music Composition For Dummies</em>, <em>Songwriting For Dummies</em>, and <em>Piano Exercises For Dummies</em>. The experts behind the <em>For Dummies</em> series have been helping with reading and learning a variety of skills for more than 30 years, and their lessons will have you creating original music with ease. Plus, your purchase directly helps support Music Will— a nonprofit supporting future generations of musicians.", "author": "Wiley", "start_date|datetime": "2025-01-02T19:00:00", "end_date|datetime": "2025-01-23T19:00:00", "type": "bundle", "product_url": "/books/piano-and-more-for-dummies-wiley-books"}, "updated_at|datetime": "2025-01-03T03:05:59.104267", "first_seen_at|datetime": "2025-01-03T03:05:59.104267"}
{"machine_name": "completelearntocodebundle2025_softwarebundle", "author": "Mammoth Interactive", "basic_data": {"eula": null, "human_name": "The Complete Learn to Code Bundle 2025", "detailed_marketing_blurb": "Achieve your New Year's resolution and learn to code! This comprehensive curriculum will help you level up your skills with courses like Unreal Engine 5.5 Game Developer's Toolbox - Essential Templates and Assets, Godot 4 Game Creator's Pack - Essential Templates for Instant Game Development, and many more. Our collection of 40+ courses includes Humble Bundle-exclusive content available only to our community. Familiarize yourself with popular tools like Python and Unreal Engine, all while supporting Direct Relief with your purchase!  ", "short_marketing_blurb": "Learn to code games like a pro", "media_type": "software", "description": "<p><strong>Learn to code games like a pro.</strong> <span>Achieve your New Year's resolution and learn to code! This comprehensive curriculum will help you level up your skills with courses like&nbsp;</span><em>Unreal Engine 5.5 Game Developer's Toolbox - Essential Templates and Assets</em><span>,&nbsp;</span><em>Godot 4 Game Creator's Pack - Essential Templates for Instant Game Development</em><span>, and many more. Our collection of 40+ courses includes Humble Bundle-exclusive content available only to our community. Familiarize yourself with popular tools like Python and Unreal Engine, all while supporting Direct Relief with your purchase!&nbsp;&nbsp;</span></p>\n<p><strong>Pay $1 or more.</strong> Normally, the total cost for the software in this bundle is as much as $2,000. Here at Humble Bundle, you choose the price and increase your contribution to upgrade your bundle! This bundle has a minimum $1 purchase. Pay $1 or more to access keys.</p>\n<p><strong>Redeem your keys.</strong> <span>All content is redeemable with a key on the Mammoth website.</span></p>\n<p><strong>Support charity.</strong> Choose where the money goes - between the developer and to support Direct Relief. If you like what we do, you can leave us a Humble Tip too!</p>", "legal_disclaimer": null, "required_account_links": ["steam"], "end_time|datetime": "2025-01-23T19:00:00"}, "tier_item_data": {"builda3dproductviewerfore-commerce_profitablewebdevelopment": {"human_name": "Build a 3D Product Viewer for E-Commerce - Profitable Web Development", "machine_name": "builda3dproductviewerfore-commerce_profitablewebdevelopment", "youtube_link": null, "callout": "First-Time Exclusive Humble Bundle Release", "publishers": [{"publisher-name": "Mammoth Interactive", "publisher-url": "https://training.mammothinteractive.com/p/the-complete-crush-your-new-year-s-resolution-learn-to-code-bundle"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>What if your customers could explore your products in 3D before buying? This course teaches you how to create interactive 3D product viewers, transforming your e-commerce site into an engaging shopping experience.</p><p>Using WebGL tools like Three.js, you’ll learn how to design sleek, user-friendly product viewers that drive conversions. This course offers lifetime access and includes all the source files. Whether you’re a developer or store owner, this course will give you a competitive edge. Enroll today and bring your online store to life!</p>", "user_ratings": {}, "developers": [{"developer-name": "James Dabalus"}], "item_content_type": "software"}, "datavisualizationandimageprocessingmastery_numpypyplotandseaborn": {"human_name": "Data Visualization and Image Processing Mastery - NumPy, PyPlot and Seaborn", "machine_name": "datavisualizationandimageprocessingmastery_numpypyplotandseaborn", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Mammoth Interactive", "publisher-url": "https://training.mammothinteractive.com/p/the-complete-crush-your-new-year-s-resolution-learn-to-code-bundle"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Ready to take your data skills to the next level? This course equips you with advanced techniques to manipulate and visualize data using Python, empowering you to uncover deeper insights.</p><p>Master dataset manipulation with NumPy, explore powerful image processing techniques, and build complex visualizations with PyPlot and Seaborn. You’ll also learn how to visualize probability distributions to analyze data trends effectively. All source files are included, with lifetime access to revisit the content whenever you need a refresher.</p><p>Don’t wait—enroll today and unlock the true power of data science!</p>", "user_ratings": {}, "developers": [{"developer-name": "Team Mammoth"}], "item_content_type": "software"}, "opencvfordevelopers_buildimageeditingapplicationswithpython": {"human_name": "OpenCV for Developers - Build Image Editing Applications with Python", "machine_name": "opencvfordevelopers_buildimageeditingapplicationswithpython", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Mammoth Interactive", "publisher-url": "https://training.mammothinteractive.com/p/the-complete-crush-your-new-year-s-resolution-learn-to-code-bundle"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Want to build powerful image editing tools? This course gives you hands-on experience with OpenCV, the industry-standard library for computer vision and image processing.</p><p>Learn how to manipulate images, detect faces in real-time, and even add custom watermarks to your photos. With step-by-step guidance, all project source files included, and lifetime access, you’ll be able to revisit and refine your skills anytime. Sign up now and start building image editing applications today!</p>", "user_ratings": {}, "developers": [{"developer-name": "Team Mammoth"}], "item_content_type": "software"}, "tensorflowjsaimasterclass_buildreal-timemachinelearningwebapp": {"human_name": "TensorFlow.js AI Masterclass - Build Real-Time Machine Learning Web Applications", "machine_name": "tensorflowjsaimasterclass_buildreal-timemachinelearningwebapp", "youtube_link": null, "callout": "First-Time Exclusive Humble Bundle Release", "publishers": [{"publisher-name": "Mammoth Interactive", "publisher-url": "https://training.mammothinteractive.com/p/the-complete-crush-your-new-year-s-resolution-learn-to-code-bundle"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Do you want to build modern web applications powered by artificial intelligence? In this masterclass, you’ll learn to harness TensorFlow.js to build machine learning models that run directly in browsers—no backend required! This incredible course comes with lifetime access and includes all source code.</p><p>Whether you're predicting user behavior, generating recommendations, or creating interactive AI tools, this course covers the entire AI lifecycle, from model building to deployment. Gain hands-on experience with real-time data and unlock the potential of AI on the web. Sign up today and bring AI to life in your browser!</p>", "user_ratings": {}, "developers": [{"developer-name": "Alexandra Kropf"}], "item_content_type": "software"}, "unrealengine55gamedeveloperstoolbox_essentialtemplatesandassets": {"human_name": "Unreal Engine 5.5 Game Developer's Toolbox - Essential Templates and Assets ", "machine_name": "unrealengine55gamedeveloperstoolbox_essentialtemplatesandassets", "youtube_link": null, "callout": "First-Time Exclusive Humble Bundle Release", "publishers": [{"publisher-name": "Mammoth Interactive", "publisher-url": "https://training.mammothinteractive.com/p/the-complete-crush-your-new-year-s-resolution-learn-to-code-bundle"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Unlock the full potential of Unreal Engine 5.5 with this comprehensive toolbox! Designed for developers of all levels, this pack offers essential templates and game-ready assets to accelerate your development process. From complete game frameworks and UI elements to environment assets, you’ll have everything you need to bring your game concepts to life.</p><p>Whether you're building immersive open-world adventures or intense action levels, this toolbox is optimized for rapid iteration, leaving you more time to focus on gameplay and design. Start building with Unreal Engine today – no setup headaches, just pure creative freedom.</p>", "user_ratings": {}, "developers": [{"developer-name": "James Dabalus"}], "item_content_type": "software"}, "unity6gamedevelopment_cloneaviral2ddressupgame": {"human_name": "Unity 6 Game Development - Clone a Viral 2D Dress Up Game", "machine_name": "unity6gamedevelopment_cloneaviral2ddressupgame", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Mammoth Interactive", "publisher-url": "https://training.mammothinteractive.com/p/the-complete-crush-your-new-year-s-resolution-learn-to-code-bundle"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Learn to build a complete character customization system step-by-step in Unity 6. In this course, you’ll create and program customizable GameObjects with multiple layers, including hair, eyes, tops, bottoms, and shoes. Starting with the SpriteRenderer setup for each layer, you’ll build intuitive interfaces for users to switch skins, hairstyles, and clothing programmatically.</p><p>Create interactive buttons to update character features dynamically, such as changing tops and bottoms or applying skin tones with a button click. You’ll also explore how to display color themes and score outfits, with coins displayed on-screen to track progress and purchases.</p><p>Add depth to your game by implementing a mask customization layer with both free and locked premium options. Build menus that open on button click, programmatically display customization options, and update the player’s character in real time. You’ll learn to highlight selected options, draw borders, and even manage a user inventory system that tracks owned items, prices, and locks already purchased content.</p><p>Master building scrolling menus for easy navigation, including adjusting scroll rect positions, fixing endless scroll issues, and resizing layout elements. You’ll also implement smooth switching between menus with default item highlighting to create a seamless user experience. By the end of the course, you’ll have a fully functioning character customization system ready for your game.</p><p>With complete source files and lifetime access, you can revisit lessons and refine your customization features anytime. Enroll today and start building immersive character experiences in Unity!</p>", "user_ratings": {}, "developers": [{"developer-name": "Alexandra Kropf"}], "item_content_type": "software"}, "machinelearningwithpython_frombasicstoadvancedmodelsanddemoandintr": {"human_name": "Machine Learning with Python - From Basics to Advanced Models", "machine_name": "machinelearningwithpython_frombasicstoadvancedmodelsanddemoandintr", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Mammoth Interactive", "publisher-url": "https://training.mammothinteractive.com/p/the-ultimate-web-and-data-mastery-path-from-beginner-to-advanced-development-and-data-science/?coupon_code="}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 15.0}, "subtitle_html": null, "description_text": "<p>Sign up for a comprehensive journey into the field of machine learning. Starting with fundamental concepts like linear regression and k-nearest neighbors, the course gradually progresses to more complex models such as neural networks and ensemble methods. You’ll learn to use powerful Python libraries like scikit-learn, TensorFlow, and Pandas to build, train, and evaluate machine learning algorithms. Each section is packed with practical examples, ensuring you not only understand the theory but also apply it to real-world datasets.</p><p>This course focuses on end-to-end model development—from data preprocessing and feature engineering to model validation and optimization. You’ll work through projects like predictive analytics and image classification, giving you the skills to build your own machine learning solutions. Whether you aim to become a data scientist or want to add machine learning to your existing skill set, this course equips you with the tools and knowledge needed to excel in the field.</p>", "user_ratings": {}, "developers": [{"developer-name": "Team Mammoth"}], "item_content_type": "software"}, "3dmodelingmadeeasy_masterblenderfromscratch": {"human_name": "3D Modeling Made Easy - Master Blender from Scratch", "machine_name": "3dmodelingmadeeasy_masterblenderfromscratch", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Mammoth Interactive", "publisher-url": "https://training.mammothinteractive.com/p/the-complete-crush-your-new-year-s-resolution-learn-to-code-bundle"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Do you need 3D models for your applications? Do you want to become a 3D artist? This course bundle offers a complete beginner’s guide to Blender, teaching you everything from the basics to advanced modeling techniques. Bring your creative ideas to life in 3D!</p><p>Learn how to design characters, environments, and animations through hands-on projects that make mastering Blender easy and fun. Whether you’re new to 3D or want to refine your skills, this bundle has everything you need. Enroll now and start your 3D modeling journey today!</p>", "user_ratings": {}, "developers": [{"developer-name": "Tami Coker"}], "item_content_type": "software"}, "buildastunningshoebrandwebsitewithreactandai": {"human_name": "Build a Stunning Shoe Brand Website with React and AI", "machine_name": "buildastunningshoebrandwebsitewithreactandai", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Mammoth Interactive", "publisher-url": "https://training.mammothinteractive.com/p/the-ultimate-web-and-data-mastery-path-from-beginner-to-advanced-development-and-data-science/?coupon_code="}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 15.0}, "subtitle_html": null, "description_text": "<p>Ready to design a modern e-commerce site? This course guides you step-by-step through building a sleek shoe brand website using React and AI tools to enhance functionality.</p><p>You’ll have lifetime access to all content and source files, so you can build, tweak, and improve your site anytime. Enroll today and create a site that stands out from the crowd!</p>", "user_ratings": {}, "developers": [{"developer-name": "Sri Amin"}], "item_content_type": "software"}, "unity6masterkit_ready-to-usegametemplatesforrapiddevelopment": {"human_name": "Unity 6 Master Kit - Ready-to-Use Game Templates for Rapid Development ", "machine_name": "unity6masterkit_ready-to-usegametemplatesforrapiddevelopment", "youtube_link": null, "callout": "First-Time Exclusive Humble Bundle Release", "publishers": [{"publisher-name": "Mammoth Interactive", "publisher-url": "https://training.mammothinteractive.com/p/the-complete-crush-your-new-year-s-resolution-learn-to-code-bundle"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Take your Unity development to the next level with the Unity 6 Master Kit. This all-in-one pack includes ready-to-use templates for a variety of genres, from platformers and FPS games to RPGs and simulations.</p><p>The pre-built systems and scripts are designed to be highly modular and easy to customize, helping you jumpstart your project and cut down on development time. Whether you're an indie developer or working with a team, the Unity 6 Master Kit ensures you can focus on creativity and gameplay without getting bogged down in boilerplate code.</p>", "user_ratings": {}, "developers": [{"developer-name": "James Dabalus"}], "item_content_type": "software"}, "lowpolyknight3dmodelingmasteryinblender4": {"human_name": "Low Poly Knight 3D Modeling Mastery in Blender 4", "machine_name": "lowpolyknight3dmodelingmasteryinblender4", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Mammoth Interactive", "publisher-url": "https://training.mammothinteractive.com/p/the-complete-crush-your-new-year-s-resolution-learn-to-code-bundle"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Ever dreamed of creating your own medieval game characters? This course guides you step-by-step through modeling a knight, complete with armor, shield, legs, and a sword, using Blender 4.</p><p>You’ll also learn how to add realistic lighting, perfect your renders, and seamlessly export your assets to Unreal Engine 5 for game development. All project source files are included, and with lifetime access, you can revisit the content anytime to refine your skills. Enroll now and start building iconic game characters today! Lifetime access to this impressive course is included, along with all models.</p>", "user_ratings": {}, "developers": [{"developer-name": "Adom Shams"}], "item_content_type": "software"}, "unrealengine5masteryforbeginners_startbuildinggamestoday": {"human_name": "Unreal Engine 5 Mastery for Beginners - Start Building Games Today", "machine_name": "unrealengine5masteryforbeginners_startbuildinggamestoday", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Mammoth Interactive", "publisher-url": "https://training.mammothinteractive.com/p/the-complete-crush-your-new-year-s-resolution-learn-to-code-bundle"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Ever wanted to build games but didn’t know where to start? This beginner-friendly course introduces you to Unreal Engine 5 and is designed for all ages. Whether you're a young learner or an adult, this course simplifies game development with easy-to-follow lessons and practical projects.</p><p>Learn the basics of Unreal Engine, including blueprints, actors, and game modes. Build projects like top-down games, pixel art platformers, and interactive robots. Explore how to create user interfaces, implement collisions, and spawn actors at random locations. With real-world examples and step-by-step guidance, this course ensures you feel confident at every stage.</p><p>All source files are included, and with lifetime access, you can revisit lessons and projects whenever you need. Enroll now and start building your first game today!</p>", "user_ratings": {}, "developers": [{"developer-name": "Alexandra Kropf"}], "item_content_type": "software"}, "unrealengine55unlocked_masterthelatesttoolsandupdates": {"human_name": "Unreal Engine 5.5 Unlocked - Master the Latest Tools and Updates", "machine_name": "unrealengine55unlocked_masterthelatesttoolsandupdates", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Mammoth Interactive", "publisher-url": "https://training.mammothinteractive.com/p/the-complete-crush-your-new-year-s-resolution-learn-to-code-bundle"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Excited to explore the latest features in Unreal Engine 5.5? This course dives deep into the newest tools and techniques, helping you stay ahead in game development. You’ll learn how to build interactive projects using Blueprint Visual Scripting, Unreal’s powerful node-based coding system, allowing you to create game logic without needing traditional programming skills. From player mechanics to dynamic environments, you’ll gain hands-on experience crafting games with intuitive blueprints.</p><p>Work through real-world projects with complete source files and enjoy lifetime access to keep learning as the engine evolves. Whether you're a beginner or looking to enhance your Unreal skills, this course ensures you can build impressive games step-by-step. Enroll today and unlock the power of Unreal Engine 5.5!</p>", "user_ratings": {}, "developers": [{"developer-name": "Jared M"}], "item_content_type": "software"}, "pythonforeveryone_learnprogrammingwithfunbeginner-friendlyprojects": {"human_name": "Python for Everyone - Learn Programming with Fun, Beginner-Friendly Projects", "machine_name": "pythonforeveryone_learnprogrammingwithfunbeginner-friendlyprojects", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Mammoth Interactive", "publisher-url": "https://training.mammothinteractive.com/p/the-ultimate-web-and-data-mastery-path-from-beginner-to-advanced-development-and-data-science/?coupon_code="}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 15.0}, "subtitle_html": null, "description_text": "<p>Jump into programming through engaging, hands-on projects tailored for absolute beginners. You’ll start with the basics—like understanding variables, loops, and functions—and apply them to real-world scenarios. The course is designed to be approachable, helping you build fun applications like interactive quizzes, simple games, or even basic automation scripts. Each project is crafted to reinforce what you’ve learned while sparking creativity and keeping the process enjoyable.</p><p>By the end of this course, you’ll not only have a solid grasp of core Python concepts but also the skills to think logically and solve problems through code. The fun, project-based learning approach ensures you stay motivated while gaining practical experience. Whether you’re looking to explore programming as a hobby or lay the groundwork for a career, this course provides an excellent first step into the world of coding.</p>", "user_ratings": {}, "developers": [{"developer-name": "Alexandra Kropf"}], "item_content_type": "software"}, "webvrmastery_createimmersivevrexperienceswitha-frame": {"human_name": "WebVR Mastery - Create Immersive VR Experiences with A-Frame", "machine_name": "webvrmastery_createimmersivevrexperienceswitha-frame", "youtube_link": null, "callout": "First-Time Exclusive Humble Bundle Release", "publishers": [{"publisher-name": "Mammoth Interactive", "publisher-url": "https://training.mammothinteractive.com/p/the-complete-crush-your-new-year-s-resolution-learn-to-code-bundle"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>What if you could bring virtual worlds to life right in your browser? Build your first Virtual Reality web application in this amazing course. This course empowers you to create immersive Virtual Reality experiences using A-Frame, the WebVR framework that makes 3D content accessible through any device.</p><p>Get lifetime access to this amazing course, with all source code provided. Start with the basics and quickly advance to designing experiences that captivate users. Dive in now and pioneer the future of the web with your VR creations! Don't miss out.</p>", "user_ratings": {}, "developers": [{"developer-name": "James Dabalus"}], "item_content_type": "software"}, "godot4gamecreatorspack_essentialtemplatesforinstantgamedevelopment": {"human_name": "Godot 4 Game Creator's Pack - Essential Templates for Instant Game Development", "machine_name": "godot4gamecreatorspack_essentialtemplatesforinstantgamedevelopment", "youtube_link": null, "callout": "First-Time Exclusive Humble Bundle Release", "publishers": [{"publisher-name": "Mammoth Interactive", "publisher-url": "https://training.mammothinteractive.com/p/the-complete-crush-your-new-year-s-resolution-learn-to-code-bundle"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Bring your game ideas to life with the Godot 4 Game Creator’s Pack. This carefully curated collection of templates and systems offers everything you need to start building games immediately. Whether you're working on a Chess game or 2D Galaxy Impact Game, the ready-made templates cover core mechanics like player movement, enemies, obstacle, and more.</p>\n<p>Each template is fully customizable, giving you the flexibility to adapt it to your unique project. Perfect for both beginners and experienced developers, this pack eliminates the guesswork, so you can jump straight into game development with Godot 4.</p>", "user_ratings": {}, "developers": [{"developer-name": "James Dabalus"}], "item_content_type": "software"}, "interactive3ddatavisualizationmastery_buildthreejswebapplications": {"human_name": "Interactive 3D Data Visualization Mastery - Build THREE.JS Web Applications", "machine_name": "interactive3ddatavisualizationmastery_buildthreejswebapplications", "youtube_link": null, "callout": "First-Time Exclusive Humble Bundle Release", "publishers": [{"publisher-name": "Mammoth Interactive", "publisher-url": "https://training.mammothinteractive.com/p/the-complete-crush-your-new-year-s-resolution-learn-to-code-bundle"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Learn to build data visualizations for the web in this unique course. You'll create web apps with interactive 3D data visualizations using THREE.JS, making complex data intuitive and engaging. You will receive lifetime access to this exceptional course, along with all source code.</p><p>Master the art of building immersive graphs, plots, and charts that users can explore from every angle. Whether you’re working with business dashboards or educational content, this course will help you transform raw data into captivating visual stories. Start now and take your data visualization skills to new dimensions!</p>", "user_ratings": {}, "developers": [{"developer-name": "Jared M"}], "item_content_type": "software"}, "completebeginnersreactjs_elevateyourwebdevelopmentskills": {"human_name": "Complete Beginners React JS - Elevate Your Web Development Skills", "machine_name": "completebeginnersreactjs_elevateyourwebdevelopmentskills", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Mammoth Interactive", "publisher-url": "https://training.mammothinteractive.com/p/the-ultimate-web-and-data-mastery-path-from-beginner-to-advanced-development-and-data-science/?coupon_code="}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 15.0}, "subtitle_html": null, "description_text": "<p>Dive into a hands-on, beginner-friendly course guiding you through building a functional web app from scratch. Start with an introduction to React basics, followed by laying out components, creating to-do lists, and managing tasks dynamically. You'll build forms, update task status, and add responsive navigation, including a sidebar and toggle menu.</p><p>Learn to connect your app to a backend using JSON Server and Axios for fetching and posting data. Improve code quality with prop validation and folder restructuring. With lifetime access and source files included, this course gives you everything you need to build your first React app and continue your web development journey. Enroll today and start coding!</p>", "user_ratings": {}, "developers": [{"developer-name": "Faizan Khan"}], "item_content_type": "software"}, "buildaninteractiveaudiovisualizer_threejsandreactthreefibermasterc": {"human_name": "Build an Interactive Audio Visualizer - Three.js and React Three Fiber Masterclass", "machine_name": "buildaninteractiveaudiovisualizer_threejsandreactthreefibermasterc", "youtube_link": null, "callout": "First-Time Exclusive Humble Bundle Release", "publishers": [{"publisher-name": "Mammoth Interactive", "publisher-url": "https://training.mammothinteractive.com/p/the-complete-crush-your-new-year-s-resolution-learn-to-code-bundle"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Do you want to add a new, exciting project to your web development portflio? Learn to visualize music in real-time with stunning 3D animations! This masterclass empowers you to build jaw-dropping audio visualizers using Three.js and React Three Fiber, blending the power of WebGL and React.</p><p>Learn how to sync visuals with audio, create dynamic 3D elements, and deliver captivating user experiences right in the browser. You'll get lifetime access to this outstanding course, with all source code included. Perfect for creatives and developers alike, this course will give you the tools to craft visually immersive projects. Sign up now and start turning sound into a visual masterpiece!</p>", "user_ratings": {}, "developers": [{"developer-name": "Alexandra Kropf"}], "item_content_type": "software"}, "3dwebdevelopershandbook_masterreactthreefiberwithrealprojects": {"human_name": "3D Web Developer's Handbook - Master React Three Fiber with Real Projects", "machine_name": "3dwebdevelopershandbook_masterreactthreefiberwithrealprojects", "youtube_link": null, "callout": "First-Time Exclusive Humble Bundle Release", "publishers": [{"publisher-name": "Mammoth Interactive", "publisher-url": "https://training.mammothinteractive.com/p/the-complete-crush-your-new-year-s-resolution-learn-to-code-bundle"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Do you want to build 3D web applications, from video games to product visualizers? This course gives you the expertise to design dynamic 3D web applications using React Three Fiber, the cutting-edge library for WebGL-based development.</p><p>Work on real projects that explore everything from simple models to complex animations, mastering how to blend 3D elements seamlessly into interactive web experiences. Enjoy lifetime access to this fantastic course, complete with all source code. Don’t miss out—start building the future of the web today!</p>", "user_ratings": {}, "developers": [{"developer-name": "Alexandra Kropf"}], "item_content_type": "software"}, "comprehensivepythonfoundations_abeginnersguidetocoding": {"human_name": "Comprehensive Python Foundations - A Beginner's Guide to Coding", "machine_name": "comprehensivepythonfoundations_abeginnersguidetocoding", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Mammoth Interactive", "publisher-url": "https://training.mammothinteractive.com/p/python-essentials-and-visualization-mastery-from-coding-foundations-to-stunning-graphs"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 1.0}, "subtitle_html": null, "description_text": "<p>Are you ready to dive into the world of coding? Whether you’re new to programming or looking to sharpen your skills, this comprehensive Python course is designed to take you from absolute beginner to confident coder.</p><p>Learn the fundamental concepts of programming while mastering Python, one of the world’s most versatile and beginner-friendly languages. Step by step, you’ll be guided through coding basics, real-world applications, and practical exercises that help you build strong problem-solving skills.</p>", "user_ratings": {}, "developers": [{"developer-name": "Nimish Narang"}, {"developer-name": "John Bura"}], "item_content_type": "software"}, "mernstacke-commercemasterclass_buildanddeployfullstackonlinestores": {"human_name": "MERN Stack E-Commerce Masterclass - Build and Deploy Fullstack Online Stores", "machine_name": "mernstacke-commercemasterclass_buildanddeployfullstackonlinestores", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Mammoth Interactive", "publisher-url": "https://training.mammothinteractive.com/p/the-ultimate-web-and-data-mastery-path-from-beginner-to-advanced-development-and-data-science/?coupon_code="}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 15.0}, "subtitle_html": null, "description_text": "<p>In this hands-on course, you’ll learn to develop a scalable online store using MongoDB, Express, React, and Node.js (MERN), creating everything from backend APIs to dynamic frontends with seamless user authentication.</p><p>Start by setting up an Express web backend and connecting it to a MongoDB database for secure data management. You’ll build essential API routes for handling user data, authentication, and transactions, ensuring your app functions efficiently on the server side.</p><p>Next, develop a modern online store with React and Vite, mastering the latest frontend tools to create fast, user-friendly interfaces. You’ll also implement a cart management system with ReactJS to handle products and orders, ensuring a smooth shopping experience for users.</p><p>Finally, integrate user authentication and management features, enabling customers to sign in, manage profiles, and securely access their data. With practical lessons and complete source files, this course provides all the tools you need to build and deploy a fully functional eCommerce site.</p><p>Enroll now and become proficient in MERN stack development, gaining the skills to create powerful web applications from the ground up!</p>", "user_ratings": {}, "developers": [{"developer-name": "Osama Zaidiah"}], "item_content_type": "software"}, "ethicalhackingforbeginners_mastercybersecurityskillsfast": {"human_name": "Ethical Hacking for Beginners - Master Cybersecurity Skills Fast", "machine_name": "ethicalhackingforbeginners_mastercybersecurityskillsfast", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Mammoth Interactive", "publisher-url": "https://training.mammothinteractive.com/p/the-complete-crush-your-new-year-s-resolution-learn-to-code-bundle"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Curious about how hackers work—and how to stop them? This course offers a complete beginner’s guide to ethical hacking, teaching you how to identify vulnerabilities, secure systems, and protect networks from attacks.</p><p>With step-by-step lessons, you’ll set up your own hacking lab, explore network and post-connection attacks, learn WEP/WPA/WPA2 cracking techniques, and dive into powerful tools like Wireshark and Bettercap. Each module comes with source files, PowerPoint presentations, and hands-on exercises to solidify your learning.</p><p>Lifetime access ensures you can revisit the material anytime, keeping your skills sharp and up-to-date. Enroll now and start mastering cybersecurity today!</p>", "user_ratings": {}, "developers": [{"developer-name": "Sana Fatima"}], "item_content_type": "software"}, "3dwebdevelopmentfundamentals_jumpintothreejs": {"human_name": "3D Web Development Fundamentals - Jump into Three.js", "machine_name": "3dwebdevelopmentfundamentals_jumpintothreejs", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Mammoth Interactive", "publisher-url": "https://training.mammothinteractive.com/p/the-ultimate-web-and-data-mastery-path-from-beginner-to-advanced-development-and-data-science/?coupon_code="}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 15.0}, "subtitle_html": null, "description_text": "<p>Dive into the world of 3D web game development with JavaScript and Three.js! This comprehensive course will guide you through every step of creating interactive 3D games for the web. Learn to build immersive scenes, move characters, and detect collisions in real-time, all while leveraging the power of Three.js.</p><p>Start by building a simple 3D scene complete with characters and world elements. Progress to more advanced features like character movement, handling continuous key presses, and setting up a dynamic camera that follows the player seamlessly. Master collision detection and overlay 2D health bars to track player status.</p><p>Fine-tune the gaming experience by learning how to rotate the player and handle window resizing for a smooth, responsive game. Unlock customization options by changing player skins, giving your game a personal touch.</p><p>With complete source files provided for every project and lifetime access to the course, you can refine your skills and revisit content anytime. Enroll today and bring your game ideas to life with 3D web technology and JavaScript!</p>", "user_ratings": {}, "developers": [{"developer-name": "Alexandra Kropf"}], "item_content_type": "software"}, "advancedjavascriptmastery_builddynamicinteractivewebsites": {"human_name": "Advanced JavaScript Mastery - Build Dynamic, Interactive Websites", "machine_name": "advancedjavascriptmastery_builddynamicinteractivewebsites", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Mammoth Interactive", "publisher-url": "https://training.mammothinteractive.com/p/the-complete-crush-your-new-year-s-resolution-learn-to-code-bundle"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Ready to elevate your web development skills? This advanced JavaScript course takes you beyond the basics, teaching you everything you need to build dynamic, high-performing websites and applications.</p><p>Master modern JavaScript concepts, including arrow functions, asynchronous programming, classes, and advanced DOM manipulation. Work through hands-on coding challenges and real-world projects to solidify your understanding. You’ll also explore AJAX, APIs, promises, and async/await to build responsive, interactive web applications.</p><p>All project source files are included, and with lifetime access, you can revisit the material whenever you need to refresh your skills. Enroll now and become the JavaScript developer you’ve always wanted to be!</p>", "user_ratings": {}, "developers": [{"developer-name": "Maaz Muhammad"}], "item_content_type": "software"}, "datasciencefundamentals_explorecleanandanalyzedatawithpythonandpan": {"human_name": "Data Science Fundamentals - Explore, Clean, and Analyze Data with Python and Pandas", "machine_name": "datasciencefundamentals_explorecleanandanalyzedatawithpythonandpan", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Mammoth Interactive", "publisher-url": "https://training.mammothinteractive.com/p/the-ultimate-web-and-data-mastery-path-from-beginner-to-advanced-development-and-data-science/?coupon_code="}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 15.0}, "subtitle_html": null, "description_text": "<p>Do you want a deep dive into the essential tools and techniques used in data science? You’ll begin by learning how to work with popular Python libraries like Pandas and NumPy to manipulate and clean data. The course covers critical concepts such as data wrangling, exploratory data analysis, and visualization, ensuring you can make sense of complex datasets.</p><p>Through hands-on projects, you’ll explore datasets across various domains and learn to uncover patterns, trends, and insights. This course emphasizes practical skills like handling missing data, creating informative visualizations with Matplotlib and Seaborn, and preparing data for analysis. Whether you aim to pursue a career in data science or need data skills for business or research, this course provides the perfect foundation to get started.</p>", "user_ratings": {}, "developers": [{"developer-name": "Team Mammoth"}], "item_content_type": "software"}, "javascriptforbeginners_buildyourfirstwebsitesandapplications": {"human_name": "JavaScript for Beginners - Build Your First Websites and Applications", "machine_name": "javascriptforbeginners_buildyourfirstwebsitesandapplications", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Mammoth Interactive", "publisher-url": "https://training.mammothinteractive.com/p/the-complete-crush-your-new-year-s-resolution-learn-to-code-bundle"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Want to become a web developer? This comprehensive course covers everything you need to learn JavaScript and build powerful, dynamic applications.</p><p>Start with core concepts like strings, numbers, booleans, and arrays, then dive into loops, objects, and functions. Explore complex topics such as recursion, collections, destructuring, and error handling. You’ll also learn how to manage events, handle keypresses, work with priority queues, and optimize with setTimeout. The course includes practical examples like dropdowns, buttons, debugging, and using advanced functions like reduce and flatMap.</p><p>With all source files provided and lifetime access to the course, you’ll have the freedom to learn at your own pace and revisit material as needed. Enroll today and take your JavaScript skills to the next level!</p>", "user_ratings": {}, "developers": [{"developer-name": "Razvan Nesiu"}], "item_content_type": "software"}, "cursorideprotips_turbochargeyourcodingwithadvancedworkflowsandshor": {"human_name": "Cursor IDE Pro Tips - Turbocharge Your Coding with Advanced Workflows and Shortcuts", "machine_name": "cursorideprotips_turbochargeyourcodingwithadvancedworkflowsandshor", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Mammoth Interactive", "publisher-url": "https://training.mammothinteractive.com/p/the-complete-crush-your-new-year-s-resolution-learn-to-code-bundle"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Want to boost your coding productivity? This course reveals the best tips and tricks to master Cursor IDE, teaching you advanced workflows and time-saving shortcuts.</p><p>With lifetime access to all content and example files included, you’ll transform the way you work. Sign up now and code smarter, not harder!</p>", "user_ratings": {}, "developers": [{"developer-name": "Jared M"}], "item_content_type": "software"}, "datasciencefoundations_diveintopythonandnumpyforpowerfulinsightsan": {"human_name": "Data Science Foundations - Dive into Python and NumPy for Powerful Insights", "machine_name": "datasciencefoundations_diveintopythonandnumpyforpowerfulinsightsan", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Mammoth Interactive", "publisher-url": "https://training.mammothinteractive.com/p/the-ultimate-web-and-data-mastery-path-from-beginner-to-advanced-development-and-data-science/?coupon_code="}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 15.0}, "subtitle_html": null, "description_text": "<p>This comprehensive course is your gateway to the world of data science! You'll delve into the essentials of data manipulation, analysis, and visualization using Python and NumPy, two of the most powerful tools in the field. Learn to handle large datasets with ease, perform complex calculations, and uncover valuable insights. You'll explore key techniques for data cleaning, transformation, and exploration, and develop the ability to create compelling plots and charts that effectively convey your findings. Whether you're just starting out or aiming to advance your career as a data scientist, this course will provide you with the foundational skills and knowledge needed to thrive in the data-driven world.</p>", "user_ratings": {}, "developers": [{"developer-name": "Team Mammoth"}], "item_content_type": "software"}, "arontheweb_buildimmersiveaugmentedrealitywebapplicationswitharjs": {"human_name": "AR on the Web - Build Immersive Augmented Reality Web Applications with AR.js", "machine_name": "arontheweb_buildimmersiveaugmentedrealitywebapplicationswitharjs", "youtube_link": null, "callout": "First-Time Exclusive Humble Bundle Release", "publishers": [{"publisher-name": "Mammoth Interactive", "publisher-url": "https://training.mammothinteractive.com/p/the-complete-crush-your-new-year-s-resolution-learn-to-code-bundle"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Curious how to bring Augmented Reality experiences directly to the web? This course guides you through building web-based augmented reality applications using AR.js, making your content accessible on any device—no apps required.</p><p>Learn to get started with immersive web AR. This course provides lifetime access and comes with all source code. Get started now and redefine how users interact with your content!</p>", "user_ratings": {}, "developers": [{"developer-name": "Jared M"}], "item_content_type": "software"}, "directrelief": {"human_name": "Direct Relief", "machine_name": "directrelief", "youtube_link": "0wHsWFLYJ5o", "callout": null, "publishers": [], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "subtitle_html": null, "description_text": "<p><em>Donations to support Direct Relief&nbsp;are made to the&nbsp;<a rel=\"nofollow\" target=\"_blank\" href=\"https://support.humblebundle.com/hc/en-us/articles/205183597\">PayPal Giving Fund</a>, subject to its policies.</em><br /><br />Founded in 1948, Direct Relief is a nonprofit, nonpartisan organization that has become one the world&rsquo;s largest providers of medical relief in the world. Direct Relief works with healthcare professionals and organizations on the ground, establishing partnerships with local organizations that provide health services to people who would otherwise not receive them. Active in all 50 states and in 70 countries, Direct Relief is the only U.S. nonprofit organization licensed and accredited to distribute prescription medications in all 50 U.S. states.&nbsp; Among its distinctions, Direct Relief has top charity ratings, including four-star and \"top-notch\" ratings from Charity Navigator, a 100% fundraising efficiency rating from Forbes magazine, and was recently recognized by Fast Company as one of the Top 10 Most Innovative Nonprofits in the World.<br /><br /><span>Direct Relief&rsquo;s ongoing partnerships allow it to respond fast and expansively in times of emergency, including the devastating earthquakes in Nepal, where it has provided over $28 million (wholesale value) in medical aid to date.&nbsp; This includes supplies for surgeries and treatment of trauma-related injuries, antibiotics, nutritional items, and other critical medical resources.</span></p>", "user_ratings": {}, "developers": [{"developer-name": "www.directrelief.org", "developer-url": "http://www.directrelief.org/"}], "item_content_type": null}, "unityandccompletebeginnersguide_buildgamesfromscratch": {"human_name": "Unity and C# Complete Beginner's Guide - Build Games from Scratch", "machine_name": "unityandccompletebeginnersguide_buildgamesfromscratch", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Mammoth Interactive", "publisher-url": "https://training.mammothinteractive.com/p/the-complete-crush-your-new-year-s-resolution-learn-to-code-bundle"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Ready to build your own games and master coding? This comprehensive bundle is designed for beginners of all ages, combining Unity game development and C# programming into one powerful learning package.</p><p>In the Unity course, you’ll create interactive 2D and 3D games from scratch, using Unity’s visual scripting tools and C# integration to build exciting mechanics. You’ll master essential game development skills, such as handling collisions, building user interfaces, generating levels, and implementing player controls. Projects include platformers, collectibles, particle explosions, and more—perfect for first-time game developers.</p><p>The C# programming course complements your game development journey, offering a complete introduction to C#—the language behind Unity. Learn how to build classes, methods, and design patterns (such as Singleton and Builder) that are essential for game logic. You’ll also explore ASP.NET to create simple web apps and gain hands-on experience with advanced topics like data structures, algorithms, and CRUD operations for backend development.</p><p>With complete source files and lifetime access to all content, you can move at your own pace and revisit topics whenever you need. Whether you’re building games, learning C# for the first time, or exploring design patterns, this bundle offers everything you need to succeed.</p><p>Enroll now and unlock your potential—start building your dream games and mastering C# today!</p>", "user_ratings": {}, "developers": [{"developer-name": "Alexandra Kropf"}], "item_content_type": "software"}, "twitterbotdevelopmentmasterclass_automatesocialmediawithcursorandj": {"human_name": "Twitter Bot Development Masterclass - Automate Social Media with Cursor and JavaScript", "machine_name": "twitterbotdevelopmentmasterclass_automatesocialmediawithcursorandj", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Mammoth Interactive", "publisher-url": "https://training.mammothinteractive.com/p/the-complete-crush-your-new-year-s-resolution-learn-to-code-bundle"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Want to create a Twitter bot that runs 24/7? This masterclass shows you how to automate social media tasks with Cursor and JavaScript, giving you complete control over your bot.</p><p>You’ll get lifetime access and all project source files, making it easy to revisit and tweak your bot anytime. Join now and build your first automated Twitter bot today!</p>", "user_ratings": {}, "developers": [{"developer-name": "Jared M"}], "item_content_type": "software"}, "exceltopythonmasterclass_automateyourdataworkflowsandanalytics": {"human_name": "Excel to Python Masterclass - Automate Your Data Workflows and Analytics", "machine_name": "exceltopythonmasterclass_automateyourdataworkflowsandanalytics", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Mammoth Interactive", "publisher-url": "https://training.mammothinteractive.com/p/the-complete-crush-your-new-year-s-resolution-learn-to-code-bundle"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Ready to automate your data workflows and leave manual processes behind? This course takes you step-by-step through transitioning from Excel to Python, empowering you to streamline and supercharge your data science tasks.</p><p>Learn how to automate Excel operations, reshape data for modeling, build linear regression models, and visualize predictions—all with Python. You’ll also manipulate Excel sheets, create pivot tables, and build custom filters on real datasets, including blockchain data. With source files included and lifetime access, you can revisit the material anytime to sharpen your skills.</p><p>Don’t wait—enroll now and transform the way you work with data!</p>", "user_ratings": {}, "developers": [{"developer-name": "Alexandra Kropf"}], "item_content_type": "software"}, "lowpolymasterpack_creategame-readyassetsforrobloxgodotunityandunre": {"human_name": "Low Poly Master Pack - Create Game-Ready Assets for Roblox, Godot, Unity, and Unreal", "machine_name": "lowpolymasterpack_creategame-readyassetsforrobloxgodotunityandunre", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Mammoth Interactive", "publisher-url": "https://training.mammothinteractive.com/p/the-complete-crush-your-new-year-s-resolution-learn-to-code-bundle"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Get the ultimate asset collection designed to supercharge your game development projects! Whether you're building immersive environments, character-driven adventures, or fun sandbox worlds, this pack provides everything you need to bring your ideas to life.</p><p>Inside, you’ll find a diverse range of meticulously crafted, low-poly models optimized for performance and ready for use across multiple engines, including Roblox, Godot, Unity, and Unreal Engine. From modular terrain pieces and buildings to vehicles, characters, and props, these assets are perfect for prototyping or full-scale production without compromising quality or performance.</p><p>Each model is lightweight, well-optimized, and UV-mapped, making them easy to customize with your textures or shaders. Whether you’re a seasoned developer or just starting, these assets will streamline your workflow and help you focus on building gameplay rather than modeling from scratch. The Low Poly Master Pack is ideal for indie developers, students, or game studios looking for a cohesive, art-friendly solution for their projects. Download today and start creating your dream game worlds instantly!</p>", "user_ratings": {}, "developers": [{"developer-name": "Team Mammoth"}], "item_content_type": "software"}, "advancedreactnativemastery_buildnext-levelmobileapps": {"human_name": "Advanced React Native Mastery - Build Next-Level Mobile Apps", "machine_name": "advancedreactnativemastery_buildnext-levelmobileapps", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Mammoth Interactive", "publisher-url": "https://training.mammothinteractive.com/p/the-complete-crush-your-new-year-s-resolution-learn-to-code-bundle"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Looking to take your mobile development skills to the next level? This online video course bundle dives deep into advanced React Native concepts, enabling you to create powerful, cross-platform apps with top-tier performance.</p><p>Get lifetime access to this bundle, including all source code. Whether you’re building for iOS, Android, or both, this bundle will help you create seamless mobile experiences. Enroll today and build apps that users love!</p>", "user_ratings": {}, "developers": [{"developer-name": "Sri Amin"}], "item_content_type": "software"}, "webdevelopmentforabsolutebeginners_htmlcssandcommandline": {"human_name": "Web Development for Absolute Beginners - HTML, CSS and Command Line", "machine_name": "webdevelopmentforabsolutebeginners_htmlcssandcommandline", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Mammoth Interactive", "publisher-url": "https://training.mammothinteractive.com/p/the-ultimate-web-and-data-mastery-path-from-beginner-to-advanced-development-and-data-science/?coupon_code="}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 15.0}, "subtitle_html": null, "description_text": "<p>Ready to start your web development journey? This beginner-friendly course offers the perfect introduction to the fundamentals of HTML, CSS, and the command line, giving you the essential skills to bring your ideas to life on the web. Whether you’re new to coding or looking to refresh your skills, this course will guide you step-by-step through building modern, responsive websites from scratch.</p><p>You’ll begin by learning the structure of a webpage using HTML, mastering elements like headings, paragraphs, lists, and images. Then, you’ll dive into CSS to style your pages, creating visually appealing layouts with fonts, colors, and responsive designs. As a bonus, you’ll explore the command line, a powerful tool for managing files and projects efficiently, setting the foundation for more advanced development workflows.</p><p>This course offers complete source files for every project, allowing you to follow along seamlessly and experiment with your own ideas. Plus, with lifetime access, you can learn at your own pace and revisit any lesson whenever you need a refresher.</p><p>By the end, you’ll have built your own functional websites and developed the confidence to take on more complex web projects. Enroll today and take the first step toward becoming a web developer!</p>", "user_ratings": {}, "developers": [{"developer-name": "Alexandra Kropf"}], "item_content_type": "software"}, "apiintegrationmastery_buildinteractiveappswithcursorandtkinter": {"human_name": "API Integration Mastery - Build Interactive Apps with Cursor and Tkinter", "machine_name": "apiintegrationmastery_buildinteractiveappswithcursorandtkinter", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Mammoth Interactive", "publisher-url": "https://training.mammothinteractive.com/p/the-complete-crush-your-new-year-s-resolution-learn-to-code-bundle"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Curious how APIs power modern apps? This course teaches you how to integrate APIs into your applications using Cursor and Python Tkinter, making your projects more dynamic and interactive.</p><p>Enjoy lifetime access to content and source files, so you can build confidently and revisit projects whenever needed. Enroll today and start mastering API integration!</p>", "user_ratings": {}, "developers": [{"developer-name": "Jared M"}], "item_content_type": "software"}, "pythonprojectmastery_buildreal-worldapplicationsstepbystepandintro": {"human_name": "Python Project Mastery - Build Real-World Applications Step by Step", "machine_name": "pythonprojectmastery_buildreal-worldapplicationsstepbystepandintro", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Mammoth Interactive", "publisher-url": "https://training.mammothinteractive.com/p/the-ultimate-web-and-data-mastery-path-from-beginner-to-advanced-development-and-data-science/?coupon_code="}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 15.0}, "subtitle_html": null, "description_text": "<p>Do you want to learn to code in Python through practical projects? From web scraping and task automation to building GUIs and APIs, this course guides you through the entire process of developing fully functional applications. You’ll start with smaller programs to practice foundational skills and gradually move to more complex, real-world scenarios.</p><p>Each project includes detailed instructions, source code, and challenges to enhance your problem-solving abilities. Along the way, you’ll learn best practices in software development, including code organization, version control, and testing. By the end of the course, you’ll have a portfolio of projects that not only showcase your skills but also prepare you for real-world programming roles.</p>", "user_ratings": {}, "developers": [{"developer-name": "Team Mammoth"}], "item_content_type": "software"}, "fantasyassetcreationinblender4_completelowpoly3dmodelmasterclass": {"human_name": "Fantasy Asset Creation in Blender 4 - Complete Low Poly 3D Model Masterclass", "machine_name": "fantasyassetcreationinblender4_completelowpoly3dmodelmasterclass", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Mammoth Interactive", "publisher-url": "https://training.mammothinteractive.com/p/the-complete-crush-your-new-year-s-resolution-learn-to-code-bundle"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Ready to design vibrant RPG worlds? Time is ticking—this course is your chance to master the art of low-poly modeling and build cartoon-style assets that stand out. Learn how to model enchanting game assets, including controllers, crystal lamps, magical gift boxes, moon weapons, swords, and more—all using Blender 4. This course grants lifetime access and includes all models.</p><p>From colorful characters to immersive environments, you’ll learn how to create game-ready models optimized for performance. With step-by-step guidance, you’ll have a complete RPG asset library by the end of the course. Don’t wait—start building your dream RPG video games today before this opportunity passes!</p>", "user_ratings": {}, "developers": [{"developer-name": "Adom Shams"}], "item_content_type": "software"}, "modernfrontendmastery_buildai-enhancedappswithreactjsandcursor": {"human_name": "Modern Frontend Mastery - Build AI-Enhanced Apps with React JS and Cursor", "machine_name": "modernfrontendmastery_buildai-enhancedappswithreactjsandcursor", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Mammoth Interactive", "publisher-url": "https://training.mammothinteractive.com/p/the-complete-crush-your-new-year-s-resolution-learn-to-code-bundle"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Want to take your frontend skills to the next level? This course covers building AI-enhanced web apps using React JS and Cursor, focusing on modern tools and best practices.</p><p>With lifetime access and full project source files included, you’ll have everything you need to build cutting-edge web applications. Sign up today and create the apps of the future!</p>", "user_ratings": {}, "developers": [{"developer-name": "Alexandra Kropf"}], "item_content_type": "software"}, "datavisualizationmastery_unlockstunninggraphswithpythonandpyplot": {"human_name": "Data Visualization Mastery - Unlock Stunning Graphs with Python and PyPlot", "machine_name": "datavisualizationmastery_unlockstunninggraphswithpythonandpyplot", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Mammoth Interactive", "publisher-url": "https://training.mammothinteractive.com/p/python-essentials-and-visualization-mastery-from-coding-foundations-to-stunning-graphs"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 1.0}, "subtitle_html": null, "description_text": "<p>Unlock the art of data visualization with this comprehensive course focused on mastering the PyPlot library. You'll explore the intricacies of representing and exploring data through stunning plots, charts, and graphs. Learn to harness the full potential of PyPlot, from creating simple visualizations to applying advanced techniques that bring your data to life. This course will not only enhance your understanding of PyPlot's powerful features but also enable you to communicate insights and tell compelling data stories with creativity and precision. Elevate your Python skills and become a true data visualization master with PyPlot.</p>", "user_ratings": {}, "developers": [{"developer-name": "Nimish Narang"}, {"developer-name": "John Bura"}], "item_content_type": "software"}, "advancedcssmasterclass_designstunningresponsivewebsites": {"human_name": "Advanced CSS Masterclass - Design Stunning, Responsive Websites", "machine_name": "advancedcssmasterclass_designstunningresponsivewebsites", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Mammoth Interactive", "publisher-url": "https://training.mammothinteractive.com/p/the-ultimate-web-and-data-mastery-path-from-beginner-to-advanced-development-and-data-science/?coupon_code="}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 15.0}, "subtitle_html": null, "description_text": "<p>Learn to build stunning, responsive websites using popular lightweight CSS libraries. Whether you're just starting out or looking to enhance your web development skills, this course will guide you step-by-step through the process of building professional websites using the latest CSS tools.</p><p>You’ll start with Skeleton CSS, a minimal framework that allows you to quickly build clean, responsive layouts. Through hands-on lessons, you’ll learn how to set up projects efficiently and apply design principles that bring a polished look to your websites. Next, you’ll dive into Base CSS, a flexible framework designed for simplicity. With this tool, you'll create visually stunning layouts while focusing on usability and performance.</p><p>Building on these foundations, the course introduces Concise CSS, a modular framework that emphasizes reusable components. You’ll discover how to set up and customize your designs efficiently, making it easier to maintain and expand your web projects. From there, you’ll explore Cardinal CSS, which focuses on clarity and structure, helping you design fast-loading, modern websites that scale perfectly across all devices. Finally, you’ll delve into Furtive CSS, a framework specifically optimized for mobile-first development. With Furtive CSS, you’ll master fluid layouts that ensure seamless performance on phones, tablets, and desktops alike.</p><p>Throughout the course, you'll have access to complete source files for every project, allowing you to follow along and experiment at your own pace. With lifetime access, you can revisit any lesson whenever you need a refresher or want to try new techniques. By the end, you'll have the confidence and practical experience to design sleek, responsive websites that leave a lasting impression. Enroll today and start building the web with style and efficiency!</p>", "user_ratings": {}, "developers": [{"developer-name": "James Dabalus"}], "item_content_type": "software"}, "unrealengine55gamecreationbootcamp_buildyourfirstgamefast": {"human_name": "Unreal Engine 5.5 Game Creation Bootcamp - Build Your First Game Fast", "machine_name": "unrealengine55gamecreationbootcamp_buildyourfirstgamefast", "youtube_link": null, "callout": "First-Time Exclusive Humble Bundle Release", "publishers": [{"publisher-name": "Mammoth Interactive", "publisher-url": "https://training.mammothinteractive.com/p/the-complete-crush-your-new-year-s-resolution-learn-to-code-bundle"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Do you dream of building your own game but don’t know where to start? This self-paced bootcamp offers a rapid, hands-on introduction to Unreal Engine 5.5, giving you the tools and guidance needed to create a fully functional game from scratch. Learn to build game functionality with blueprints! You'll get lifetime access to this epic course.</p><p>Explore level design, character mechanics, and stunning visuals as you work step-by-step through the game development process. Whether you’re a total beginner or looking to refine your skills, this course ensures you build fast, learn fast, and finish strong. All source code is included. Enroll today and make your game ideas a reality!</p>", "user_ratings": {}, "developers": [{"developer-name": "Jared M"}], "item_content_type": "software"}, "unrealengine5multiplayermastery_buildandlaunchthrillingonlinegames": {"human_name": "Unreal Engine 5 Multiplayer Mastery - Build and Launch Thrilling Online Games - All-in-One Bundle", "machine_name": "unrealengine5multiplayermastery_buildandlaunchthrillingonlinegames", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Mammoth Interactive", "publisher-url": "https://training.mammothinteractive.com/p/the-complete-crush-your-new-year-s-resolution-learn-to-code-bundle"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Master the art of multiplayer game development with this comprehensive Unreal Engine 5 Complete Bundle. This hands-on course takes you step-by-step through the core concepts of multiplayer game design, including client-server architecture, replication, and memory management. You’ll work with Epic Online Services (EOS) to manage player accounts and sessions, ensuring seamless online gameplay.</p><p>Learn to build and host sessions, handle replicated variables and server events, and implement client RPC development to synchronize player actions. Develop a robust client-server replication system for object movement, physics, and rotation, ensuring smooth, real-time interaction between players.</p><p>The course also guides you through building exciting features such as a multiplayer RPG with health systems, XP mechanics, gun combat, and line trace shooting. Expand your game with collectible items that spawn dynamically, and design immersive first-person, third-person, and satellite camera systems.</p><p>You’ll also learn to implement an in-game chat system, building custom UI elements and message structures to facilitate communication between players. With practical examples and complete source files, you'll have everything you need to design multiplayer experiences from scratch.</p><p>Enroll today and build the next hit multiplayer game with Unreal Engine 5!</p>", "user_ratings": {}, "developers": [{"developer-name": "Saad Ali"}], "item_content_type": "software"}, "godotandgdscriptfundamentals_all-agesgamedevelopmentmadesimple": {"human_name": "Godot and GDScript Fundamentals - All-Ages Game Development Made Simple", "machine_name": "godotandgdscriptfundamentals_all-agesgamedevelopmentmadesimple", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Mammoth Interactive", "publisher-url": "https://training.mammothinteractive.com/p/the-complete-crush-your-new-year-s-resolution-learn-to-code-bundle"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Ready to build incredible 2D games? This comprehensive bundle combines Godot game development and GDScript programming, giving you everything you need to create fun, interactive games from scratch. Designed for absolute beginners of all ages, this bundle offers hands-on projects covering core concepts like player input, collision handling, and UI design.</p><p>You’ll explore Godot's intuitive editor while building scenes, nodes, and collectibles. Master mechanics such as spawning random enemies, managing game-over states, and creating dynamic gameplay through visual scripting. Alongside this, you’ll dive into GDScript, Godot’s native programming language, to write efficient code for player movement, reusable functions, and advanced game logic.</p><p>With complete source files and lifetime access, you can progress at your own pace and revisit the lessons whenever needed. Whether you are starting your game development journey or enhancing your programming skills, this bundle equips you with the essential tools to bring your game ideas to life. Enroll today and start building amazing games with Godot and GDScript.</p>", "user_ratings": {}, "developers": [{"developer-name": "Alexandra Kropf"}], "item_content_type": "software"}}, "charity_data": {"charity_items": {"directrelief": {"machine_name": "directrelief", "youtube_link": "0wHsWFLYJ5o", "item_content_type": null, "subtitle_html": null, "description_text": "<p><em>Donations to support Direct Relief&nbsp;are made to the&nbsp;<a rel=\"nofollow\" target=\"_blank\" href=\"https://support.humblebundle.com/hc/en-us/articles/205183597\">PayPal Giving Fund</a>, subject to its policies.</em><br /><br />Founded in 1948, Direct Relief is a nonprofit, nonpartisan organization that has become one the world&rsquo;s largest providers of medical relief in the world. Direct Relief works with healthcare professionals and organizations on the ground, establishing partnerships with local organizations that provide health services to people who would otherwise not receive them. Active in all 50 states and in 70 countries, Direct Relief is the only U.S. nonprofit organization licensed and accredited to distribute prescription medications in all 50 U.S. states.&nbsp; Among its distinctions, Direct Relief has top charity ratings, including four-star and \"top-notch\" ratings from Charity Navigator, a 100% fundraising efficiency rating from Forbes magazine, and was recently recognized by Fast Company as one of the Top 10 Most Innovative Nonprofits in the World.<br /><br /><span>Direct Relief&rsquo;s ongoing partnerships allow it to respond fast and expansively in times of emergency, including the devastating earthquakes in Nepal, where it has provided over $28 million (wholesale value) in medical aid to date.&nbsp; This includes supplies for surgeries and treatment of trauma-related injuries, antibiotics, nutritional items, and other critical medical resources.</span></p>", "human_name": "Direct Relief", "developers": [{"developer-name": "www.directrelief.org", "developer-url": "http://www.directrelief.org/"}], "publishers": [], "user_ratings": {}}}}, "from_bundle": {"machine_name": "completelearntocodebundle2025_softwarebundle", "tile_short_name": "The Complete Learn to Code Bundle 2025", "short_marketing_blurb": "Learn to code games like a pro", "marketing_blurb": "Get Comprehensive Python Foundations - A Beginner's Guide to Coding, Unity 6 Master Kit - Ready-to-Use Game Templates for Rapid Development (First-Time Exclusive Humble Bundle Release), and more!", "detailed_marketing_blurb": "Achieve your New Year's resolution and learn to code! This comprehensive curriculum will help you level up your skills with courses like Unreal Engine 5.5 Game Developer's Toolbox - Essential Templates and Assets, Godot 4 Game Creator's Pack - Essential Templates for Instant Game Development, and many more. Our collection of 40+ courses includes Humble Bundle-exclusive content available only to our community. Familiarize yourself with popular tools like Python and Unreal Engine, all while supporting Direct Relief with your purchase!  ", "author": "Mammoth Interactive", "start_date|datetime": "2025-01-02T19:00:00", "end_date|datetime": "2025-01-23T19:00:00", "type": "bundle", "product_url": "/software/complete-learn-to-code-bundle-2025-software"}, "updated_at|datetime": "2025-01-03T03:05:59.104267", "first_seen_at|datetime": "2025-01-03T03:05:59.104267"}
{"machine_name": "newyearsresolutionlearnnewskillencore_bundle", "author": "Publishers", "basic_data": {"eula": null, "human_name": "New Year, New You: Communication & Meditation", "detailed_marketing_blurb": "As you explore new languages with Influent—and have fun in the process—with this bundle of games designed to help you learn! Embark on a mystical quest in the typing RPG adventure <em>Nanotale: Typing Chronicles</em>. Build vocabulary and practice pronunciation as you explore the world of <em>Influent</em>. Grow a world through mindfulness in <em>PLAYNE: The Meditation Game</em>. Plus, help support Prevent Cancer Foundation with your purchase!", "short_marketing_blurb": "Unlock your New Year’s achievements", "media_type": "game", "description": "<p><strong>Unlock your New Year’s achievements.</strong> Resolve to level up your real-world skills—and have fun in the process—with this bundle of games designed to help you learn! Embark on a mystical quest in the typing RPG adventure <em>Nanotale: Typing Chronicles</em>. Build vocabulary and practice pronunciation as you explore the world of <em>Influent</em>. Grow a world through mindfulness in <em>PLAYNE: The Meditation Game</em>. Plus, help support Prevent Cancer Foundation with your purchase!</p>\n\n<p><strong>Pay $10 or more.</strong> Normally, the total cost for the games in this bundle is as much as $114. Here at Humble Bundle, you choose the price and increase your contribution to upgrade your bundle! This bundle has a minimum $10 purchase. Pay $10 or more to access Steam keys.</p>\n\n<p><strong>Redeem on Steam.</strong> All of the games in this bundle are available on Steam for Windows — and some for Mac and Linux too. Please check out the full system requirements <a href=\"https://support.humblebundle.com/hc/articles/11333877872667\" rel=\"noopener\" target=\"_blank\">here</a> prior to purchasing.</p>\n\n<p><strong>Support charity.</strong> Choose where the money goes - between the developers and Prevent Cancer Foundation via <a href=\"https://support.humblebundle.com/hc/articles/205183597\" rel=\"noopener\" target=\"_blank\">PayPal Giving Fund</a>. If you like what we do, you can leave us a Humble Tip too!</p>", "legal_disclaimer": null, "required_account_links": ["steam"], "end_time|datetime": "2025-01-16T02:00:00"}, "tier_item_data": {"epistory_typingchronicles": {"human_name": "Epistory - Typing Chronicles", "machine_name": "epistory_typingchronicles", "youtube_link": "O1qg_8JKojE", "callout": "Typing", "publishers": [{"publisher-name": "Plug In Digital", "publisher-url": "http://www.plug-in-digital.com/"}], "side_box_art_text": null, "third_party_subscribe_text": null, "min_price|money": {"currency": "USD", "amount": 10.0}, "subtitle_html": null, "description_text": "<strong>Epistory </strong> is an atmospheric adventure typing game that tells the story of a writer lacking inspiration who asks her muse to help write her latest book. <br><br>In Epistory you play the muse, a fictional character in a world where everything is untold. Your adventure begins on a blank page, but the world will soon become larger and livelier as you <strong> gather inspiration </strong> , <strong> solve its mysteries </strong> and <strong> defeat its enemies </strong> . From movement to opening chests and fighting in epic battles, every element in the game is controlled exclusively with the keyboard. <br><br>As you progress and explore the fantasy origami world, the story literally unfolds in the writer’s mind and the mysteries of the magic power of the words are revealed. <strong class=\"hmb\"> <br><br>Features </strong> <br><br>\n<ul>\n<li><strong> Explore a beautiful paper craft world: </strong> play as the muse riding a giant three tailed fox, lost in a fantasy 3D world</li>\n<li><strong> More than just typing: </strong> solve mysterious puzzles, unlock magic powers and defeat enemies in adrenaline pumping epic combats</li>\n<li><strong> A writer’s block? </strong> Collect fragments and inspirations points to unfold the story as you explore the origami world in the writer’s head. But there is more to the story than meets the eye…</li>\n<li><strong> All in keyboard: </strong> from movements, combats to even menus, control everything with a keyboard</li>\n<li><strong> Adaptive difficulty: </strong> if your hands fly around the keyboard or if you are a slow typist, the game features a dynamic difficulty system that evolves to fit each players’ skill set</li>\n<li><strong> Competitive Arena Mode: </strong> challenge other players for the top spot in the arena leaderboards</li>\n<li><strong> Play in your own language: </strong> game texts are localized in English, French, German, Spanish, Portuguese (Brazil), Russian, Polish with voice overs in English. The game supports several keyboard layouts (QWERTY, QWERTZ, AZERTY, BEPO, Dvorak, Workman and Colemak)</li>\n</ul>", "user_ratings": {"steam_percent|decimal": 0.94, "display_user_ratings": "steam_overall", "review_text": "Very Positive", "steam_count": 3387}, "developers": [{"developer-name": "Fishing Cactus", "developer-url": "http://www.fishingcactus.com/"}], "item_content_type": "game"}, "preventcancerfoundation": {"human_name": "Prevent Cancer Foundation", "machine_name": "preventcancerfoundation", "youtube_link": "KZw4XKncDgo", "callout": null, "publishers": [], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "subtitle_html": null, "description_text": "<em>Donations to support the Prevent Cancer Foundation&nbsp;are made to the&nbsp;<a rel=\"nofollow\" target=\"_blank\" href=\"https://support.humblebundle.com/hc/en-us/articles/205183597\">PayPal Giving Fund</a>, subject to its policies.</em><br><br>Founded in 1985, the Prevent Cancer Foundation has been a leader in cancer prevention and early detection.&nbsp; As the only nonprofit in the United States solely focused on cancer prevention and early detection, the Foundation has been referred to as \"the candle that ignited a bonfire\" in the field of prevention.&nbsp; Investing more than $138 million over the past 29 years, the Prevent Cancer Foundation has always focused its resources on cancers that can be prevented through healthy lifestyle choices or early detection.<br><br>Each year, more than 1.6 million Americans are diagnosed with cancer and more than 500,000 will die from the disease.&nbsp; However, research shows that up to 60 percent of cancer cases and more than 50 percent of cancer deaths are preventable - with the knowledge we have today.<br>The Foundation has spent the last three decades working for:<br>\n<ul>\n<li>Reducing the cancer mortality rate by focusing on individual behaviors, engaging in public policy discussions and funding on prevention and early detection research.</li>\n<li>Raising awareness of all preventable cancers across all populations.</li>\n<li>Making prevention knowledge and early detection services more accessible for people in medically underserved communities.</li>\n<li>Collaborating with partners to maximize the effectiveness and reach of the prevention and early detection programs and message.</li>\n</ul>", "user_ratings": {}, "developers": [{"developer-name": "www.preventcancer.org", "developer-url": "http://www.PreventCancer.org"}], "item_content_type": null}, "youcankana-learnjapanesehiraganakatakana": {"human_name": "You Can Kana - Learn Japanese Hiragana & Katakana", "machine_name": "youcankana-learnjapanesehiraganakatakana", "youtube_link": "_TMDfu_F3aU", "callout": "Language", "publishers": [], "side_box_art_text": null, "third_party_subscribe_text": null, "min_price|money": {"currency": "USD", "amount": 10.0}, "subtitle_html": null, "description_text": "<strong> <i> You Can Kana </i> </strong> is a game for japanese learners of all abilities. Learn the characters in a series of quick and engaging lessons, or jump straight into Challenge Mode to train your reading comprehension. <br><br><strong> What are Hiragana and Katakana? </strong> <br><br>They are the phonetic Japanese alphabets. If you want to learn to read Japanese, there's no better place to start than with hiragana and katakana! <br><strong><br>&nbsp;Features:</strong><br>\n<ul>\n<li>Quick and engaging lessons introduce you to Katakana and Hiragana characters.</li>\n<li>Learn <strong> pronunciation </strong> with audio provided by Learn Japanese Adventure.</li>\n<li>Learn <strong> stroke order </strong> interactively for each character to help with memorisation.</li>\n<li>Lessons <strong> adapt to your progress </strong> , showing difficult characters more frequently.</li>\n<li>Practise by reading <strong> real Japanese words </strong> and seeing their English translations.</li>\n<li>Practise with vocab from the JLPT - the standardised proficiency tests created by the Japanese government.</li>\n<li>When you're ready, improve reading speed and accuracy in <strong> Challenge Mode. </strong></li>\n<li>Jump straight to the end of the lessons with a quick test, if you're feeling confident.</li>\n<li>Suitable for beginners and experts alike</li>\n</ul>", "user_ratings": {"steam_percent|decimal": 0.99, "display_user_ratings": "steam_overall", "review_text": "Very Positive", "steam_count": 106}, "developers": [{"developer-name": "James Moulang"}], "item_content_type": "game"}, "playne_themeditationgame": {"human_name": "PLAYNE : The Meditation Game", "machine_name": "playne_themeditationgame", "youtube_link": "Ec9PIV0xvIU", "callout": "Meditation", "publishers": [{"publisher-name": "Vismaya"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 10.0}, "subtitle_html": null, "description_text": "<i>COVID19 : Are you a nurse/carer serving the British NHS or a teacher? Contact me from your work email and I'll send you a copy of Playne for free.<br></i>\n<p><strong>Reviews</strong></p>\n<p>“It was the springboard to me meditating a few times a week.”&nbsp;Rock Paper Shotgun</p>\n<p>“So many videogames focus on bringing powerful emotions out in their players with large flashy scenes, dramatic stories, and intense action. In comparison, the calmness of Playne stands out, offering tranquility and personal growth in lieu of external validation.”&nbsp;Super Jump</p>\n<p>“While mindfulness and flow can be achieved through a variety of games, certain video games, such as Playne, have also been developed with the specific goal to improve mindfulness.”&nbsp;Video Games and Well-being, Dr Rachel Kowert</p>\n<strong>About Playne</strong>\n<ul>\n<li>\n<p>Build a daily habit of mindfulness</p>\n</li>\n<li>\n<p>Discover the benefits of meditation &amp; mindfulness</p>\n</li>\n<li>\n<p>Learn tools that can help you care for your mental wellbeing</p>\n</li>\n<li>\n<p>Available in VR.</p>\n<p><a href=\"https://store.steampowered.com/app/1525880/Playne_VR/\">You must download the VR DLC to launch in VR.</a></p>\n</li>\n<li>\n<p>97% of players felt calmer and more relaxed after playing *</p>\n</li>\n</ul>\n<strong>Gameplay Features</strong>\n<p></p>\n<ul>\n<li>Beautiful island that grows and transforms with your daily meditations</li>\n<li>Grow different species of trees and create unique biomes that reflect your journey</li>\n<li>Change the weather and time to create immersive relaxing ambiences</li>\n<li>Create your own serene nature spaces by planting trees and flora in Sandbox mode</li>\n<li>Complete Playne to unlock a massive island for you to explore and grow with mindfulness</li>\n</ul>\n<br><strong>Helping you build a daily habit of meditation and mindfulness</strong>\n<p>Playne is an island that grows with you. As you build a daily practice of mindfulness, seeds grow into trees, Aurora Borealis light up your night sky, and you'll unlock the powers of weather and time.</p>\n<strong>Explore a range of meditations and tools to care for your wellbeing</strong>\n<p>Easy to understand, easy to practice meditations, including audio-guided meditations that help you discover mindfulness. Write freely using an innovative mindful journaling tool. Learn exercises that help you reconnect with your body through breath.</p>\n<strong>Create deeply relaxing environments</strong>\n<p>Select the scenery, choose the weather, pick a time, put your headphones on and begin the journey to your inner world and discover the various aspects of your beautiful self.</p>\n<strong>Grow Various Types of Trees (2021 Biomes Update)</strong>\n<p>Your island can grow different species of trees and you can create multiple biomes for each of the game modes in Playne.</p>\n<strong>Create in Sandbox Mode. Explore in Evolve Mode,</strong>\n<p>Plant seeds and design your own Playne in Sandbox mode. Complete Playne to unlock Evolve mode where you can explore an expansive open-world island and grow immense forests.</p>\n<strong>A companion for your journey</strong>\n<p>Talk to Fox to discover the story of Playne and to find out how to approach healthy living and build healthy habits.</p>\n<strong>Support Reforestation</strong>\n<p>Complete Playne, and we will plant a tree to celebrate your journey near Tweedsmuir Hills in Scotland.</p>\nAvailable in VR for Free\n<ul>\n<li>You must download the&nbsp;<a href=\"https://store.steampowered.com/app/1525880/Playne_VR/\">free DLC</a>&nbsp;to enable VR mode.</li>\n<li>VIVE Cosmos is not officially supported.</li>\n<li>Quest 2 supported in tethered mode only, and&nbsp;<strong>not wireless</strong>.</li>\n<li>Not getting an option to run Playne in VR? Make sure the DLC is fully downloaded and installed then restart your computer.</li>\n</ul>\nHello from the Developer\n<p>Meditation is a way for us to learn about ourselves by discovering our inner world. As we better understand our inner world, the better we can respond to our outer world. I grew up with meditation and video games, and I'm exploring how video games can make it easier to learn and build a habit of meditation and mindfulness.</p>\n<p>With nearly 15+ significant updates and 50+ patches, Playne has made a full journey from early access to full release thanks to its wonderful community's feedback and support.</p>\n<p><em>Krish Shrikumar is a solo game dev and a BAFTA New Talent nominated filmmaker from Scotland.<br><br>* From 1,700 players who responded with feedback</em></p>", "user_ratings": {"steam_percent|decimal": 0.96, "display_user_ratings": "steam_overall", "review_text": "Overwhelmingly Positive", "steam_count": 876}, "developers": [{"developer-name": "Krish Shrikumar"}], "item_content_type": "game"}, "terraalia_thelanguagelearningrpg": {"human_name": "Terra Alia: The Language Learning RPG", "machine_name": "terraalia_thelanguagelearningrpg", "youtube_link": "rTPngVBHCRg", "callout": "Language", "publishers": [], "side_box_art_text": null, "third_party_subscribe_text": null, "min_price|money": {"currency": "USD", "amount": 10.0}, "subtitle_html": null, "description_text": "Welcome to a world where the use of magic is not so uncommon. Where powerful spells exist alongside the machines of modern day. In Terra Alia, the regulation of magic is left up to each unique nation. To be able to wield your arcane abilities, you must first learn the language of the land. <br><br>In an effort to prevent another global conflict, the nations of Terra Alia have joined together in the regulation magic within their lands. To be able to cast, you’ll have to not only speak in a country’s native tongue, but you must also think in it too in order to grow your magical abilities. <br><br>You begin your adventure in your native homeland as a recent graduate from one of Terra Alia’s most prestigious magic academies. Professor Esperanto, your old mentor, has invited you to continue your studies abroad in her exclusive technomancy program. Upon your arrival, you’ve found that the professor has gone missing! What mischievous force could be behind her disappearance? To solve this mystery, you’ll have to learn the basics of the local language and unlock your powerful magical abilities. <br><br>Terra Alia is a fun and unique way to learn and practice languages. Immerse yourself in a magical world as you learn the basics of conversation and expand your vocabulary - all while fighting dark wizards! You’ll battle against mythical beast, rouge androids and more, as you adventure through the beautifully exciting world that is Terra Alia!<br>\n<ul>\n<li>Master a vocabulary of hundreds of words in 10 different languages!</li>\n<li>Follow the clues to progress the story and unravel the mystery</li>\n<li>Solve challenging puzzles and complete all the quests</li>\n<li>Defeat your enemies with powerful spells in a dynamic turn-based combat system</li>\n<li>Level up and equip your character with increasingly more powerful abilities and items</li>\n<li>With 10 different languages and hundreds of words, you’ll become a master of your vocabulary!</li>\n<li>Complete quest lines filled with gripping stories while solving challenging puzzles!</li>\n<li>Unravel a mystery that threatens all of Terra Alia by following clues and hints.</li>\n<li>Cast powerful spells as you battle enemies in a dynamic turn-based combat system.</li>\n<li>As you explore, you’ll earn increasingly powerful abilities and rare items with each new level reached.</li>\n</ul>\n<a href=\"https://linktr.ee/terraalia\">Terra Alia Linktree</a>", "user_ratings": {"steam_percent|decimal": 0.69, "display_user_ratings": "steam_overall", "review_text": "Mixed", "steam_count": 46}, "developers": [{"developer-name": "30 Parallel", "developer-url": "https://30parallelgames.com/"}], "item_content_type": "game"}, "nanotale_typingchronicles": {"human_name": "Nanotale - Typing Chronicles", "machine_name": "nanotale_typingchronicles", "youtube_link": "Lhm0-T2u_eg", "callout": "Typing", "publishers": [{"publisher-name": "PID Publishing", "publisher-url": "https://pidgames.com/"}, {"publisher-name": "2PGames"}], "side_box_art_text": null, "third_party_subscribe_text": null, "min_price|money": {"currency": "USD", "amount": 10.0}, "subtitle_html": null, "description_text": "<i>Nanotale - Typing Chronicles</i> is an atmospheric typing adventure RPG set in a colorful vibrant world. Follow Rosalind, a novice Archivist, as she journeys out to explore a distant world. On her quest to gather knowledge, she collects samples of mystic natural beauties. Everything is peaceful. War is a thing of the distant past. <br><br>In the shadows, a tale of dissonant magic is spreading, instilling corruption into broken hearts.<strong class=\"hmb\"><br><br>Play with magic </strong> <br>Combine powerful spells, change their shapes, and enhance them to defeat enemies. Use your magic on the environment and make it resonate with your creativity.<strong class=\"hmb\"><br><br>Knowledge is power </strong> <br>As a member of the order, your role as an archivist is to gather knowledge. The more you learn about the world, the stronger you become.<strong class=\"hmb\"><br><br>Explore a rich world </strong> <br>Embark on a journey to the Ancestral Forest, discover the Blue Desert and try not to get lost in the Sunken Caves. Meet the inhabitants of these new lands, be amazed by the beauty of the flora blooming in these diverse biomes, be intrigued by the critters roaming on your path but be careful not to cross paths with the dangerous creatures looming over.<strong class=\"hmb\"><br><br>Reveal secrets </strong> <br>Step in a fascinating story with multiple faces that have left their mark on these lands. Meet people, listen to their tales, and catalog mysterious occurrences, in an attempt to unravel the secrets behind dissonant magic. <br><strong class=\"hmb\"><br>Your mightiest weapon, your keyboard </strong> <br>In Nanotale, everything is played with your keyboard. From puzzles to dialogues, combats to menus the entire game can be played solely with your favorite keyboard. All keys are re-bindable, supporting all kinds of layouts (Qwerty, Azerty, Qwertz, Dvorak, Colemak, BÉPO,...). <br><br>Enjoy the game in 11 different languages and create your own Nanotale experience. You can choose to have the tutorial and story in one language and select another one for gameplay and typable elements.", "user_ratings": {"steam_percent|decimal": 0.8, "display_user_ratings": "steam_overall", "review_text": "Very Positive", "steam_count": 431}, "developers": [{"developer-name": "Fishing Cactus", "developer-url": "http://www.fishingcactus.com/"}], "item_content_type": "game"}, "thetextorcist_thestoryofraybibbia": {"human_name": "The Textorcist: The Story of Ray Bibbia", "machine_name": "thetextorcist_thestoryofraybibbia", "youtube_link": "rvm9eI9V7OM", "callout": "Typing", "publishers": [{"publisher-name": "Headup"}], "side_box_art_text": null, "third_party_subscribe_text": null, "min_price|money": {"currency": "USD", "amount": 10.0}, "subtitle_html": null, "description_text": "Get ready for an electrifying mix between a bullet hell and a typing game! Dodge bullets while typing exorcisms at the very same time: turn on both sides of your brain and jump into the adventure of Ray Bibbia, a private exorcist who's going to face the threats of a demonic outbreak and deal with his dark and sinful past at the same time! A city in decay, streets filled with thugs, crime and censorship and only one man to stop it all. Groundbreaking gameplay, exorcists, demons, metal singers, pimps, the Pope, drama, bad jokes and tons of hardcore action-filled boss battles for the first type ‘em up game ever realized.<br/><br/><strong>A TYPING EXPERIENCE</strong>: In order to defeat the forces of evil, learn how to type your exorcisms with your keyboard or with your joypad WHILE dodging tons of bullets, dealing with puddles of barf, defusing bombs, singing at the mic of a metal show and more during intense Boss Battles: easier said than done. Hold your Bible tight, both hands needed!<br/><br/><strong>THE CITY</strong>: Rome is the theatre of our adventure, discover new locations and fight in one of the biggest metropolis in history, home of some of the craziest characters and enemies! Behind a demonic outbreak, unearthly forces are scheming to seize power and subvert the order of the the biggest religious organization in Rome: The Holy Church has reached unlimited powers over the streets of the city, but how can our protagonist be sure of their good deeds? Unravel the demonic plot aimed to overturn the order in the city and put together the pieces of the dark past behind Ray Bibbia!<br/><br/><strong>THE CAST</strong>: From Goth maids to gun-crazed gangsters and the Pope himself, Ray will get his hands dirty by exploring a great variety of  locations to solve a mystery that’s going to grow heavier as it takes shape. Who’s gonna turn out to be a friend and who’s gonna stab Ray behind his back?<br/><br/><br/>Are you a fast typer? Can you read and spell latin while you dodge bullets? THIS is the game you're looking for! Real exorcisms, english, latin and more! Avoid making mistakes and reach the highest combo! Compete with your friends by spelling the “perfect exorcism”  and compare with their scores on online leaderboards!<br/><br/><strong>Features</strong>:<br/>- An intense storytelling<br/>- Tons of bullets<br/>- Lots of typing<br/>- 10 Boss fights<br/>- Challenging twisted typing mechanics for every boss<br/>- Type even to open a door<br/>- Type on a Holyvetti computer<br/>- Show it off with online leaderboards<br/>- Play with the keyboard for a typing experience or with a gamepad for a rhythm experience<br/>- Original Soundtrack composed by GosT<br/>- Some more Bullets<br/><br/>All these features and even more, if you're a fan of shooters, a masochist, a wannabe exorcist, or you just need some black comedy in your life, don't miss The Texorcist!", "user_ratings": {"steam_percent|decimal": 0.86, "display_user_ratings": "steam_overall", "review_text": "Very Positive", "steam_count": 622}, "developers": [{"developer-name": "MorbidWare"}], "item_content_type": "game"}, "influent": {"human_name": "Influent: Definitive Edition", "machine_name": "influent", "youtube_link": "TI3jy96nwEg", "callout": "Language", "publishers": [{"publisher-name": "Three Flip Studios", "publisher-url": "https://threeflip.com/"}], "side_box_art_text": null, "third_party_subscribe_text": null, "min_price|money": {"currency": "USD", "amount": 10.0}, "subtitle_html": null, "description_text": "<p>“By immersing the player in the target language, <i>Influent</i> closely models the way we naturally learn our native language. I suggest giving <i>Influent</i> a try.” <br>- <a> Steve Hammond, Somnambulant-Gamer </a> <br><br>Inspired by Dreamcast titles of old (namely <a> Shenmue </a> and <a> Toy Commander </a> ) <i>Influent</i> immerses players in a fully interactive 3D environment where the names for absolutely every object in the game can be gleaned with a single click! In fact, even more information can be learned with a double-click! Every door, drawer, and cabinet can be opened with a right-click here and a right-click there, revealing more and more things to be learned! <br><br>Packed to the brim with hundreds of native audio pronunciations (painstakingly recorded specifically for this game), <i>Influent</i> offers players a unique opportunity to enjoy learning both vocabulary and pronunciation in the language of their choice. <br><br>With 20+ languages currently available for download, <i>Influent</i> combines the joys of playing a video game with the language learning process, resulting in real-life rewards and achievements that remain with players for the rest of their lives. <br><br><a> <i>Influent</i>: Language Learning Redefined.</a></p>\n<ul>\n<li>Audio from native speakers</li>\n<li>Synonym swap functionality</li>\n<li>Learn at your own pace!</li>\n<li>Fully interactive modern apartment</li>\n<li>Over 420 words to collect and master</li>\n<li>Includes Nouns, Adjectives, and Verbs</li>\n<li>20+ Languages to choose from (more to come!)</li>\n</ul>\n<br>\n<ul>\n<li>What is <i>Influent</i> Definitive Edition?</li>\n</ul>\n<p>This new bundle simplifies everything by including all current languages in the same package deal at a solid discount! Each of the 23 available languages were being sold individually as DLC for $10 USD each. This was getting very complicated and difficult to manage with each new language released so instead of sticking with that forever, all languages are now bundled together in one simple package, effectively getting 20 additional languages for the price of three! All existing players who purchased at least one language pack are grandfathered in. All future language pack releases are given to owners of the bundle for free.</p>\n<ul>\n<li>Do you have plans to release more languages? When???</li>\n</ul>\n<p>New Language Packs will be released as they are completed. A full list of languages that are coming soon can be found on the <a> Official Website </a> . <strong class=\"hmb\"> <br></strong><br><a> Check out the Community Hub for Frequently Asked Questions and other cool stuff! </a> <strong class=\"hmb\"> <br></strong><strong class=\"hmb\"><br>A BRIEF BACKGROUND </strong> <br><br><i>Influent</i> is a Language Learning Game focusing primarily on vocabulary acquisition and pronunciation. It was initially developed in Japan at the University of Tsukuba's <a> Entertainment Computing Laboratory </a> under the <a> Monbukagakusho Government Research Scholarship </a> . <br><br>After research funding ran out, further funding from a wildly successful <a> Kickstarter Campaign </a> allowed for the completion of the game. A research paper on the ideas surrounding the game and its applications was published by the Information Processing Society of Japan (IPSJ), which can be viewed in its entirety <a> here </a> . <br><br>Andrew Cross is infuriated! <br><br>For three long years, he sat confined to his work, developing a device that he firmly believed to be a technological breakthrough in the way people would interact with the world around them. A device that could scan any object in the real world and then provide its name in any language! Duly dubbing his fancy new invention the \"SanjigenJiten,\" Andrew arranged an appointment to demonstrate the device's amazing capabilities at the world's largest technology corporation, Technoglobe International. <br><br>But while on his visit, he fell for a girl he met in the lab, and while she stole his heart, someone else silently stepped in and stole his device! Now, Technoglobe has gone and swiftly marketed the SanjigenJiten as their own, even laying claim to the very name he had so cleverly concocted! <br><br>But Andrew Cross has a plan. He's made an even better version of his SanjigenJiten and launched an online campaign, swearing to learn 300 words in a foreign language to raise awareness of Technoglobe's blatant theft and prove his device really works! But does the SanjigenJiten really work? Can Andrew actually pull it off?!</p>", "user_ratings": {"steam_percent|decimal": 0.74, "display_user_ratings": "steam_overall", "review_text": "Mostly Positive", "steam_count": 858}, "developers": [{"developer-name": "Rob Howland"}], "item_content_type": "game"}}, "charity_data": {"charity_items": {"preventcancerfoundation": {"machine_name": "preventcancerfoundation", "youtube_link": "KZw4XKncDgo", "item_content_type": null, "subtitle_html": null, "description_text": "<em>Donations to support the Prevent Cancer Foundation&nbsp;are made to the&nbsp;<a rel=\"nofollow\" target=\"_blank\" href=\"https://support.humblebundle.com/hc/en-us/articles/205183597\">PayPal Giving Fund</a>, subject to its policies.</em><br><br>Founded in 1985, the Prevent Cancer Foundation has been a leader in cancer prevention and early detection.&nbsp; As the only nonprofit in the United States solely focused on cancer prevention and early detection, the Foundation has been referred to as \"the candle that ignited a bonfire\" in the field of prevention.&nbsp; Investing more than $138 million over the past 29 years, the Prevent Cancer Foundation has always focused its resources on cancers that can be prevented through healthy lifestyle choices or early detection.<br><br>Each year, more than 1.6 million Americans are diagnosed with cancer and more than 500,000 will die from the disease.&nbsp; However, research shows that up to 60 percent of cancer cases and more than 50 percent of cancer deaths are preventable - with the knowledge we have today.<br>The Foundation has spent the last three decades working for:<br>\n<ul>\n<li>Reducing the cancer mortality rate by focusing on individual behaviors, engaging in public policy discussions and funding on prevention and early detection research.</li>\n<li>Raising awareness of all preventable cancers across all populations.</li>\n<li>Making prevention knowledge and early detection services more accessible for people in medically underserved communities.</li>\n<li>Collaborating with partners to maximize the effectiveness and reach of the prevention and early detection programs and message.</li>\n</ul>", "human_name": "Prevent Cancer Foundation", "developers": [{"developer-name": "www.preventcancer.org", "developer-url": "http://www.PreventCancer.org"}], "publishers": [], "user_ratings": {}}}}, "from_bundle": {"machine_name": "newyearsresolutionlearnnewskillencore_bundle", "tile_short_name": "New Year, New You: Communication & Meditation", "short_marketing_blurb": "Unlock your New Year’s achievements", "marketing_blurb": "Get <em>Influent: Definitive Edition</em>, <em>PLAYNE : The Meditation Game</em>, <em>Nanotale - Typing Chronicles</em>, and more!", "detailed_marketing_blurb": "As you explore new languages with Influent—and have fun in the process—with this bundle of games designed to help you learn! Embark on a mystical quest in the typing RPG adventure <em>Nanotale: Typing Chronicles</em>. Build vocabulary and practice pronunciation as you explore the world of <em>Influent</em>. Grow a world through mindfulness in <em>PLAYNE: The Meditation Game</em>. Plus, help support Prevent Cancer Foundation with your purchase!", "author": "Publishers", "start_date|datetime": "2025-01-01T19:00:00", "end_date|datetime": "2025-01-16T02:00:00", "type": "bundle", "product_url": "/games/new-years-resolution-learn-new-skill-encore"}, "updated_at|datetime": "2025-01-02T03:04:49.349977", "first_seen_at|datetime": "2025-01-02T03:04:49.349977"}
