{"machine_name": "fellowtravellerpublisherbundle_bundle", "author": "Fellow Traveller", "basic_data": {"eula": null, "human_name": "Fellow Traveller Publisher Bundle", "detailed_marketing_blurb": "Indie games tell great stories—explore the narratively rich titles of Fellow Traveller publishing with our newest bundle! Since 2011, Fellow Travellers has championed smaller developers and their story-focused projects. Embark on an interplanetary adventure as the first robo reporter for the <em>Times & Galaxy</em>, the solar system's most trusted holopaper. Or play as a hardened captain of a polar expedition gone awry in <em>The Pale Beyond</em>. Get outstanding indie titles and help support the charity of your choice with your purchase!", "short_marketing_blurb": "Great indie games since 2011", "media_type": "game", "description": "<p><strong>Great indie games since 2011.</strong> Indie games tell great stories—explore the narratively rich titles of Fellow Traveller publishing with our newest bundle! Since 2011, Fellow Travellers has championed smaller developers and their story-focused projects. Embark on an interplanetary adventure as the first robo reporter for the <em>Times & Galaxy</em>, the solar system's most trusted holopaper. Or play as a hardened captain of a polar expedition gone awry in <em>The Pale Beyond</em>. Get outstanding indie titles and help support the charity of your choice with your purchase!</p>\n<p><strong>Pay $2 or more.</strong> Normally, the total cost for the games in this bundle is as much as $123. Here at Humble Bundle, you choose the price and increase your contribution to upgrade your bundle! This bundle has a minimum $2 purchase. Pay $2 or more to access Steam keys.</p>\n<p><strong>Redeem on Steam.</strong> All of the games in this bundle are available on Steam for Windows — and some for Mac and Linux too. Please check out the full system requirements <a href=\"https://support.humblebundle.com/hc/en-us/articles/35551403458459\">here</a> prior to purchasing.</p>\n<p><strong>Support charity.</strong> Choose where the money goes - between the developer and to support a charity of your choice. If you like what we do, you can leave us a Humble Tip too!</p>", "legal_disclaimer": null, "required_account_links": ["steam"], "end_time|datetime": "2025-04-24T01:00:00"}, "tier_item_data": {"thepalebeyond": {"human_name": "The Pale Beyond", "machine_name": "thepalebeyond", "youtube_link": "LTyaZm3E5X8", "callout": "92% Positive on Steam<br><br><span data-sheets-root=\"1\">Guide a crew of polar explorers through a frozen wasteland where every decision matters, and the ice doesn't care.</span>", "publishers": [{"publisher-name": "Fellow Traveller", "publisher-url": "https://www.fellowtraveller.games/"}], "side_box_art_text": null, "third_party_subscribe_text": null, "min_price|money": {"currency": "USD", "amount": 9.0}, "subtitle_html": null, "description_text": "Five years ago, The Viscount and its crew set sail through The Pale Passage in search of absolute magnetic South. The ship and its crew were tragically lost to the ice, never to be seen again. Her sister ship, The Temperance shall follow in her path, hoping to find answers where The Viscount failed. <br><br>A polar exploration game set in an unforgiving frozen wasteland where you embark on a treacherous voyage across the ice and through <i>the Pale Beyond</i>. It’s a stunning yet harsh landscape that can change at any moment. <br><br>Every decision matters and the ice doesn’t care. <br><br>As the expedition unfolds and the Polar Winter approaches, every decision you make will have a meaningful impact on the story as you navigate your way across the ice.<br><br>You didn’t ask to lead this expedition, but here you are. Stuck in the ice, Captain missing, miles from civilisation. Someone has to take charge. <br><br>Manage your meagre resources, balance safety and morale, make the hard calls, and head in the only direction you can - through <i>The Pale Beyond</i>.<br><br>Keeping the crew (and sled dogs) safe, fed, and warm during the expedition is imperative. Surviving the ice will matter little in the face of a mutiny. Every vote will count. So keep the crew on your side.<br><br>Featuring original musical compositions, shanties and accordion tunes that will dynamically evolve alongside your journey.", "user_ratings": {"steam_percent|decimal": 0.9, "display_user_ratings": "steam_overall", "review_text": "Very Positive", "steam_count": 1509}, "developers": [{"developer-name": "Bellular Studios", "developer-url": "https://www.twitter.com/bellularstudios"}], "item_content_type": "game"}, "pine_astoryofloss": {"human_name": "Pine: A Story Of Loss", "machine_name": "pine_astoryofloss", "youtube_link": "k7o2OHLBEVw", "callout": null, "publishers": [{"publisher-name": "Fellow Traveller", "publisher-url": "https://www.fellowtraveller.games/"}], "side_box_art_text": null, "third_party_subscribe_text": null, "min_price|money": {"currency": "USD", "amount": 9.0}, "subtitle_html": null, "description_text": "Pine is an interactive and emotional short story told wordlessly through hand-drawn animation and music, designed to be played in a single sitting. <br><br>It follows the story of a woodworker grieving the recent passing of his wife. Now alone in the glade where they made their home, he attempts to move on.<br><br>His simple daily chores of tending to his garden or collecting wood for the next winter are interrupted by memories of the happy times they spent together. Desperate not to forget her, the woodworker captures these memories in beautiful carvings out of the wood he collects. <br><br>Pine is a story-driven game focused on accessible, engaging interactions that pull you into the woodworker’s experience. Charming puzzles and mini-games celebrate the happy memories of their time together while deliberate chores underscore his challenges with moving on.<br><br>As you help the woodworker complete his daily routine, the simple chores you’ll guide him through are interrupted by reminders of his late wife. In these endearing memories you’ll relive their happiest moments together, playing games and building a life with each other.<br><br>The woodworker’s carvings are beloved mementos he captures from his memories. Pine’s unique carving mechanic lets you create the carvings with the woodworker’s hands, each a promise that his lost love will be remembered.<br><br>Classic hand-drawn animation, a beautiful setting, an evocative score and immersive environmental sound effects bring Pine’s story to life. <strong class=\"hmb\"> <br><br>ABOUT THE DEVELOPER</strong><br><br>Made Up Games is Tom Booth and Najati Imam. Lifelong gamers and longtime friends, Pine is their first narrative game. <br><br>Tom has been a professional illustrator for over a decade, previously working for Nickelodeon and Scholastic, and a published children’s book illustrator and author. His Instagram audience and their love for the woodworker are a large part of the inspiration for bringing Pine to life. <br><br>Najati’s been programming since he was a kid. In his previous professional life he’s done embedded systems programming, full stack application development, and managed engineering departments. He’s also been a hobbyist game dev for as long as he’s been able to type.", "user_ratings": {"steam_percent|decimal": 0.75, "display_user_ratings": "steam_overall", "review_text": "Mostly Positive", "steam_count": 61}, "developers": [{"developer-name": "Made Up Games", "developer-url": "https://madeupgames.com/"}], "item_content_type": "game"}, "timesandgalaxy": {"human_name": "Times & Galaxy", "machine_name": "timesandgalaxy", "youtube_link": "fOI9NHp5u28", "callout": "<p>95% Positive on Steam</p>\n<p><span style=\"color: #ef9741;\">Limited Quantites</span></p>", "publishers": [{"publisher-name": "Fellow Traveller", "publisher-url": "https://www.fellowtraveller.games/"}], "side_box_art_text": null, "third_party_subscribe_text": null, "min_price|money": {"currency": "USD", "amount": 12.0}, "subtitle_html": null, "description_text": "Congratulations, <strong> *NAME_REF!!ERROR* </strong> ! You’ve landed an internship with the Times & Galaxy, the Dorp system's favorite regional holopaper and five-time winner of the Bort Jorbeller Award for Satisfactory Interplanetary Journalism! <br><br>There’s never been a robo reporter before so don’t waste this (unpaid) opportunity. All the greats started as interns and you’ve only got seventeen cycles to prove that you belong in the newsroom.<br>We’re assigning you stories that put the <i> hyper </i> in hyper-local news! On any given cycle choose to cover shuttle crashes, intersolar cat shows, even space ghost funerals. It’s up to you! <br><br>Once you’ve chosen your assignment, head to the shuttle bay and blast off for intern adventures!! That means interviewing sources, digging up clues and investigating the scene. We hope your conversational circuits are well oiled as you earn or betray the trust of more than 100 characters and ask a lot of questions. <br><br>There’s always more than meets the eye, and the more information you can gather, the more equipped you'll be.<br>At the end of each assignment, it’s time to file your story. <br><br>Use the Build-a-Story™ tool to construct your article using all that info you gathered. Depending on who you interviewed, the choices you made and how deep you dug, you’ll have different options to work with for your story—you were a diligent reporterbot and managed to get ALL the info, weren’t you?<br><br>Your choices impact the quality and tone of the story and how both your editors and readers will react to it. Over time, the choices in each story start to shape the reputation and popularity of a holopaper. So hey, no pressure! <br><br>Designed and written by former journalists, this is almost <i> exactly </i> how real journalism is done. Except with aliens.<br>The staff at Times & Galaxy all live and work together on the Scanner, a sprawling, spacebound newsroom. <br><br>Between assignments, you’ll have the chance to get to explore the Scanner and get to know a diverse and colorful crew of more than twenty crewmates including your fellow reporters, the editorial staff, pilots and ship’s crew. <br><br>The staff come from all over the system, where you’ll find Humans, Augers, Verge, Xeel and of course, Robos. <br><br>Everyone has their own thing going on and they’ve always got something to say. They’ll react to you in all sorts of expected, and unexpected, ways depending on your choices. <br><br>The Scanner is more than just a newsroom. It’s where you sleep, eat, work and relax. <br><br>After recharging your literal batteries in your bunk you might take a moment to recharge your emotional ones in the Garden, home to many species of plants from all over the system. Or at least it used to be. Find seeds to restore the green space to its former glory! <br><br><br>As well as selecting your chassis and paint job before you arrive at the Scanner, you’ll be able to requisition upgrades from the ship’s Shuttlebots. Just watch out for the mouth on some of them. “Beep” has never sounded so aggressive.<br>Writers at Copychaser spent years working as journalists before entering the games industry and have a deep love of local journalism and the connections it creates in communities around the world. <br><br>While working on the writing teams of games like Mass Effect 3 and Dragon Age: Inquisition, they saw how players loved the relationships between characters as much as, or even more than the combat and adventure. <br><br>And so Times & Galaxy was born. We’re excited to bring you this truly unique adventure game where you can step into the metal boots of the first-ever robo reporter. Chase down leads, break system-rocking news, get quotes, make friends (or enemies), eat a dirt pie! It’s your solar system to explore, your story to tell and your job on the line, intern. <strong class=\"hmb\"> <br><br>ABOUT THE DEVELOPER </strong> <br><br>Alberta-based indie studio Copychaser Games Inc. was founded in 2017 by Ben Gelinas, a former newspaper reporter who has spent the past decade working in AAA and indie game development. <br><br>Copychaser’s specialty is unique, inclusive games with branching narratives and memorable characters. Every Copychaser game puts the player at the center of an eccentric and immersive story unlike any they’ve ever played. <br><br>In 2018, Copychaser released the death-positive, wholesome horror game Speed Dating for Ghosts (SDFG) to wide acclaim. Since then they’ve been working hard on Times & Galaxy, bringing together a bigger team of collaborators and gaining support from the Canadian Media Fund and indie label, Fellow Traveller.", "user_ratings": {}, "developers": [{"developer-name": "Copychaser Games", "developer-url": "https://www.copychaser.com/"}], "item_content_type": "game"}, "inotherwaters": {"human_name": "In Other Waters", "machine_name": "inotherwaters", "youtube_link": "IqEZlb97exk", "callout": null, "publishers": [{"publisher-name": "Fellow Traveller", "publisher-url": "https://www.fellowtraveller.games/"}], "side_box_art_text": null, "third_party_subscribe_text": null, "min_price|money": {"currency": "USD", "amount": 5.0}, "subtitle_html": null, "description_text": "<strong>A xenobiologist who discovers extraterrestrial life while searching for her missing partner. </strong> <br><br>When Ellery is called to planet Gliese 677Cc by Minae Nomura, only to arrive at an abandoned base, she finds herself adrift in an ocean of secrets, with little more than a malfunctioning diving suit and a strange AI to guide her. You are this AI. <br><br>Guide Ellery—and keep her safe—as you dive deeper and explore an underwater alien landscape. The planet’s unique life, and its dark history, are yours to uncover and the bond between you and Ellery will be tested by the secrets you learn. Through this shifting narrative, <i>In Other Waters</i> asks questions about the nature of “natural” and “artificial” life, and investigates what it means to be a human in an epoch of extreme environmental destruction. For life to continue, it must change.<br><br>Freely dive into an expansive section of seafloor, from shimmering reefs to inky depths. Unlock upgrades and make discoveries that allow you to open up new paths, uncovering strange creatures and environments as you do. <br><br>Navigate an elegant, intuitive UI via gamepad or mouse controls. Interpret signals, set headings, and map the ocean through experimentation and intuition.<br><br>Discover and catalogue species through observation, scanning, taking samples, and interacting with alien life. Read Ellery’s notes, look at her sketches, and help her classify an entirely new ecosystem. <br><br>Choose whether to study creatures, investigate secrets or dive new areas, then come back to your base to study samples in the lab, chat to Ellery or read her journals to understand more about this world. <br><br>Through limited communication learn more about the person whose suit you inhabit, and help guide her towards a terrible truth. What you experience together will bring you closer.<strong class=\"hmb\"><br><br>ABOUT THE DEVELOPER<br></strong><br>Jump Over the Age is a one-person game development studio founded by Gareth Damian Martin (they/them). Gareth is the winner of GDCA and Indiecade awards, and has been nominated for a Games Award, multiple IGF Awards, a GDC Award, and four BAFTAs. They have been named both “An accomplished world-builder” (Edge Magazine) and “one of the most exciting indie talents around” (Eurogamer).", "user_ratings": {"steam_percent|decimal": 0.89, "display_user_ratings": "steam_overall", "review_text": "Very Positive", "steam_count": 1769}, "developers": [{"developer-name": "Jump Over The Age", "developer-url": "https://jumpovertheage.com/"}], "item_content_type": "game"}, "genesisnoir": {"human_name": "Genesis Noir", "machine_name": "genesisnoir", "youtube_link": "8t4pjcDdG80", "callout": "<span data-sheets-root=\"1\">81% Positive on Steam <br><br>A love triangle between cosmic beings becomes a mission to save the love of your life.</span>", "publishers": [{"publisher-name": "Fellow Traveller", "publisher-url": "https://www.fellowtraveller.games/"}], "side_box_art_text": null, "third_party_subscribe_text": null, "min_price|money": {"currency": "USD", "amount": 5.0}, "subtitle_html": null, "description_text": "You play as No Man, a watch peddler caught in a love triangle with other cosmic beings, Miss Mass and Golden Boy. When your affair turns into a bitter confrontation, you will witness a gunshot fired by a jealous god—otherwise known as The Big Bang. Jump into the expanding universe and search for a way to prevent or destroy creation and save your love. <br><br>With a focus on tactile puzzles and exploration, you’ll experiment with objects in small slivers of the universe to discover how they can be manipulated to progress your journey. Dial a rotary phone; destroy a civilization; plant a garden; improvise with a musician; create life—all in your search for a way to save Miss Mass. <br><br>The Big Bang isn’t just the birth of creation as we know it, it's also a gun blast frozen in time, with the bullet speeding towards the love of your life. You’ll jump into pockets of time, explore moments throughout the lifespan of the universe, and search for a way to change the course of destiny. <br><br>You’ll observe moments in the history of the universe, from the first microseconds of Life to trillions of years in the future. What will you learn about these new creations, in your search to destroy them?", "user_ratings": {"steam_percent|decimal": 0.79, "display_user_ratings": "steam_overall", "review_text": "Mostly Positive", "steam_count": 1449}, "developers": [{"developer-name": "Feral Cat Den", "developer-url": "https://feralcatden.com/"}], "item_content_type": "game"}, "thestillnessofthewind": {"human_name": "The Stillness of the Wind", "machine_name": "thestillnessofthewind", "youtube_link": "fkRfjHELy_g", "callout": null, "publishers": [{"publisher-name": "Fellow Traveller", "publisher-url": "https://www.fellowtraveller.games/"}], "side_box_art_text": null, "third_party_subscribe_text": null, "min_price|money": {"currency": "USD", "amount": 2.0}, "subtitle_html": null, "description_text": "<p><strong>About the Game</strong></p>\nOne by one, everyone left the once bustling village for the city. Everyone, except Talma. Now approaching the end of her days, she maintains a simple, solitary way of life, surviving, subsisting, tending to her homestead and her goats.<br><br>Develop your own personal routine as you care for your farm and your animals. Tend to your goats, make cheese with their milk, collect eggs and cook meals, grow vegetables and barter with the travelling merchant who brings increasingly disturbing letters from your family in the city.<br><br>A follow up to the critically acclaimed Where the Goats Are, The Stillness of the Wind is a quiet rumination on life and loss. <br><br><strong>Tend to your Homestead</strong><br><br>Breed and look after your goats, make cheese from their milk, grow vegetables, water your plants, collect eggs, scare off the birds. It’s a hard but simple life of peaceful subsistence.<br><br><strong>Get news from your family<br></strong><br>The travelling merchant brings letters from your family and friends and with them a view into a city that feels both very far away and as if it threatens to wash away the world you know.<br><br><strong>Choose how your spend your days</strong><br><br>It's up to you how you spend Talma’s time each day and what your routine will be. Focus on your chores, wander in the desert, reminisce about the past or draw patterns in the dirt.<br><br><strong>Barter for supplies</strong><br><br>Trade cheese and other items in return for hay for your goats, seeds to plant, fables, exotic items and shotgun shells, whilst exchanging conversation with the travelling merchant, your only human interaction.<br><br>Where the Goats Are was Memory of God's first game. The Stillness of the Wind will be a follow up, expanding on the original concept.<br><br>- - -<br><br><i>\"While Tikvah and her goats might meet an ultimately tragic end, the fleeting, quiet moments before this asked me to appreciate the small things while I could. \"</i><br><strong>Lewis Gordon, Waypoint</strong><br><br><i>\"Where the Goats Are seems to unfold like a tableau.\"</i><br><strong>Stephanie Chan, GamesBeat</strong><br><br><i>\"I like its simplicity, and the solace that comes from designing your own daily routine.\"</i><br><strong>Samuel Horti, Rock Paper Shotgun</strong>", "user_ratings": {"steam_percent|decimal": 0.77, "display_user_ratings": "steam_overall", "review_text": "Mostly Positive", "steam_count": 1185}, "developers": [{"developer-name": "Memory of God, Lambic Studios", "developer-url": "https://lambicstudios.com/"}], "item_content_type": "game"}, "couponafterloveep20off": {"human_name": "COUPON 20% OFF Aferlove EP", "machine_name": "couponafterloveep20off", "youtube_link": "K_0Y9OMMpuY", "callout": "Exclusive Deepest Discount", "publishers": [{"publisher-name": "Fellow Traveller", "publisher-url": "https://www.fellowtraveller.games/"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 5.0}, "subtitle_html": null, "description_text": "<strong>Get 20% off&nbsp;<span>Afterlove EP</span> in the Humble Store!</strong><br><br><strong>NOTE: Expires May 7th, 2025, 6pm PT. Does not stack with Humble Store sales.</strong><br><br>Taking place in the vibrant city of Jakarta, capital of Indonesia, Afterlove EP is a blend of visual novel, narrative adventure and rhythm game elements from the creator of Coffee Talk and What Comes After.<br><br>Step into the shoes of Rama, a young musician struggling to move on with life after the death of his girlfriend, Cinta.<br><br>Whilst his close friends and bandmates are all determined to help him move on, Rama has been stuck for more than a year. He’s neglecting his music, his mental health and his relationships.<br><br>Making things harder, he’s hearing Cinta’s voice inside his head, unsure if she is a spirit or part of his imagination.<br><span><br>Rama’s band has a critical gig in one month’s time. Either he gets serious about his music and delivers the new songs he has been promising or the band will move on without him.</span><br><br><span><span>Over twenty-eight days and nights it will be your choices that determine the path Rama takes. Explore the city, choose which relationships to repair and which new ones to pursue. Come to terms with the past, rediscover your creative voice and help Rama shape a future for himself.<br><br>Discover modern day Jakarta through side-scrolling exploration, engage in deep and meaningful conversations with the characters of your choosing and jam with your band in rhythm game sections.<br><br>Part of the burgeoning Indonesian indie game development scene, Afterlove EP seeks to create an authentic window into modern urban life in Indonesia.<br><br>Set in the streets of Jakarta where several of the developers live or have lived, the game also features the distinctive, manga-inspired art of renowned Indonesian artist Soyatu and an original soundtrack from Indonesian indie band L’Alphalpha.<br><br></span></span>\n<p class=\"bb_tag\"><strong>ABOUT THE DEVELOPER</strong><br><br>No stranger to stories which tug at the heartstrings, Afterlove EP is the final project from renowned narrative designer, writer and developer, Mohammad Fahmi, who sadly passed away in March 2022 at the age of 32.<br><br><span>Pikselnesia is an Indonesian indie studio founded by Fahmi for the Afterlove EP project. After his passing, the team pledged to complete the game and bring his vision to fruition.</span><br><br><span>Fully remote, the team is spread across Indonesia and team members have worked on games including A Space for the Unbound, What Comes After and Hello Good Boy.</span></p>", "user_ratings": {}, "developers": [{"developer-name": "Pikselnesia", "developer-url": "https://x.com/pikselnesia"}], "item_content_type": "game"}, "krakenacademy": {"human_name": "Kraken Academy", "machine_name": "krakenacademy", "youtube_link": "O06f_-rIDFU", "callout": null, "publishers": [{"publisher-name": "Fellow Traveller", "publisher-url": "https://www.fellowtraveller.games/"}], "side_box_art_text": null, "third_party_subscribe_text": null, "min_price|money": {"currency": "USD", "amount": 9.0}, "subtitle_html": null, "description_text": "Kraken Academy is no ordinary high school. Ghosts fill the art department, cultists meet below the monkey bars and now crocodiles are eating children.<br><br>Join forces with a magical Kraken to save the school (and the world) from the dastardly deeds of the Traitor, a malevolent mastermind who could be anyone on the campus grounds!<br><br>While saving the world is definitely an important goal there’s a whole range of other activities to dive into. With the help of a magical amulet bestowed upon you by the Kraken, you can play with time to learn teachers’ and students’ routines, and explore every corner of the campus. Attend a costume party, become a detective, and help the school’s janitor bring down a crime syndicate.<br><br>Kraken Academy is split into four clubs: Music, Art, Sports and Drama: <br><br>🎸 Join the alternative Music Club and complete the school’s edgiest rock band. <br>🎨 Flex your creative flair in the Art Club and show off your work at an exhibition. <br>🏅 Compete in challenges to become the ultimate warrior in the Sports Club. <br>🎭 The Drama Club may be full of snobs, but if you can't beat 'em, join em! Who knows, you may even become a star in their next extravagant play. <br><br>Lucky for you, your amulet will let you join them all!<br><br>Kraken Academy is a melting pot of wacky personalities. In the Music Club alone you will meet pretty boy and lead vocalist, Vladimir, who struggles with keeping his hysterical fangirls at bay; ill-tempered bassist, Simona, always seen in her giraffe hoodie, who hates everyone (including you); and Broccoli Girl, the drummer, who just can’t get over her ex.<br><br>So come on! Grab your uniform, lunch money, magical amulet and ignore the voice in your head that says this is a terrible idea!", "user_ratings": {"steam_percent|decimal": 0.91, "display_user_ratings": "steam_overall", "review_text": "Very Positive", "steam_count": 614}, "developers": [{"developer-name": "Happy Broccoli Games", "developer-url": "https://www.happybroccoligames.com/"}], "item_content_type": "game"}, "theinvisiblehand": {"human_name": "The Invisible Hand", "machine_name": "theinvisiblehand", "youtube_link": "rjCnkHhhmGk", "callout": null, "publishers": [{"publisher-name": "Fellow Traveller", "publisher-url": "https://www.fellowtraveller.games/"}], "side_box_art_text": null, "third_party_subscribe_text": null, "min_price|money": {"currency": "USD", "amount": 2.0}, "subtitle_html": null, "description_text": "Congrats on your new job! Welcome to the first-person world of a mid-level stockbroker, as you begin your very first day at the trading firm FERIOS. You’ve probably wanted this job since you were six, right? Well, so have a lot of people… so you'll have to fight for it and prove that you're the top dog for the job! <br><br>Just remember: profit is all that matters, the rules don’t apply if you’re a winner, and only losers feel guilty for the pain, loss and poverty that are the unfortunate but unavoidable by-product of the critical and important work we do here. <br><br>It’s simple: your job is to make money for FERIOS. Buy the stocks going up, sell before they go down. Short the ones that are going to fall (or the ones you’re going to make fall). The more money you make, the bigger your commission. And you want that commission, don't you? Well don’t worry, the rewards are limitless, if you’re hungry enough.<br><br>If you’re really smart, you’ll find ways to influence the market to your advantage. Think you can lobby an influential group to affect the market? Do it. Get an opportunity to acquire majority shares to move the needle? Take it. Drive down the currency of a foreign country to improve the margins of the companies that import their products? Why not? The only consequences that matter are the ones that impact our bottom line. <br><br>Every Joe Schmo has access to the regular news. If you want to get ahead of the spikes and crashes you’ll need to find the inside line from more, shall we say, “exclusive” sources. And definitely don’t let those rumors of a financial investigation get you down. No one employed by FERIOS has ever been found guilty! <br><br>We’re one big happy team here at Ferios and nothing brings the team together like competition. So in the spirit of togetherness you better meet your daily profit targets and beat your coworkers’ results if you want to keep your job. We won’t hesitate to fire anyone who can’t or won’t do what it takes to succeed... <br><br>The fruits of success are yours for the taking. Fast cars, lavish parties, fancy apartments filled with beautiful furniture and artworks. Of course, for any truly successful trader, work is its own reward and their true home is the office so it’s a good thing you can decorate your desk with photos of all your wonderful things to remind you they exist.", "user_ratings": {"steam_percent|decimal": 0.82, "display_user_ratings": "steam_overall", "review_text": "Very Positive", "steam_count": 463}, "developers": [{"developer-name": "Power Struggle Games", "developer-url": "https://powerstruggle.games/"}], "item_content_type": "game"}}, "charity_data": {"charity_items": {}}, "from_bundle": {"machine_name": "fellowtravellerpublisherbundle_bundle", "tile_short_name": "Fellow Traveller Publisher Bundle", "short_marketing_blurb": "Great indie games since 2011", "marketing_blurb": "Get <em>Kraken Academy</em>, <em>The Pale Beyond</em>, <em>Times and Galaxy</em>, <em>The Invisible Hand</em>, and more!", "detailed_marketing_blurb": "Indie games tell great stories—explore the narratively rich titles of Fellow Traveller publishing with our newest bundle! Since 2011, Fellow Travellers has championed smaller developers and their story-focused projects. Embark on an interplanetary adventure as the first robo reporter for the <em>Times & Galaxy</em>, the solar system's most trusted holopaper. Or play as a hardened captain of a polar expedition gone awry in <em>The Pale Beyond</em>. Get outstanding indie titles and help support the charity of your choice with your purchase!", "author": "Fellow Traveller", "start_date|datetime": "2025-04-02T18:00:00", "end_date|datetime": "2025-04-24T01:00:00", "type": "bundle", "product_url": "/games/fellow-traveller-publisher-bundle"}, "updated_at|datetime": "2025-04-03T03:13:50.886314", "first_seen_at|datetime": "2025-04-03T03:13:50.886314"}
