{"machine_name": "scifishootersbundle2025_bundle", "author": "Publishers", "basic_data": {"eula": null, "human_name": "Sci-Fi Shooters 2.0", "detailed_marketing_blurb": "Heat up the dark days of winter with a scorching-hot bundle of iconic shooters! Explore the frigid unknown of deep space in the genre-defining <em>System Shock 2: 25th Anniversary Remaster</em>, infiltrate the Galactic Empire as a covert Rebel Alliance operative in <em>Star Wars: Dark Forces Remaster</em>, and send hoards of demonic forces back to their fiery homeland in <em>DOOM Eternal</em>. Grab these rockin’ remasters of legendary sci-fi shooters—and support One Tree Planted and Cool Effect with your purchase!<br><br><span style=\"color: #ef9741;\">Keys expire. Please redeem Battle Shapers, System Shock 2: 25th Anniversary Remaster, and STAR WARS: Dark Forces Remaster before August 20th, 2026. All other titles should be redeemed before February 20th, 2027.</span>", "short_marketing_blurb": "Every flavor of sci-fi shooter", "media_type": "game", "description": "<p><strong>Every flavor of sci-fi shooter.</strong> Heat up the dark days of winter with a scorching-hot bundle of iconic shooters! Explore the frigid unknown of deep space in the genre-defining <em>System Shock 2: 25th Anniversary Remaster</em>, infiltrate the Galactic Empire as a covert Rebel Alliance operative in <em>Star Wars: Dark Forces Remaster</em>, and send hoards of demonic forces back to their fiery homeland in <em>DOOM Eternal</em>. Grab these rockin’ remasters of legendary sci-fi shooters—and support One Tree Planted and Cool Effect with your purchase!</p>\n<p><strong>Pay $14 or more.</strong> Normally, the total cost for the games in this bundle is as much as $224. Here at Humble Bundle, you choose the price and increase your contribution to upgrade your bundle! This bundle has a minimum $14 purchase. Pay $14 or more to access Steam keys.</p>\n<p><strong>Redeem on Steam.</strong> All of the games in this bundle are available on Steam for Windows — and some for Linux too.&nbsp;<span style=\"font-weight: 400;\">Please review the system requirements <a href=\"https://support.humblebundle.com/hc/en-us/articles/45895919286427\">here</a> prior to purchasing.</span><br><br><span style=\"color: #ef9741;\">Keys expire. Please redeem Battle Shapers, System Shock 2: 25th Anniversary Remaster, and STAR WARS: Dark Forces Remaster before August 20th, 2026. All other titles should be redeemed before February 20th, 2027.</span></p>\n<p><strong>Support charity.</strong> Choose where the money goes - between the publishers and to support One Tree Planted and Cool Effect. If you like what we do, you can leave us a Humble Tip too!</p>", "legal_disclaimer": null, "required_account_links": ["steam"], "end_time|datetime": "2026-02-24T02:00:00"}, "tier_item_data": {"battleshapers": {"human_name": "Battle Shapers", "machine_name": "battleshapers", "youtube_link": "2DuU1Od3G0I", "callout": "", "publishers": [{"publisher-name": "Kepler Ghost", "publisher-url": "https://kepler-interactive.com/kepler-ghost"}], "side_box_art_text": null, "third_party_subscribe_text": null, "min_price|money": {"currency": "USD", "amount": 14.0}, "subtitle_html": null, "description_text": "<div>\n<h2><span style=\"font-size: medium;\">About This Game</span></h2>\n</div>\n<div>\n<ul>\n<li>You play as Ada, a reactivated Shaper tasked with reclaiming New Elysium from the cunning Overlords and their corrupted robots. Using advanced weapons and unique abilities, you will shoot &amp; smash your way through dangerous towers and defeat the Overlords to put an end to their corruption of the city.</li>\n</ul>\n</div>\n<div>\n<h2><span style=\"font-size: medium;\">Fight Laser With laser</span></h2>\n<ul>\n<li>Gun down hordes of enemy machines with relentless and punishing close-range combat in which every bot destroyed makes you stronger.</li>\n<li>Face the Overlords and adapt to their evolving powers and tactics by mastering highly customizable weapons, movement, and combat abilities.</li>\n</ul>\n</div>\n<div>\n<h2><span style=\"font-size: medium;\">Build Your 'Core' Strength</span></h2>\n<div>\n<ul>\n<li>Steal the Overlords’ Cores and harness their powers to craft and transform both your playstyle and appearance.</li>\n<li>Unlock new weapons, abilities and talents to permanently increase your survivability and maximize your combat potential with every run.</li>\n</ul>\n<div><b>Combat Is Only Half The Battle</b></div>\n<div>\n<ul>\n<li>Deploy your own traps, power-ups and hacks in each Overlord’s tower to turn the tides of battle in your favor.</li>\n<li>Explore vibrant nostalgia-inspired locations to discover hidden upgrades and weapons throughout.</li>\n<li>Be warned! Just as you grow stronger by defeating Overlords, the journey ahead will also become more challenging.</li>\n</ul>\n</div>\n</div>\n</div>\n<div><b>Fearless Shredding</b></div>\n<div>\n<ul>\n<li>Defy the Overlords and save the city to the might of adrenaline-pumping rock music that will have you diving head-on and fist-first into action.</li>\n</ul>\n</div>", "user_ratings": {"steam_percent|decimal": 0.81, "display_user_ratings": "steam_overall", "review_text": "Very Positive", "steam_count": 844}, "developers": [{"developer-name": "Metric Empire", "developer-url": "https://www.metricempire.com/"}], "item_content_type": "game"}, "blackmesa": {"human_name": "Black Mesa", "machine_name": "blackmesa", "youtube_link": "MTB_TaHxVUo", "callout": null, "publishers": [], "side_box_art_text": null, "third_party_subscribe_text": null, "min_price|money": {"currency": "USD", "amount": 14.0}, "subtitle_html": null, "description_text": "<strong class=\"hmb\">Relive Half-Life </strong> <br><strong> <i>Black Mesa</i> </strong> is the fan-made reimagining of Valve Software’s <strong> Half-Life</strong>.<strong class=\"hmb\"><br><br><i>Black Mesa</i>: Definitive Edition </strong> <br>Update 1.5 brings together all the improvements to graphics and gameplay across 15 years of development to create the final version of <i>Black Mesa</i>. There has never been a better time to pick up the crowbar and play!<strong class=\"hmb\"><br><br>Single Player Campaign </strong> <br>You are Gordon Freeman, a theoretical physicist at the <i>Black Mesa</i> Research Facility. When a routine experiment goes horribly wrong, you must fight your way through an interdimensional alien invasion, and a bloodthirsty military clean-up crew in order to save the science team... and the world!<strong class=\"hmb\"><br><br>Features </strong> <br>\n<ul>\n<li><strong> A completely reimagined and refined single player campaign, including all new and expanded Xen levels </strong></li>\n<li>19 chapters of fighting through top-secret labs, running atop harsh desert landscapes, sneaking into abandoned railways, and leaping across dimensions</li>\n<li>Mind-Blowing graphics and effects, never before seen on the Source Engine</li>\n<li>Face off against an army of classic enemies, updated with new features and engaging AI</li>\n<li>Wield an arsenal of military hardware, scientific prototypes, and the iconic crowbar through incredibly detailed environments</li>\n<li>The all-new soundtrack and voice acting create a more immersive experience than ever before</li>\n<li>50 Fun and challenging achievements</li>\n</ul>\n<strong class=\"hmb\">Multiplayer </strong> <br>Frag your friends across <strong> 10 </strong> iconic maps from the Half-Life universe, including: <br>\n<ul>\n<li>Bounce</li>\n<li>Gasworks</li>\n<li>Stalkyard</li>\n<li>Undertow</li>\n<li>Crossfire</li>\n</ul>\n<strong class=\"hmb\">Workshop </strong> <br>Create your own mods, models, and maps with the <strong> <i>Black Mesa</i> </strong> Source SDK, then share it with the community on the Steam Workshop.<strong class=\"hmb\"><br><br>Steamworks </strong> <br>Collect the full set of trading cards, backgrounds, emoticons, and achievements! Featuring Steam Cloud, Steam Workshop, closed captions in multiple languages and full controller support.", "user_ratings": {"steam_percent|decimal": 0.95, "display_user_ratings": "steam_overall", "review_text": "Overwhelmingly Positive", "steam_count": 93180}, "developers": [{"developer-name": "Crowbar Collective", "developer-url": "https://www.crowbarcollective.com/"}], "item_content_type": "game"}, "cooleffect": {"human_name": "Cool Effect", "machine_name": "cooleffect", "youtube_link": null, "callout": null, "publishers": [], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "subtitle_html": null, "description_text": "<p><em>Donations to support Cool Effect are made to &nbsp;<a href=\"https://support.humblebundle.com/hc/en-us/articles/205183597\" target=\"_blank\" rel=\"noopener\">PayPal Giving Fund</a>, subject to its policies.<br></em></p>\n<p><span><span style=\"font-weight: 400;\">Cool Effect is creating a community built around one simple vision: give people the power and confidence to band together and reduce the carbon pollution that causes climate change.</span></span></p>", "user_ratings": {}, "developers": [{"developer-name": "cooleffect.org", "developer-url": "https://www.cooleffect.org/"}], "item_content_type": null}, "onetreeplanted": {"human_name": "One Tree Planted", "machine_name": "onetreeplanted", "youtube_link": null, "callout": null, "publishers": [], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "subtitle_html": null, "description_text": "<p><em>Donations to support One Tree Planted are made to &nbsp;<a href=\"https://support.humblebundle.com/hc/en-us/articles/205183597\" target=\"_blank\" rel=\"noopener\">PayPal Giving Fund</a>, subject to its policies.</em><br>&nbsp;<br>We are a non-profit focused on global reforestation. Every dollar donated plants one tree.</p>\n<p>&nbsp;</p>", "user_ratings": {}, "developers": [{"developer-name": "onetreeplanted.org/", "developer-url": "https://onetreeplanted.org/"}], "item_content_type": null}, "doom_eternal": {"human_name": "DOOM Eternal", "machine_name": "doom_eternal", "youtube_link": "1sCCxIc1UMY", "callout": null, "publishers": [{"publisher-name": "Bethesda Softworks", "publisher-url": "https://bethesda.net/"}], "side_box_art_text": null, "third_party_subscribe_text": null, "min_price|money": {"currency": "USD", "amount": 14.0}, "subtitle_html": null, "description_text": "<html>\n <head>\n </head>\n <body>\n  Hell’s armies have invaded Earth. Become the Slayer in an epic single-player campaign to conquer demons across dimensions and stop the final destruction of humanity.\n  <strong class=\"hmb\">\n   <br>\n   <br>\n   The Only Thing they Fear... Is You.\n  </strong>\n  <br>\n  <br>\n  Experience the ultimate combination of speed and power in DOOM Eternal - the next leap in push-forward, first-person combat.\n  <strong class=\"hmb\">\n   <br>\n   <br>\n   Slayer Threat Level At Maximum\n  </strong>\n  <br>\n  Armed with a shoulder-mounted flamethrower, retractable wrist-mounted blade, upgraded guns and mods, and abilities, you're faster, stronger, and more versatile than ever.\n  <strong class=\"hmb\">\n   <br>\n   <br>\n   Unholy Trinity\n  </strong>\n  <br>\n  Take what you need from your enemies: Glory kill for extra health, incinerate for armor, and chainsaw demons to stock up on ammo to become the ultimate demon-slayer.\n  <strong class=\"hmb\">\n   <br>\n   <br>\n   Enter Battlemode\n  </strong>\n  <br>\n  A new 2 versus 1 multiplayer experience. A fully-armed DOOM Slayer faces off against two player-controlled demons, fighting it out in a best-of-five round match of intense first-person combat.\n </body>\n</html>", "user_ratings": {"steam_percent|decimal": 0.91, "display_user_ratings": "steam_overall", "review_text": "Very Positive", "steam_count": 118860}, "developers": [{"developer-name": "id Software", "developer-url": "https://www.idsoftware.com/"}], "item_content_type": "game"}, "systemshock2_25thanniversaryremaster": {"human_name": "System Shock 2: 25th Anniversary Remaster", "machine_name": "systemshock2_25thanniversaryremaster", "youtube_link": "NiPU7mQ_dnk", "callout": null, "publishers": [], "side_box_art_text": null, "third_party_subscribe_text": null, "min_price|money": {"currency": "USD", "amount": 20.0}, "subtitle_html": null, "description_text": "System Shock® 2: 25th Anniversary Remaster by Nightdive Studios brings to you the modernized remaster of the FPS/RPG classic.\n<p>It’s the year 2114 and as you awake from cryo sleep on the FTL ship Von Braun, you are unable to remember who or where you are… and something has gone terribly wrong. Hybrid mutants and deadly robots roam the halls while the cries from the remaining crew reverberate through the cold hull of the ship. SHODAN, a rogue AI bent on the destruction of mankind has taken over and it's up to you to stop her.<br><br>Delve through the corridors of the derelict ship Von Braun and immerse yourself in the story rich atmosphere and environments. Explore deck by deck and unravel the horrifying fate of the Von Braun and her crew.</p>\n<p>Choose from 3 branches of the Military; O.S.A, Marines or Navy and experiment with different play styles.</p>\n<ul>\n<li>\n<p>Additional Mod Support</p>\n</li>\n<li>\n<p>Up to 144FPS performance with ultra-widescreen support.</p>\n</li>\n<li>\n<p>50 Achievements to unlock.</p>\n</li>\n<li>\n<p>Enhanced Characters, Weapon Models and Animations.</p>\n</li>\n<li>\n<p>Optimized Controller support.</p>\n</li>\n<li>\n<p>Quality of Life Improvements.</p>\n</li>\n</ul>", "user_ratings": {"steam_percent|decimal": 0.87, "display_user_ratings": "steam_overall", "review_text": "Very Positive", "steam_count": 1550}, "developers": [{"developer-name": "Nightdive Studios", "developer-url": "https://nightdivestudios.com/"}, {"developer-name": "Looking Glass Studios"}, {"developer-name": "Irrational Games"}], "item_content_type": "game"}, "prey_deluxe": {"human_name": "Prey Digital Deluxe Edition", "machine_name": "prey_deluxe", "youtube_link": "1hKTZGflqrc", "callout": null, "publishers": [{"publisher-name": "Bethesda Softworks", "publisher-url": "https://bethesda.net/"}], "side_box_art_text": null, "third_party_subscribe_text": null, "min_price|money": {"currency": "USD", "amount": 14.0}, "subtitle_html": null, "description_text": "<em><strong>Prey Digital Deluxe</strong></em> includes both Prey and the brand-new expansion, Prey: Mooncrash.<br><br><strong>About the Game</strong><br><br>Fight overwhelming odds to escape a secret TranStar moon base where the enemies you encounter, the hazards you face, the goals you complete, and the loot you collect are different each time you play. With changing environments as dangerous as they are dynamic, the Mooncrash campaign for Prey will offer a fun, infinitely replayable challenge to test even the most skilled players.<br><br><strong>Story:</strong><br><br>In Prey: Mooncrash, TranStar’s secret moon base stopped transmitting shortly after the events of Prey. Now Peter, a hacker stationed aboard a spy satellite tasked with intercepting TranStar communications, must find out why. Trapped and under a ruthless contract with KASMA Corp, Peter’s only hope of ever seeing his family again is uncovering the moon base’s lost secrets.<strong>Features:</strong><br><strong><br>Live. Die. Adapt. Escape!</strong><br><br>Escape TranStar’s moon base before the Typhon threat takes over. A simple goal, but one with hundreds of viable solutions. In Mooncrash, players will experience an all-new, infinitely replayable, ‘rogue-lite’ campaign with ever-changing enemies, weapons and objectives against a constantly increasing alien threat.<br><strong><br>Survive How You Want with Who You Want</strong><br><br>Unlock multiple characters as you play, each with their own set of specialized, upgradable skills. Will you forge your path with the resourceful engineer Joan, trade that wrench in for Security Officer Bhatia and his shotgun, or will you choose the frail-but-gifted Andrius and his arsenal of psychic abilities? Prey is about choices, and those choices belong to you.<br><strong><br>Search for Secrets, Loot…and a Way Off </strong><br><br>Arkane Studios’ talent for detail and story-rich environments comes alive in Mooncrash. As you explore the station, which is the same size and scope of four levels of the original game’s Talos I station, don’t forget to keep your eyes peeled for precious supplies – and, of course, Mimics.<br><strong><br>New Challenges, New Solutions</strong><br><br>The Typhon threat has returned with familiar foes and tough new enemies, each armed with a unique set of deadly characteristics. Use the full power of the arsenal at your disposal, including popular weapons and abilities from Prey’s main game, to fight for your life and make a mad dash for your escape.<br><strong><br>Prey: Typhon Hunter</strong><br><br>Mooncrash also includes the upcoming Typhon Hunter multiplayer update, a tense game of hide and seek between a single survivor and five other players who stalk, hunt, and hide in plain sight as mimics. Typhon Hunter update is expected to release later this summer on all platforms.", "user_ratings": {"steam_percent|decimal": 0.91, "display_user_ratings": "steam_overall", "review_text": "Mostly Positive", "steam_count": 21446}, "developers": [{"developer-name": "Arkane Studios", "developer-url": "https://www.arkane-studios.com/en"}], "item_content_type": "game"}, "starshiptroopers_extermination": {"human_name": "Starship Troopers: Extermination", "machine_name": "starshiptroopers_extermination", "youtube_link": "65gafHz6N9c", "callout": "", "publishers": [], "side_box_art_text": null, "third_party_subscribe_text": null, "min_price|money": {"currency": "USD", "amount": 20.0}, "subtitle_html": null, "description_text": "<strong><i>Starship Troopers: Extermination</i> </strong> is a pulse-pounding co-op first-person shooter. Join the Deep Space Vanguard, an elite Special Forces branch of the Mobile Infantry, in the fight against the Bug menace and claim victory for humanity! <br><br>Your trusty Morita Assault Rifle, support tools, and fellow Vanguard Troopers are all that will keep you alive while exploring the hostile surface of these ugly planets, these… Bug planets. <br><br><strong> Would You Like to Know More? </strong> <br><strong class=\"hmb\"><br>THE WAR EFFORT NEEDS YOUR EFFORT! </strong> <br>Retake and rebuild bases, construct refineries, and complete a variety of other side objectives to wrest control of the planet away from the Bug menace. Massive, detailed maps with several unique zones add to the incredible replayability, and swarm-based combat with hundreds of enemy Bugs on screen delivers the sense of taking part in an overwhelming planetary struggle! <br><strong class=\"hmb\"><br>WELCOME TO THE NEW VANGUARD </strong> <br>Choose from six different classes to best suit your playstyle and support the rest of your squad. From the assault-ready Ranger and Sniper to the devastating Demolisher and life-saving Medic, the Deep Space Vanguard has a place for all types of players. As you progress in each class, you’ll unlock new weapons, equipment, and perks as well as cosmetic options to help you look the part of an elite warfighter! <br><strong class=\"hmb\"><br>THE ONLY GOOD BUG... </strong> <br>Increasing Bug threat levels bring bigger and more dangerous enemies to the fight, and you’re going to need to hunker down to stand a chance. Construct walls, towers, ammo stations, and more to beat back the Bugs until Fleet can come and get you. You’ll encounter Drone, Warrior, Gunner, Plasma Grenadier, and so many more Arachnid bastards! Keep your eye out for that Tiger Elite… <br><strong class=\"hmb\"><br>DO YOU HAVE WHAT IT TAKES? </strong>", "user_ratings": {"steam_percent|decimal": 0.85, "display_user_ratings": "steam_overall", "review_text": "Very Positive", "steam_count": 25832}, "developers": [{"developer-name": "Offworld", "developer-url": "https://www.offworldindustries.com/"}], "item_content_type": "game"}, "starwars_darkforcesremaster": {"human_name": "STAR WARS™: Dark Forces Remaster", "machine_name": "starwars_darkforcesremaster", "youtube_link": "MjJRd5VnwAo", "callout": null, "publishers": [], "side_box_art_text": null, "third_party_subscribe_text": null, "min_price|money": {"currency": "USD", "amount": 20.0}, "subtitle_html": null, "description_text": "<i>Star Wars </i> ™: Dark Forces Remaster has been brought to life by the team at <strong> Nightdive Studios </strong> , fully remastered through its proprietary KEX engine, allowing the game to run on modern gaming devices at up to 4K resolution at 120FPS. New and returning players will enjoy <i> Star Wars </i> : Dark Forces Remaster’s upgraded gameplay, high-resolution textures, enhanced lighting and rendering, and support for gamepads. <br><br>The original 1995 <i> Star Wars </i> : Dark Forces raised the bar for FPS games, offering players a significant degree of movement and interactivity, a large selection of items and power-ups, and engaging environments.<br><br>In the first <i> Star Wars </i> FPS video game, players assume the role of Kyle Katarn, a defector of the Galactic Empire turned mercenary for hire. Katarn joins the Rebel Alliance’s covert operations division tasked with infiltrating the Galactic Empire, where he discovers the secret Dark Trooper Project. The development of this powerful new series of Imperial battle droids and power-armored stormtroopers stands to strengthen the Empire’s grip on the galaxy unless Katarn and the Rebel Alliance intervene. <strong class=\"hmb\"> <br><br>Key Features: </strong> <br><br>\n<ul>\n<li>All fourteen original levels, featuring <i> Star Wars </i> ™ worlds and capital ships</li>\n<li>Use your ability to jump, duck, and crawl to solve puzzles and defeat enemies</li>\n<li>Your Personal Digital Assistant provides you with in game information such including map, inventory, and mission briefing</li>\n<li>Engaging first-person ground combat featuring ten weapons and twenty types of enemies</li>\n<li>Up to 4K 120FPS visuals</li>\n<li>Advanced 3D rendering enables updated lighting and atmospheric effects</li>\n<li>Modern gamepad support adds a new weapon wheel, and rumble</li>\n<li>Controller Support - vibration and gyro controls</li>\n<li>A variety of power-ups are made available to the player, including health, shields, weapons and ammunition</li>\n<li>For combat, the player may use fists, explosive landmines and thermal detonators, as well as blasters and other ranged weapons</li>\n<li>Includes immersive environmental puzzles and mazes</li>\n</ul>", "user_ratings": {"steam_percent|decimal": 0.9, "display_user_ratings": "steam_overall", "review_text": "Very Positive", "steam_count": 1100}, "developers": [{"developer-name": "Nightdive Studios", "developer-url": "https://www.nightdivestudios.com/"}, {"developer-name": "LucasArts", "developer-url": "https://www.lucasfilm.com/what-we-do/games/"}], "item_content_type": "game"}}, "charity_data": {"charity_items": {"cooleffect": {"machine_name": "cooleffect", "youtube_link": null, "item_content_type": null, "subtitle_html": null, "description_text": "<p><em>Donations to support Cool Effect are made to &nbsp;<a href=\"https://support.humblebundle.com/hc/en-us/articles/205183597\" target=\"_blank\" rel=\"noopener\">PayPal Giving Fund</a>, subject to its policies.<br></em></p>\n<p><span><span style=\"font-weight: 400;\">Cool Effect is creating a community built around one simple vision: give people the power and confidence to band together and reduce the carbon pollution that causes climate change.</span></span></p>", "human_name": "Cool Effect", "developers": [{"developer-name": "cooleffect.org", "developer-url": "https://www.cooleffect.org/"}], "publishers": [], "user_ratings": {}}, "onetreeplanted": {"machine_name": "onetreeplanted", "youtube_link": null, "item_content_type": null, "subtitle_html": null, "description_text": "<p><em>Donations to support One Tree Planted are made to &nbsp;<a href=\"https://support.humblebundle.com/hc/en-us/articles/205183597\" target=\"_blank\" rel=\"noopener\">PayPal Giving Fund</a>, subject to its policies.</em><br>&nbsp;<br>We are a non-profit focused on global reforestation. Every dollar donated plants one tree.</p>\n<p>&nbsp;</p>", "human_name": "One Tree Planted", "developers": [{"developer-name": "onetreeplanted.org/", "developer-url": "https://onetreeplanted.org/"}], "publishers": [], "user_ratings": {}}}}, "from_bundle": {"machine_name": "scifishootersbundle2025_bundle", "tile_short_name": "Sci-Fi Shooters 2.0", "short_marketing_blurb": "Every flavor of sci-fi shooter", "marketing_blurb": "Get <em>Black Mesa</em>, <em>Doom Eternal</em>, <em>Prey Digital Deluxe</em>, <em>STAR WARS: Dark Forces Remaster</em>, <em>Starship Troopers: Extermination</em>, <em>System Shock 2: 25th Anniversary Remaster</em>, and more!", "detailed_marketing_blurb": "Heat up the dark days of winter with a scorching-hot bundle of iconic shooters! Explore the frigid unknown of deep space in the genre-defining <em>System Shock 2: 25th Anniversary Remaster</em>, infiltrate the Galactic Empire as a covert Rebel Alliance operative in <em>Star Wars: Dark Forces Remaster</em>, and send hoards of demonic forces back to their fiery homeland in <em>DOOM Eternal</em>. Grab these rockin’ remasters of legendary sci-fi shooters—and support One Tree Planted and Cool Effect with your purchase!<br><br><span style=\"color: #ef9741;\">Keys expire. Please redeem Battle Shapers, System Shock 2: 25th Anniversary Remaster, and STAR WARS: Dark Forces Remaster before August 20th, 2026. All other titles should be redeemed before February 20th, 2027.</span>", "author": "Publishers", "start_date|datetime": "2026-02-02T19:00:00", "end_date|datetime": "2026-02-24T02:00:00", "type": "bundle", "product_url": "/games/scifi-shooters-bundle-2026"}, "updated_at|datetime": "2026-02-03T03:46:39.814157", "first_seen_at|datetime": "2026-02-03T03:46:39.814157"}
{"machine_name": "learngodotin2026completecoursebundle_softwarebundle", "author": "Zenva Pty Ltd", "basic_data": {"eula": null, "human_name": "Learn Godot in 2026 Complete Course Bundle", "detailed_marketing_blurb": "Are you curious about game creation? Learn to harness the power of Godot, the ultimate open-source creation engine, with our 2026 Complete Course Bundle! Pay what you want to access professional-quality game creation courses like <em>Metroidvania with Godot - Unit 1 - Platformer Basics</em>, <em>Monster Collector in Godot - Unit 1 - Overworld</em>, and more, all for a low price you choose. Make the most out of Godot and build any genre game you want—plus—a portion of your purchase helps support code.org!", "short_marketing_blurb": "Learn Godot and help others", "media_type": "software", "description": "<p><strong>Learn Godot and help others.</strong> Are you curious about game creation? Learn to harness the power of Godot, the ultimate open-source creation engine, with our 2026 Complete Course Bundle! Pay what you want to access professional-quality game creation courses like <em>Metroidvania with Godot - Unit 1 - Platformer Basics</em>, <em>Monster Collector in Godot - Unit 1 - Overworld</em>, and more, all for a low price you choose. Make the most out of Godot and build any genre game you want—plus—a portion of your purchase helps support code.org!</p>\n<p><strong>Pay $1 or more.</strong> Normally, the total cost for the software in this bundle is as much as $1,500. Here at Humble Bundle, you choose the price and increase your contribution to upgrade your bundle! This bundle has a minimum $1 purchase. Pay $1 or more to access keys.</p>\n<p><strong>Redeem your keys.</strong> Keys redeemable on the Zenva <a href=\"https://academy.zenva.com/\">website</a>.</p>\n<p><strong>Support charity.</strong> Choose where the money goes - between the publisher and to support code.org. If you like what we do, you can leave us a Humble Tip too!</p>", "legal_disclaimer": null, "required_account_links": ["steam"], "end_time|datetime": "2026-02-23T19:00:00"}, "tier_item_data": {"introtopixelartwithphotoshop": {"human_name": "Intro to Pixel Art with Photoshop", "machine_name": "introtopixelartwithphotoshop", "youtube_link": "ykqeL_O93hY", "callout": "<div class=\"accolades\">MSRP: $50</div>", "publishers": [], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Create your own pixel art assets from scratch using Photoshop!</p> <p>Pixel art has been a popular art style since the very first video games - and remains popular for modern games as well. By exploring key features offered by Photoshop, you'll master fundamental techniques for creating pixel art characters, spritesheets, animation sheets, and more. The skills learned here with Photoshop can be adapted in numerous ways to suit your needs - no matter what kind of pixel art game you're making.</p> <strong>You will learn how to:</strong> <ul> <li>Use Photoshop's pencil and eraser tools</li> <li>Enhance productivity with layers and swatches</li> <li>Set up spritesheets with multiple tile sprites</li> <li>Paint pixel art characters and backgrounds</li> <li>Make sheets for sprite animation</li> <li>Export art files for future use</li></ul>", "user_ratings": {}, "developers": [{"developer-name": "Zenva", "developer-url": "https://academy.zenva.com/product/intro-to-pixel-art-with-photoshop/"}], "item_content_type": "software"}, "practicalpixelarttechniquesinphotoshop": {"human_name": "Practical Pixel Art Techniques in Photoshop", "machine_name": "practicalpixelarttechniquesinphotoshop", "youtube_link": "ez82g2BRQ4M", "callout": "MSRP: $50 </br>Game Artwork", "publishers": [], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Master a variety of useful pixel art techniques for custom assets!</p> <p>Pixel art remains a steadfast art style to use in games, and is particularly popular in the indie sector. In this Photoshop course, you'll explore shading, color palettes, animation sprites, different materials &amp; objects, and more - all while practically applying them to several projects. By the end, you'll have learned several key techniques for customizing your 2D project's aesthetics with pixel art.</p> <p>This course assumes basic familiarity with Photoshop.</p> <strong>You will learn how to:</strong> <ul> <li>Select and apply character color palettes</li> <li>Deal with walk cycle animation sprites</li> <li>Mimic motion blur with trails</li> <li>Craft tilemap-ready tilesets</li> <li>Shade different organic materials</li> <li>Apply material-appropriate highlights to metallic objects</li> </ul> <p>... and more!</p>", "user_ratings": {}, "developers": [{"developer-name": "Zenva", "developer-url": "https://academy.zenva.com/product/learn-practical-pixel-art-techniques-in-photoshop/"}], "item_content_type": "software"}, "introtouianduxdesign": {"human_name": "Intro to UI/UX Design", "machine_name": "introtouianduxdesign", "youtube_link": "hKe4ndz6ecg", "callout": "<div class=\"accolades\">HB Exclusive</div>", "publishers": [], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Explore the foundations of UI and UX design!</p> <p>The user interface (UI) and user experience (UX) have critical impacts on the usability of your projects - and can make or break its user appeal. In this course, you'll learn design methodologies for developing a UI/UX for a movie rating app while exploring audience targeting, iterative design, and wireframing. These skills will enable you to fine-tune your UI-design process and apply purposeful decisions to get the most optimal UX!</p> <p>No experience is needed to dive into this course.</p> <strong>You will learn how to:</strong> <ul> <li>Define projects with user stories</li> <li>Create UIs with wireframes</li> <li>Communicate navigation via wireframing</li> <li>Consider user viewpoints for UX</li> <li>Iterate designs via testing</li> <li>Understand the full design process</li> </ul> <p>... and more!</p>", "user_ratings": {}, "developers": [{"developer-name": "Zenva", "developer-url": "https://academy.zenva.com/product/intro-to-ui-ux-design/"}], "item_content_type": "software"}, "exploremicro-survivalgameswithgodot4": {"human_name": "Explore Micro-Survival Games with Godot 4", "machine_name": "exploremicro-survivalgameswithgodot4", "youtube_link": "Ifg5Ay8N74c", "callout": null, "publishers": [], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Learn to make survival game systems with Godot 4!</p> <p>Survival games remain a top genre thanks to their action gameplay and wide variety of artistic expression. You'll master core systems for setting up survival game players and environments to jump-start your projects. These skills will provide you the foundation from which to expand your survival games into whatever you want - regardless of where your game is set.</p> <p>Basic skills in Godot and GDScript are needed to take this course.</p> <strong>You will learn how to:</strong> <ul> <li>Create a 3D environment</li> <li>Set up player movement</li> <li>Script a first-person camera</li> <li>Make a day-night cycle</li> <li>Give players \"needs\" to manage</li> <li>Craft modular UI nodes</li> </ul> <p>... and more!</p>", "user_ratings": {}, "developers": [{"developer-name": "Zenva", "developer-url": "https://academy.zenva.com/product/explore-micro-survival-games-with-godot-4/"}], "item_content_type": "software"}, "2dactionrpgingodot_unit1_playerandenemies": {"human_name": "2D Action RPG in Godot - Unit 1 - Player & Enemies", "machine_name": "2dactionrpgingodot_unit1_playerandenemies", "youtube_link": "dIMiXMIpGy0", "callout": "<div class=\"accolades\">First Time HB Exclusive</div>", "publishers": [], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Build the complete foundation for your own 2D action RPG in Godot!</p><p>Action RPGs form the backbone of countless top-selling games, challenging developers to blend character control, AI, combat, and immersive worlds into seamless experiences. In this course, you’ll harness the power of Godot to create the core of a 2D action RPG featuring player and enemy characters, modular weapon systems, audio, and your own dungeon testbed. By mastering these essentials, you’ll unlock the skills to take on larger action RPG projects.</p><strong>You’ll learn how to:</strong><ul><li>Create animated characters</li><li>Develop interchangeable melee and ranged weapons</li><li>Display dynamic health bars for characters</li><li>Implement an audio manager using autoloads</li><li>Build a basic dungeon level</li><li>Apply object-oriented and modular design</li></ul><p>... and more!</p>", "user_ratings": {}, "developers": [{"developer-name": "Zenva", "developer-url": "https://academy.zenva.com/product/2d-action-rpg-player-course/"}], "item_content_type": "software"}, "code_org": {"human_name": "Code.org", "machine_name": "code_org", "youtube_link": "rH7AjDMz_dc", "callout": null, "publishers": [], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "subtitle_html": null, "description_text": "<em>Donations to support&nbsp;Code.org are made to the&nbsp;<a rel=\"nofollow\" target=\"_blank\" href=\"https://support.humblebundle.com/hc/en-us/articles/205183597\" title=\"Link: https://support.humblebundle.com/hc/en-us/articles/205183597\">PayPal Giving Fund</a>, subject to its policies.</em><br><br>Launched in 2013, <a rel=\"nofollow\" target=\"_blank\" href=\"http://code.org\" title=\"Link: http://code.org\">Code.org</a>® is a non-profit dedicated to expanding participation in computer science by making it available in more schools, and increasing participation by women and underrepresented students of color. <a rel=\"nofollow\" target=\"_blank\" href=\"http://code.org\">Code.org</a>'s comprehensive approach represents the vanguard of effective integration of Computer Science (CS) into the core of public school education. Our vision is that every student in every school should have the opportunity to learn computer science. We believe computer science and computer programming should be part of the core curriculum in education, alongside other science, technology, engineering, and mathematics (STEM) courses, such as biology, physics, chemistry and algebra.", "user_ratings": {}, "developers": [{"developer-name": "Code.org", "developer-url": "http://code.org"}], "item_content_type": null}, "completelocalmultiplayeringodotcourse": {"human_name": "The Complete Local Multiplayer in Godot Course", "machine_name": "completelocalmultiplayeringodotcourse", "youtube_link": "YSqyhO8_7-U", "callout": "<div class=\"accolades\">HB Exclusive</div>", "publishers": [], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Create a local multiplayer game in Godot!</p> <p>Local multiplayer is a fantastic game feature that can easily improve your game's replay value - simply by letting players compete against each other. Through this course, you'll build a 2D third-person shooter in Godot from start to finish while learning how to design and code the project so it is multiplayer-ready. These techniques will allow you to add local multiplayer features to just about any Godot project and improve your game development skills overall.</p> <p>A solid understanding of Godot and GDScript is needed for this course.</p> <strong>You will learn how to:</strong> <ul> <li>Work with tilemaps and UIs</li> <li>Set up animated players</li> <li>Create shooting mechanics</li> <li>Implement multiplayer in two ways</li> <li>Build two separate gameplay modes</li> <li>Add particle, sounds, and customizations</li> </ul> <p>... and more!</p>", "user_ratings": {}, "developers": [{"developer-name": "Zenva", "developer-url": "https://academy.zenva.com/product/godot-local-multiplayer/"}], "item_content_type": "software"}, "makeanaistatemachineingodot4": {"human_name": "Make an AI State Machine in Godot 4", "machine_name": "makeanaistatemachineingodot4", "youtube_link": "KRdsAN6Ne5s", "callout": "<div class=\"accolades\">HB Exclusive</div>", "publishers": [], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Master AI for your NPCs in Godot!</p> <p>From enemies to humble villagers, AI is a powerful tool in games that allows you to have dynamic characters capable of a variety of actions. In this course, you'll create a small exploration project where creatures are able to wander around, chase the player, and flee from the player - all using a state machine to auto-transition between these AI actions. These skills will unlock new ways you can approach AI for your NPCs and easily create modular systems that can be expanded to suit any sort of game.</p> <p><strong>You will learn how to:</strong></p> <ul> <li>Work with 3D navigation</li> <li>Prepare NPC AI node structure</li> <li>Script modular functions for states</li> <li>Build states to contain behaviors</li> <li>Control states with a state machine</li> <li>Transition between states</li> </ul> <p>... and more!</p>", "user_ratings": {}, "developers": [{"developer-name": "Zenva", "developer-url": "https://academy.zenva.com/product/godot-ai-state-machine/"}], "item_content_type": "software"}, "towerdefensegameingodot_unit1_basegame": {"human_name": "Tower Defense Game in Godot - Unit 1 - Base Game", "machine_name": "towerdefensegameingodot_unit1_basegame", "youtube_link": "pHg8tiZxJxU", "callout": "<div class=\"accolades\">First Time HB Exclusive</div>", "publishers": [], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Build a basic tower defense game in Godot!</p> <p>Tower defense games are renowned for their blend of action, strategy, and real-time decision-making. Through this course, you’ll construct the foundational systems of a tower defense game by programming enemy wave spawns, implementing a working tower with real targeting logic, developing bullet projectiles that track and damage enemies, and more. With these tower defense skills, you'll gain practical experience orchestrating interactions between scenes, signals, and groups in Godot - crucial skills for your future projects.</p> <strong>You’ll learn how to:</strong> <ul> <li>Set up wave enemy spawning</li> <li>Create and program tower logic</li> <li>Build bullet projectile mechanics</li> <li>Manage dynamic stats</li> <li>Connect multiple scenes</li> <li>Use path following for enemies</li> </ul> <p>... and more!</p>", "user_ratings": {}, "developers": [{"developer-name": "Zenva", "developer-url": "https://academy.zenva.com/product/godot-tower-defense-base-course/"}], "item_content_type": "software"}, "introtogodot4gamedevelopment2025edition": {"human_name": "Intro to Godot 4 Game Development", "machine_name": "introtogodot4gamedevelopment2025edition", "youtube_link": "dBnPIYk_pAA", "callout": "<div class=\"accolades\">MSRP: $50</div>", "publishers": [], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 1.0}, "subtitle_html": null, "description_text": "<p>Start your game development journey with Godot — the powerful, open-source game engine!</p> <p>Godot is a versatile tool for 2D and 3D game development, combining beginner-friendly workflows with powerful professional features.</p> <p>In this course, you'll explore the essential features of Godot by gaining hands-on experience in core development tools, 2D design, 3D environments, and coding gameplay behaviors with GDScript from start to finish.</p> <p>Dive in and gain the foundations you'll need to make RPGs, survival games, and more with Godot!</p> <strong>You’ll learn how to:</strong> <ul> <li>Navigate the Godot editor</li> <li>Utilize core editing tools</li> <li>Understand Nodes and Scenes</li> <li>Work with 2D &amp; 3D assets</li> <li>Script gameplay behaviors with GDScript</li> <li>Develop a basic interactive game</li> </ul> <p>... and more!</p>", "user_ratings": {}, "developers": [{"developer-name": "Zenva", "developer-url": "https://academy.zenva.com/product/intro-to-godot-4-game-development/"}], "item_content_type": "software"}, "monstercollectoringodot_unit3_gameplayloop": {"human_name": "Monster Collector in Godot - Unit 3 - Gameplay Loop", "machine_name": "monstercollectoringodot_unit3_gameplayloop", "youtube_link": "VguSxjd0SCw", "callout": "<div class=\"accolades\">First Time HB Exclusive</div>", "publishers": [], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Bring your monster collector to fruition by learning the workflows to combine complex systems!</p><p>Monster collectors stand out as one of the most beloved game genres, combining immersive exploration, strategy, and battle progression. In this course, you’ll craft a complete game by uniting overworld exploration with dynamic, turn-based battle gameplay - all while adding NPC-based features. These skills will expand your Godot expertise by showing you how to integrate complex RPG systems and design a cohesive gameplay loop.</p><strong>You’ll learn how to:</strong><ul><li>Seamlessly combine overworld and battles</li><li>Trigger wild encounters during exploration</li><li>Design a nurse to heal monsters</li><li>Implement monster leveling progression</li><li>Add quests to guide player progress</li><li>Use Godot resources for data management</li></ul><p>... and more!</p>", "user_ratings": {}, "developers": [{"developer-name": "Zenva", "developer-url": "https://academy.zenva.com/product/godot-monster-collector-game-loop-course/"}], "item_content_type": "software"}, "swipedetectiongame_godotmobileprojects": {"human_name": "Swipe Detection Game - Godot Mobile Projects", "machine_name": "swipedetectiongame_godotmobileprojects", "youtube_link": "qzKqZ8EBG7Q", "callout": "<div class=\"accolades\">First Time HB</div>", "publishers": [], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Create a mobile game in Godot using swipe-based mechanics!</p> <p>The ability of mobile devices to accept gesture-based inputs has allowed many games to innovate on common game formulas. In this course, you'll explore how to work with swipe gestures to build a game where players have to swipe in the correct direction before the timer runs out. These skills will allow you to unlock more capabilities touch screens offer and provide new ways for you to approach mobile game development.</p> <strong>You will learn how to:</strong> <ul> <li>Understand how swipes are detected</li> <li>Score players on correct swipes</li> <li>Randomize rotations and colors</li> <li>Add time-based mechanics</li> <li>Implement simple animations</li> <li>Add particles for game feel</li> </ul> <p>... and more!</p>", "user_ratings": {}, "developers": [{"developer-name": "Zenva", "developer-url": "https://academy.zenva.com/product/godot-mobile-swipe-detection/"}], "item_content_type": "software"}, "metroidvaniawithgodot_unit1_platformerbasics": {"human_name": "Metroidvania with Godot - Unit 1 - Platformer Basics", "machine_name": "metroidvaniawithgodot_unit1_platformerbasics", "youtube_link": "iz2CMD_XPbI", "callout": "<div class=\"accolades\">First Time HB Exclusive</div>", "publishers": [], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Build a Metroidvania platformer with Godot!</p> <p>Metroidvanias are renowned for their intricate worlds, layered mechanics, and rewarding exploration, making them a staple of modern game design. In this course, you’ll develop a responsive 2D platformer while learning to create precise character movement, custom enemy behavior, and sophisticated player animations. Through hands-on practice, you’ll gain the essential technical and creative skills needed to craft platformers in Godot that don’t just work, but truly feel satisfying to play.</p> <strong>You'll learn how to:</strong> <ul> <li>Code tight, responsive player controls</li> <li>Implement dashing, ducking, and “coyote jumping”</li> <li>Build levels with efficient tilemaps</li> <li>Create and program basic enemies</li> <li>Animate characters with layered motion</li> <li>Set up shooting and explosion mechanics</li> </ul> <p>... and more!</p>", "user_ratings": {}, "developers": [{"developer-name": "Zenva", "developer-url": "https://academy.zenva.com/product/godot-metroidvania-platformer-course/"}], "item_content_type": "software"}, "introtomobilegamedevelopmentwithgodot": {"human_name": "Intro to Mobile Game Development with Godot", "machine_name": "introtomobilegamedevelopmentwithgodot", "youtube_link": "kzEmXGYcGcU", "callout": "<div class=\"accolades\">First Time HB Exclusive</div>", "publishers": [], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Build an infinite runner for mobile devices from start to finish with Godot!</p><p>Mobile games are one of the most popular genres worldwide, offering unique challenges in design, controls, and user experience. In this course, you'll develop a complete infinite runner in Godot, mastering every step from core mechanics of the genre to deploying your finished app on Android and iOS. These techniques will help you unlock real-world skills to publish your own mobile games and level up towards more advanced titles.</p><strong>You'll learn how to:</strong><ul><li>Design tap-based mobile controls</li><li>Create an endless runner game loop</li><li>Implement obstacle spawning and collision</li><li>Deploy games to Android and iOS</li><li>Work through mobile-specific optimization</li><li>Add game \"juice\" to enhance UX</li></ul><p>... and more!</p>", "user_ratings": {}, "developers": [{"developer-name": "Zenva", "developer-url": "https://academy.zenva.com/product/godot-mobile-course/"}], "item_content_type": "software"}, "monstercollectoringodot_unit1_overworld": {"human_name": "Monster Collector in Godot - Unit 1 - Overworld", "machine_name": "monstercollectoringodot_unit1_overworld", "youtube_link": "2QEvkTUpkpI", "callout": "<div class=\"accolades\">First Time HB Exclusive</div>", "publishers": [], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Build a fully-fledged overworld for your own monster collector game in Godot!</p> <p>Monster-catching RPGs have become legendary in the world of game development, renowned for their expansive exploration, memorable trainers, and the thrill of player progression. In this course, you’ll create a complete overworld system, designing multi-level environments, crafting interactive dialogue, and mastering techniques to persistently track data states. These skills will empower you to engineer robust adventures and bring your creature-collecting worlds to life.</p> <strong>You’ll learn how to:</strong> <ul> <li>Build multi-level overworld environments</li> <li>Develop trainer dialogue options</li> <li>Organize complex data efficiently</li> <li>Master Godot's TileMap and animations</li> <li>Modularize code with inheritance</li> <li>Apply advanced state management patterns</li> </ul> <p>... and more!</p>", "user_ratings": {}, "developers": [{"developer-name": "Zenva", "developer-url": "https://academy.zenva.com/product/godot-monster-collector-overworld-course/"}], "item_content_type": "software"}, "godot4mini-projects2025edition": {"human_name": "Godot 4 Mini-Projects", "machine_name": "godot4mini-projects2025edition", "youtube_link": "dJDsLgDli18", "callout": "<div class=\"accolades\">MSRP: $50</div>", "publishers": [], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 15.0}, "subtitle_html": null, "description_text": "<p>Learn essential game development tools through engaging Godot mini-projects!</p> <p>Godot is a leading open-source game engine known for its flexibility in creating both 2D and 3D games. In this course, you'll create four practical mini-projects designed to solidify your grasp on crucial game mechanics and programming concepts. From mouse input handling to 2D physics systems and collision detection, these hands-on projects will form the foundation needed to build more complex, complete games in the future.</p> <strong>You’ll learn how to:</strong> <ul> <li>Implement mouse-click-driven interactions</li> <li>Work with Godot’s physics engine</li> <li>Detect collisions and handle responses</li> <li>Use loops to automate complex systems</li> <li>Create dynamic UI for player interaction</li> <li>Communicate between scripts</li> </ul> <p>... and more!</p>", "user_ratings": {}, "developers": [{"developer-name": "Zenva", "developer-url": "https://academy.zenva.com/product/godot-4-mini-projects/"}], "item_content_type": "software"}, "introtogamedesign": {"human_name": "Intro to Game Design", "machine_name": "introtogamedesign", "youtube_link": "FdhFX3SCVOc", "callout": "<div class=\"accolades\">MSRP: $50</div>", "publishers": [], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 1.0}, "subtitle_html": null, "description_text": "<p>Discover how the core concepts of game design can help you to create fun and intuitive games!</p> <p>Game design is a fundamental process needed when creating any game - from the smallest platformer to the largest MMORPG. In this course, you'll start mastering the foundations of game design by examining each core component and how they apply to real-world games. By the end, you'll understand both why game design is important and, more crucially, how to apply the concepts to your own games and create a stunning portfolio.</p> <strong>You will learn how to:</strong> <ul> <li>Plan a game around a core mechanic or experience</li> <li>Engage players by providing tangible goals</li> <li>Structure game actions</li> <li>Guide players through the game</li> <li>Understand game feel and its effects</li> <li>Show players how to play in different ways</li> </ul> <p>... and more!</p>", "user_ratings": {}, "developers": [{"developer-name": "Zenva", "developer-url": "https://academy.zenva.com/product/intro-to-game-design/"}], "item_content_type": "software"}, "constructacraftingsystemingodot4": {"human_name": "Construct a Crafting System in Godot 4", "machine_name": "constructacraftingsystemingodot4", "youtube_link": "9iVf7ApFG_o", "callout": "<div class=\"accolades\">HB Exclusive</div>", "publishers": [], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Create a crafting system for Godot 4 games!</p> <p>Crafting is a popular mechanic in many different genres - from simulations to hardcore strategy games. In this course, you'll take an existing inventory system and learn how to construct an equally modular crafting system that can easily be expanded with different recipes. These techniques will give you access to a core developer toolset and provide you new ways to add functionality to the items in your projects.</p> <p>A basic understanding of Godot and GDScript is needed for this course.</p> <strong>You will learn how to:</strong> <ul> <li>Create 3D environments with items</li> <li>Craft modular item recipes</li> <li>Construct crafting UIs</li> <li>Combine crafting with inventories</li> <li>Process item additions and removals</li> <li>Integrate multiple systems together</li> </ul> <p>... and more!</p>", "user_ratings": {}, "developers": [{"developer-name": "Zenva", "developer-url": "https://academy.zenva.com/product/godot-crafting-system/"}], "item_content_type": "software"}, "2dactionrpgingodot_unit2_itemsandinventory": {"human_name": "2D Action RPG in Godot - Unit 2 - Items & Inventory", "machine_name": "2dactionrpgingodot_unit2_itemsandinventory", "youtube_link": "m4w1sb6zsG8", "callout": "<div class=\"accolades\">First Time HB Exclusive</div>", "publishers": [], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Expand your Godot Action RPG with an interactive inventory system!</p> <p>Inventory and item mechanics are essential to action RPG design, offering players choices in how they collect, manage, and utilize resources. In this course, you'll create an inventory and item framework from start to finish, enhancing your project with loot drops, consumables, equipment mechanics, and more. The techniques learned will allow you to define every aspect of item rewards and player progression, adding real-world RPG depth and replayability to your projects.</p> <strong>You'll learn how to:</strong> <ul> <li>Design and implement diverse item types</li> <li>Build a scalable inventory system</li> <li>Connect inventory UI to equipment actions</li> <li>Enable item consumption with effects</li> <li>Configure enemy loot drop pools</li> <li>Integrate items seamlessly into dungeons</li> </ul> <p>... and more!</p>", "user_ratings": {}, "developers": [{"developer-name": "Zenva", "developer-url": "https://academy.zenva.com/product/2d-action-rpg-items-course/"}], "item_content_type": "software"}, "gitandgithubforgodot_versioncontrolessentials": {"human_name": "Git and GitHub for Godot - Version Control Essentials", "machine_name": "gitandgithubforgodot_versioncontrolessentials", "youtube_link": "JPh0z9PMAw0", "callout": "<div class=\"accolades\">HB Exclusive</div>", "publishers": [], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 15.0}, "subtitle_html": null, "description_text": "<p>Unlock the power of GitHub for your Godot projects!</p> <p>Version control is an essential skill for modern game developers, enabling seamless project collaboration, efficient backups, and effortless iteration. In this course, you'll explore how to integrate GitHub with Godot, learning the foundational tools needed to track, sync, and safeguard your game development projects. By the end, you'll be equipped to manage your code like a pro and collaborate on fully-fledged Godot projects with ease.</p> <p>A basic understanding of Godot is recommended for this course.</p> <p><strong>You’ll learn how to:</strong></p> <ul> <li>Install and navigate GitHub Desktop</li> <li>Create Git repositories for Godot projects</li> <li>Commit and push changes effectively</li> <li>Add collaborators for your projects</li> <li>Pull and track change history</li> <li>Resolve merge conflicts</li> </ul> <p>... and more!</p>", "user_ratings": {}, "developers": [{"developer-name": "Zenva", "developer-url": "https://academy.zenva.com/product/godot-version-control-course/"}], "item_content_type": "software"}, "explorestorytellingforgames": {"human_name": "Explore Storytelling for Games", "machine_name": "explorestorytellingforgames", "youtube_link": "s3VT2g0_LCI", "callout": "<div class=\"accolades\">HB Exclusive</div>", "publishers": [], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Discover tips and techniques for designing game narratives! You'll learn by studying real games, and master a variety of methods for telling stories through characters, plots, mechanics, and more.</p> <p>No matter what type of games you want to build, the skills you'll learn will help to make your games more immersive and engaging for your players.</p> <strong>You will learn how to:</strong> <ul> <li>Understand technical story design</li> <li>Create compelling protagonists &amp; antagonists</li> <li>Base your story on a three-act structure</li> <li>Use game-based methods to convey your story</li> <li>Incorporate interactive, choice-based storytelling</li> <li>Advance the story with quests</li></ul>", "user_ratings": {}, "developers": [{"developer-name": "Zenva", "developer-url": "https://academy.zenva.com/product/explore-storytelling-for-games/"}], "item_content_type": "software"}, "metroidvaniawithgodot_unit2_combatandlevels": {"human_name": "Metroidvania with Godot - Unit 2 - Combat and Levels", "machine_name": "metroidvaniawithgodot_unit2_combatandlevels", "youtube_link": "ks-ymg5lkQ0", "callout": "<div class=\"accolades\">First Time HB Exclusive</div>", "publishers": [], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Build a complete Metroidvania experience with Godot!</p> <p>Metroidvania games are celebrated for their interconnected worlds, layered challenges, and exploration-driven gameplay. Through this course, you'll transform your simple Metroidvania platformer into a complete, multi-level game packed with thrilling combat, diverse enemies, and immersive audio-visual elements. By mastering these Godot skills, you’ll open the door to designing deeper, more engaging adventure games with persistent worlds that keep players coming back.</p> <strong>You’ll learn how to:</strong> <ul> <li>Design and connect multiple levels</li> <li>Add new enemy types and behaviors</li> <li>Implement guns and new weapons</li> <li>Enable controller input support</li> <li>Integrate sound effects and music</li> <li>Maintain global game state across scenes</li> </ul> <p>... and more!</p>", "user_ratings": {}, "developers": [{"developer-name": "Zenva", "developer-url": "https://academy.zenva.com/product/godot-metroidvania-combat-course/"}], "item_content_type": "software"}, "introtovisualshadersingodot4": {"human_name": "Intro to Visual Shaders in Godot 4", "machine_name": "introtovisualshadersingodot4", "youtube_link": "6cIXTPENgmM", "callout": "<div class=\"accolades\">HB Exclusive</div>", "publishers": [], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Unlock the power of visual shaders in Godot 4!</p><p>Shaders are essential for creating stunning visual effects in games and applications by manipulating 2D and 3D graphics at the pixel level. In this course, you’ll dive into the versatile world of visual shaders using Godot 4's intuitive visual shading node system to craft a variety of 2D effects. These techniques will supply you with the ability to create and customize visual effects, setting you up to develop fully-fledged projects that are as visually appealing as they are innovative.</p><strong>You will learn how to:</strong><ul><li>Create and configure custom shaders</li><li>Update color and transparency efficiently</li><li>Design custom shapes with textures</li><li>Modify positions of 2D graphics</li><li>Utilize nodes in shader creation</li><li>Control visual parameters dynamically</li></ul><p>... and more!</p>", "user_ratings": {}, "developers": [{"developer-name": "Zenva", "developer-url": "https://academy.zenva.com/product/godot-visual-shaders-course/"}], "item_content_type": "software"}, "createacomplete2dplatformeringodot2025edition": {"human_name": "Create a Complete 2D Platformer in Godot", "machine_name": "createacomplete2dplatformeringodot2025edition", "youtube_link": "q_FVagfyQ5g", "callout": "<div class=\"accolades\">HB Exclusive</div>", "publishers": [], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Build a fully-fledged 2D platformer using Godot!</p><p>Creating platformer games is one of the most exciting and versatile ways to explore 2D game mechanics, with a great blend of player movement, enemy AI, and interactive objects. In this course, you'll construct a complete 2D platformer game from scratch – learning core mechanics like platforming fundamentals, health systems, coin collection, and level progression. By the end, you’ll have a polished, engaging 2D platformer and the skills to expand into any sort of 2D game you might imagine!</p><strong>You’ll learn how to:</strong><ul><li>Set up a fully functional player</li><li>Create enemies with basic AI behavior</li><li>Design and implement a health system</li><li>Add a coin collection and scoring system</li><li>Use persistent data across multiple scenes</li><li>Set up level transitions with end flags</li></ul><p>... and more!</p>", "user_ratings": {}, "developers": [{"developer-name": "Zenva", "developer-url": "https://academy.zenva.com/product/godot-2d-platformer-course/"}], "item_content_type": "software"}, "learngameoptimizationforgodot4": {"human_name": "Learn Game Optimization for Godot 4", "machine_name": "learngameoptimizationforgodot4", "youtube_link": "BF1T_1-xOCE", "callout": "<div class=\"accolades\">HB Exclusive</div>", "publishers": [], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Explore methods for optimizing games made with Godot!</p> <p>Game optimization is a vital process in game development to ensure your games work smoothly and efficiently. In this course, you'll discover how to use Godot's profiling tools and common techniques like level of detail to improve how games run. These skills will allow you to better leverage finite system resources and enhance how you critically approach your code bases and game setups.</p> <p>A basic understanding of Godot and GDScript is needed for this course.</p> <strong>You will learn how to:</strong> <ul> <li>Adjust level-of-detail for 3D models</li> <li>Use the multi-mesh instance node</li> <li>Identify resource-intensive scripts</li> <li>Pinpoint inefficient visual components</li> <li>Monitor game performance in real-time</li> <li>Improve occlusion culling</li> </ul> <p>... and more!</p>", "user_ratings": {}, "developers": [{"developer-name": "Zenva", "developer-url": "https://academy.zenva.com/product/godot-game-optimization/"}], "item_content_type": "software"}, "leveldesignforbeginners": {"human_name": "Level Design for Beginners", "machine_name": "leveldesignforbeginners", "youtube_link": "82Y8b9PnK2Y", "callout": "<div class=\"accolades\">MSRP: $50</div>", "publishers": [], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 15.0}, "subtitle_html": null, "description_text": "<p>Enhance your game project's levels by diving into the expansive topic of level design. Studying professionally published video games, you'll learn new techniques for creating engaging and intuitive levels that subtly guide the player through the game, enhance the storytelling, and cater to specific needs of a genre. You'll get to explore both a variety of ways in which levels can be created with a robust workflow, and develop concrete skills to make purposeful, battle-tested design choices to provide players with fun game experiences.</p> <strong>You will learn how to:</strong> <ul> <li>Guide players using lighting, landmarks, and more</li> <li>Teach players how to play with level design choices</li> <li>Enhance storytelling with the environment</li> <li>Adjust designs for open world and multiplayer games</li> <li>Follow basic level design workflows</li></ul>", "user_ratings": {}, "developers": [{"developer-name": "Zenva", "developer-url": "https://academy.zenva.com/product/level-design-for-beginners/"}], "item_content_type": "software"}, "2dactionrpgingodot_unit3_overworldandnpcs": {"human_name": "2D Action RPG in Godot - Unit 3 - Overworld & NPCs", "machine_name": "2dactionrpgingodot_unit3_overworldandnpcs", "youtube_link": "V8j-MI-hZWA", "callout": "<div class=\"accolades\">First Time HB Exclusive</div>", "publishers": [], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Create standout overworlds and NPCs in your Godot action RPGs!</p> <p>Immersive environments and rich character interactions can help bring RPGs to life. In this course, you’ll finalize a complete project by constructing tile-based overworlds, interactive NPCs, and robust shop mechanics from start to finish. These skills will enable you to connect exploration, dialogue, and progression into seamless Godot experiences - core systems that define high-quality action RPGs.</p> <strong>You’ll learn how to:</strong> <ul> <li>Expand the overworld with tilemaps</li> <li>Create persistent players across scenes</li> <li>Implement interactive dialogue with NPCs</li> <li>Build a functional shop system</li> <li>Design a modular, expandable interaction system</li> <li>Balance core gameplay loops</li> </ul> <p>... and more!</p>", "user_ratings": {}, "developers": [{"developer-name": "Zenva", "developer-url": "https://academy.zenva.com/product/2d-action-rpg-npcs-course/"}], "item_content_type": "software"}, "craftaninventorysystemwithgodot4": {"human_name": "Craft an Inventory System with Godot 4", "machine_name": "craftaninventorysystemwithgodot4", "youtube_link": "ihzydm2kiOs", "callout": "<div class=\"accolades\">HB Exclusive</div>", "publishers": [], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Build an inventory system for Godot 4!</p> <p>Inventories are a core aspect of many different game genres and provide players with a universally understood way to collect and manage game items. In this course, you'll build a modular and expandable inventory system that allows users to collect items, stack items, and even drop items back into the world. These skills will give you the foundations to take item interactivity to a new level and add a new dimension to your games.</p> <p>A basic understanding of Godot and GDScript is needed for this course.</p> <strong>You will learn how to:</strong> <ul> <li>Use Resources to create items</li> <li>Manage 2D and 3D objects</li> <li>Craft inventory UI systems</li> <li>Control item properties like stacking</li> <li>Connect 3D game items to inventory</li> <li>Improve game feel with physics</li> </ul> <p>... and more!</p>", "user_ratings": {}, "developers": [{"developer-name": "Zenva", "developer-url": "https://academy.zenva.com/product/godot-inventory-system/"}], "item_content_type": "software"}, "createamicroturn-basedrpgingodot2025edition": {"human_name": "Create a Micro Turn-Based RPG in Godot", "machine_name": "createamicroturn-basedrpgingodot2025edition", "youtube_link": "xMrNK6JFgzM", "callout": "<div class=\"accolades\">MSRP: $50</div>", "publishers": [], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Develop a micro turn-based RPG from start to finish using Godot!</p><p>Turn-based RPGs are a cornerstone of game development, offering engaging mechanics based on strategic decision-making and rewarding gameplay loops. In this course, you'll build a visually engaging micro turn-based RPG in Godot where players face off against an AI opponent in tactical combat. These skills will enable you to tackle more advanced game projects, design fully-fledged RPG experiences, and refine your programming expertise in Godot.</p><strong>You’ll learn how to:</strong><ul><li>Design a turn-based combat system</li><li>Create custom player and AI actions</li><li>Implement AI decision-making with variables</li><li>Incorporate menus and game UI mechanics</li><li>Add game feel with visual and audio polish</li><li>Finalize a complete, playable project</li></ul><p>... and more!</p>", "user_ratings": {}, "developers": [{"developer-name": "Zenva", "developer-url": "https://academy.zenva.com/product/godot-turn-based-rpg-course/"}], "item_content_type": "software"}, "monstercollectoringodot_unit2_battlesystem": {"human_name": "Monster Collector in Godot - Unit 2 - Battle System", "machine_name": "monstercollectoringodot_unit2_battlesystem", "youtube_link": "Ud1ejslZ_YM", "callout": "<div class=\"accolades\">First Time HB Exclusive</div>", "publishers": [], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Build a fully-fledged, turn-based monster battle system in Godot!</p> <p>Monster-collecting battle mechanics are at the heart of some of gaming’s most enduring genres, demanding deep gameplay logic, robust data systems, and smart UI. Through this course, you’ll build a modular battle system for a monster collector game, including features like variations for different encounters, monster swapping, and capture mechanics. By mastering these advanced workflows, you'll be equipped to integrate professional battle systems into your own projects or expand your RPG design skills.</p> <strong>You’ll learn how to:</strong> <ul> <li>Implement a turn-based battle loop</li> <li>Manage state with custom enums</li> <li>Store and retrieve monster data</li> <li>Build catch and swap mechanics</li> <li>Combine 2D gameplay and UI nodes</li> <li>Write scalable and modular code</li> </ul> <p>... and more!</p>", "user_ratings": {}, "developers": [{"developer-name": "Zenva", "developer-url": "https://academy.zenva.com/product/godot-monster-collector-battles-course/"}], "item_content_type": "software"}, "towerdefensegameingodot_unit2_enhancedtowers": {"human_name": "Tower Defense Game in Godot - Unit 2 - Enhanced Towers", "machine_name": "towerdefensegameingodot_unit2_enhancedtowers", "youtube_link": "hwFGUnvJN6g", "callout": "<div class=\"accolades\">First Time HB Exclusive</div>", "publishers": [], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Complete a fully-fledged tower defense experience with Godot!</p> <p>Tower defense games are a staple of strategy gaming, challenging players to think critically and plan ahead. In this course, you'll take your project from a basic prototype to a complete, feature-rich game by crafting enhanced towers, implementing interactive upgrades, and designing a seamless user interface. The skills you gain will empower you to design complex tower defense mechanics and build complete, polished Godot games with confidence.</p> <strong>You'll learn how to:</strong> <ul> <li>Create multiple unique tower classes</li> <li>Design a tower upgrade system</li> <li>Build a dynamic in-game UI</li> <li>Manage multiple scenes and data flow</li> <li>Work with Godot's signals</li> <li>Add SFX and other polishing effects</li> </ul> <p>... and more!</p>", "user_ratings": {}, "developers": [{"developer-name": "Zenva", "developer-url": "https://academy.zenva.com/product/godot-tower-defense-enhanced-course/"}], "item_content_type": "software"}}, "charity_data": {"charity_items": {"code_org": {"machine_name": "code_org", "youtube_link": "rH7AjDMz_dc", "item_content_type": null, "subtitle_html": null, "description_text": "<em>Donations to support&nbsp;Code.org are made to the&nbsp;<a rel=\"nofollow\" target=\"_blank\" href=\"https://support.humblebundle.com/hc/en-us/articles/205183597\" title=\"Link: https://support.humblebundle.com/hc/en-us/articles/205183597\">PayPal Giving Fund</a>, subject to its policies.</em><br><br>Launched in 2013, <a rel=\"nofollow\" target=\"_blank\" href=\"http://code.org\" title=\"Link: http://code.org\">Code.org</a>® is a non-profit dedicated to expanding participation in computer science by making it available in more schools, and increasing participation by women and underrepresented students of color. <a rel=\"nofollow\" target=\"_blank\" href=\"http://code.org\">Code.org</a>'s comprehensive approach represents the vanguard of effective integration of Computer Science (CS) into the core of public school education. Our vision is that every student in every school should have the opportunity to learn computer science. We believe computer science and computer programming should be part of the core curriculum in education, alongside other science, technology, engineering, and mathematics (STEM) courses, such as biology, physics, chemistry and algebra.", "human_name": "Code.org", "developers": [{"developer-name": "Code.org", "developer-url": "http://code.org"}], "publishers": [], "user_ratings": {}}}}, "from_bundle": {"machine_name": "learngodotin2026completecoursebundle_softwarebundle", "tile_short_name": "Learn Godot in 2026 Complete Course Bundle", "short_marketing_blurb": "Learn Godot and help others", "marketing_blurb": "Get Intro to Game Design, Create a Complete 2D Platformer in Godot, Intro to Mobile Game Development with Godot, Monster Collector in Godot - Unit 1 - Overworld, 2D Action RPG in Godot - Unit 1 - Player & Enemies, and more!", "detailed_marketing_blurb": "Are you curious about game creation? Learn to harness the power of Godot, the ultimate open-source creation engine, with our 2026 Complete Course Bundle! Pay what you want to access professional-quality game creation courses like <em>Metroidvania with Godot - Unit 1 - Platformer Basics</em>, <em>Monster Collector in Godot - Unit 1 - Overworld</em>, and more, all for a low price you choose. Make the most out of Godot and build any genre game you want—plus—a portion of your purchase helps support code.org!", "author": "Zenva Pty Ltd", "start_date|datetime": "2026-02-02T19:00:00", "end_date|datetime": "2026-02-23T19:00:00", "type": "bundle", "product_url": "/software/learn-godot-in-2026-complete-course-bundle-software"}, "updated_at|datetime": "2026-02-03T03:46:39.814157", "first_seen_at|datetime": "2026-02-03T03:46:39.814157"}
{"machine_name": "charliejaneandersannaleenewitztor_bookbundle", "author": "Macmillan Publishers", "basic_data": {"eula": null, "human_name": "Humble Book Bundle: Charlie Jane Anders & Annalee Newitz by TOR", "detailed_marketing_blurb": "You’ve never read sci-fi quite like this. We’ve joined forces with TOR for our latest ebook bundle, which features no less than 21 fantastic ebooks and digital shorts written by acclaimed authors Charlie Jane Anders and Annalee Newitz, co-founders of io9 and co-hosts of the Hugo-winning podcast <em>Our Opinions Are Correct</em>. Survive the dystopian corporate controlled future of Annalee Newitz’s <em>Autonomous</em>! Journey to the dark side of an alien planet in Charlie Jane Anders’ <em>The City in the Middle of the Night</em>! Follow the exploits of a vengeful mother-daughter witch duo in Anders’ <em>Lessons in Magic and Disaster</em>! Explore a post-war San Francisco with the sentient food service robots of Newitz’s <em>Automatic Noodle</em>! If you’ve been looking for a wealth of imaginative speculative fiction to add to your library, grab this bundle while you can, and support Miss Major and Alexander L. Lee’s TGIJP Black Trans Cultural Center with your purchase! ", "short_marketing_blurb": "Speculative fiction like you’ve never seen before", "media_type": "ebook", "description": "<p><strong>Speculative fiction like you’ve never seen before.</strong> You’ve never read sci-fi quite like this. We’ve joined forces with TOR for our latest ebook bundle, which features no less than 21 fantastic ebooks and digital shorts written by acclaimed authors Charlie Jane Anders and Annalee Newitz, co-founders of io9 and co-hosts of the Hugo-winning podcast <em>Our Opinions Are Correct</em>. Survive the dystopian corporate controlled future of Annalee Newitz’s <em>Autonomous</em>! Journey to the dark side of an alien planet in Charlie Jane Anders’ <em>The City in the Middle of the Night</em>! Follow the exploits of a vengeful mother-daughter witch duo in Anders’ <em>Lessons in Magic and Disaster</em>! Explore a post-war San Francisco with the sentient food service robots of Newitz’s <em>Automatic Noodle</em>! If you’ve been looking for a wealth of imaginative speculative fiction to add to your library, grab this bundle while you can, and support Miss Major and Alexander L. Lee’s TGIJP Black Trans Cultural Center with your purchase!</p>\n<p><strong>Pay $3 or more.</strong> Normally, the total cost for the ebooks in this bundle is as much as $162. Here at Humble Bundle, you choose the price and increase your contribution to upgrade your bundle! This bundle has a minimum $3 purchase.</p>\n<p><strong>Read them anywhere.</strong> The ebooks in this bundle are available in ePub format, so they work on your computer, e-readers, iPads, cell phones, and a wide array of mobile devices! Instructions and a list of recommended reading programs can be found <a href=\"https://support.humblebundle.com/hc/articles/202712300\" rel=\"noopener\" target=\"_blank\">here</a>.</p>\n<p><strong>Support charity.</strong> Choose where the money goes - between the publisher and to support Miss Major and Alexander L. Lee's TGIJP Black Trans Cultural Center. If you like what we do, you can leave us a Humble Tip too!</p>", "legal_disclaimer": null, "required_account_links": ["steam"], "end_time|datetime": "2026-02-23T19:00:00"}, "tier_item_data": {"fermiparadoxisourbusinessmodel": {"human_name": "The Fermi Paradox is Our Business Model", "machine_name": "fermiparadoxisourbusinessmodel", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Tor Books", "publisher-url": "https://torpublishinggroup.com/"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 18.0}, "subtitle_html": null, "description_text": "<p><b>A humorous, sci-fi tale from the award-winning author of<i> All the Birds in the Sky,</i> Charlie Jane Anders's \"The Fermi Paradox,\"  a Tor.com Original</b>\n\nJon and Toku travel the universe suspended in Interdream, only waking up to check up on certain business ventures. Simple. Until one of the business ventures, something called \"Earth,\" objects.\n\nAt the Publisher's request, this title is being sold without Digital Rights Management Software (DRM) applied.</p>", "user_ratings": {}, "developers": [{"developer-name": "Charlie Jane Anders"}], "item_content_type": "ebook"}, "theterraformers_ebook": {"human_name": "The Terraformers", "machine_name": "theterraformers_ebook", "youtube_link": null, "callout": "<div class=\"accolades\">Nominated for the 2024 Nebula Award</div>", "publishers": [{"publisher-name": "Tor Books", "publisher-url": "https://torpublishinggroup.com/"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 18.0}, "subtitle_html": null, "description_text": "<p><b>From science fiction visionary Annalee Newitz comes <i>The Terraformers</i>, a sweeping, uplifting, and illuminating exploration of the future. </b>\n\nDestry's life is dedicated to terraforming Sask-E. As part of the Environmental Rescue Team, she cares for the planet and its burgeoning eco-systems as her parents and their parents did before her.\n\nBut the bright, clean future they're building comes under threat when Destry discovers a city full of people that shouldn‚Äôt exist, hidden inside a massive volcano.\n\nAs she uncovers more about their past, Destry begins to question the mission she's devoted her life to, and must make a choice that will reverberate through Sask-E's future for generations to come.  \n\n<b>A science fiction epic for our times and a love letter to our future, <i>The Terraformers</i> will take you on a journey spanning thousands of years and </b><b>exploring the triumphs, strife, and hope that find us wherever we make our home. </b>\n\n<b>\"Brilliantly thoughtful, prescient, and gripping.‚Äù</b><b>‚Äî</b><b>Martha Wells, author of The Murderbot Diaries</b>\n\nAlso by Annalee Newitz\n<i>Autonomous</i>\n<i>The Future of Another Timeline</i>\n\nAt the Publisher's request, this title is being sold without Digital Rights Management Software (DRM) applied.</p>", "user_ratings": {}, "developers": [{"developer-name": "Annalee Newitz"}], "item_content_type": "ebook"}, "ifyoutakemymeaning": {"human_name": "If You Take My Meaning", "machine_name": "ifyoutakemymeaning", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Tor Books", "publisher-url": "https://torpublishinggroup.com/"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 18.0}, "subtitle_html": null, "description_text": "<p><b> From award-winning author Charlie Jane Anders comes an original space opera short story \"If You Take My Meaning\"</b>\n\nAs an ex-smuggler and two-time reluctant revolutionary, Alyssa is used to staring into the razor-sharp jaws of death. But now she's embarking on the most terrifying adventure of her life‚Äîjourneying into the darkness to become a new type of being, one who can help humanity to survive. And deep at the heart of the city in the middle of the night, the price of transformation could be higher, and more terrible, than Alyssa ever expected.\n\nAt the Publisher's request, this title is being sold without Digital Rights Management Software (DRM) applied.</p>", "user_ratings": {}, "developers": [{"developer-name": "Charlie Jane Anders"}], "item_content_type": "ebook"}, "allthebirdsinthesky": {"human_name": "All the Birds in the Sky", "machine_name": "allthebirdsinthesky", "youtube_link": null, "callout": "<div class=\"accolades\">Winner of the 2016 Nebula Award for Best Novel</div>", "publishers": [{"publisher-name": "Tor Books", "publisher-url": "https://torpublishinggroup.com/"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 18.0}, "subtitle_html": null, "description_text": "<p><b><i>Entertainment Weekly</i>'s 27 Female Authors Who Rule Sci-Fi and Fantasy Right Now \nWinner of the 2017 Nebula Award for Best Novel\nFinalist for the 2017 Hugo Award for Best Novel\n</b><b><i>Paste</i>'s 50 Best Books of the 21st Century (So Far) List\n</b><b>\n‚ÄúThe book is full of quirkiness and playful detail...but there's an overwhelming depth and poignancy to its virtuoso ending.‚Äù ‚ÄîNPR \n\nFrom the former editor-in-chief of <i>io9.com,</i> a stunning  Nebula Award-winning and </b><b>Hugo-shortlisted novel about the end of the world</b><b>‚Äî</b><b>and the beginning of our future</b>\n\nAn ancient society of witches and a hipster technological startup go to war in order to prevent the world from tearing itself apart. To further complicate things, each of the groups‚Äô most promising followers (Patricia, a brilliant witch and Laurence, an engineering ‚Äúwunderkind‚Äù) may just be in love with each other. \n\nAs the battle between magic and science wages in San Francisco against the backdrop of international chaos, Laurence and Patricia are forced to choose sides. But their choices will determine the fate of the planet and all mankind.\n\nIn a fashion unique to Charlie Jane Anders, <i>All the Birds in the Sky</i> offers a humorous and, at times, heart-breaking exploration of growing up extraordinary in a world filled with cruelty, scientific ingenuity, and magic.\n\nAt the Publisher's request, this title is being sold without Digital Rights Management Software (DRM) applied.</p>", "user_ratings": {}, "developers": [{"developer-name": "Charlie Jane Anders"}], "item_content_type": "ebook"}, "intestate": {"human_name": "Intestate", "machine_name": "intestate", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Tor Books", "publisher-url": "https://torpublishinggroup.com/"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 18.0}, "subtitle_html": null, "description_text": "<p>By now, it's hard to tell how human my father still is. But we're still family. What that means...is another question.\n\nAt the Publisher's request, this title is being sold without Digital Rights Management Software (DRM) applied.</p>", "user_ratings": {}, "developers": [{"developer-name": "Charlie Jane Anders"}], "item_content_type": "ebook"}, "futureofanothertimeline": {"human_name": "The Future of Another Timeline", "machine_name": "futureofanothertimeline", "youtube_link": null, "callout": "<div class=\"accolades\">Winner of the 2020 Sidewise Award</div>", "publishers": [{"publisher-name": "Tor Books", "publisher-url": "https://torpublishinggroup.com/"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 18.0}, "subtitle_html": null, "description_text": "<p>‚Äú<b>A revolution is happening in speculative fiction, and Annalee Newitz is leading the vanguard</b>.\"<b>--Wil Wheaton</b>\n\n<b>From Annalee Newitz, founding editor of <i>io9</i>, comes a story of time travel, murder, and the lengths we'll go to protect the ones we love.\n</b>\n<b>1992</b>: After a confrontation at a riot grrl concert, seventeen-year-old Beth finds herself in a car with her friend's abusive boyfriend dead in the backseat, agreeing to help her friends hide the body. This murder sets Beth and her friends on a path of escalating violence and vengeance as they realize many other young women in the world need protecting too.\n\n<b>2022</b>: Determined to use time travel to create a safer future, Tess has dedicated her life to visiting key moments in history and fighting for change. But rewriting the timeline isn‚Äôt as simple as editing one person or event. And just when Tess believes she's found a way to make an edit that actually sticks, she encounters a group of dangerous travelers bent on stopping her at any cost.\n\nTess and Beth‚Äôs lives intertwine as war breaks out across the timeline--a war that threatens to destroy time travel and leave only a small group of elites with the power to shape the past, present, and future. Against the vast and intricate forces of history and humanity, is it possible for a single person‚Äôs actions to echo throughout the timeline?\n\nPraise for <i>The Future of Another Timeline</i>: \n\n\"<b>An intelligent, gut-wrenching glimpse of how tiny actions, both courageous and venal, can have large consequences. Smart and profound on every level</b>.‚Äù<b>‚Äî</b><i>Publishers Weekly</i> (starred review)\n\n\"<b>You close the book reeling with questions about your own life and your part in changing the future</b>.\"<b>‚Äî</b>Amy Acker, actress (<i>Angel</i> and <i>Person of Interest</i>)\n\nAt the Publisher's request, this title is being sold without Digital Rights Management Software (DRM) applied.</p>", "user_ratings": {}, "developers": [{"developer-name": "Annalee Newitz"}], "item_content_type": "ebook"}, "miss_major_alexander_l_lee_tgijp_black_trans_cultural_center": {"human_name": "Miss Major Alexander L. Lee TGIJP Black Trans Cultural Center / Transgender Gender-Variant Intersex Justice Project (TGIJP)", "machine_name": "miss_major_alexander_l_lee_tgijp_black_trans_cultural_center", "youtube_link": null, "callout": null, "publishers": [], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "subtitle_html": null, "description_text": "<span><span><em>Donations to support&nbsp;</em></span></span>Miss Major Alexander L. Lee TGIJP Black Trans Cultural Center <em>are made to <a href=\"https://support.humblebundle.com/hc/en-us/articles/205183597\" target=\"_blank\" rel=\"noopener\">PayPal Giving Fund</a>, subject to its policies.</em><span><span><em><br></em></span></span><span><br>The Miss Major Alexander L. Lee TGIJP Black Trans Cultural Center is a team of transgender, gender-variant and intersex people, inside and outside of prisons, jails, detention centers, and other locked facilities creating a united family in the struggle for survival and freedom. We work in collaboration with others to forge a culture of resistance and resilience to strengthen us for the fight against human rights abuses, imprisonment, police violence, racism, poverty, and societal pressures. We seek to create a world rooted in self-determination, freedom of expression, and gender justice.<br></span>", "user_ratings": {}, "developers": [], "item_content_type": null}, "sixmonthsthreedays": {"human_name": "Six Months, Three Days", "machine_name": "sixmonthsthreedays", "youtube_link": null, "callout": "<div class=\"accolades\">Winner of the 2012 Hugo Award for Best Novelette</div>", "publishers": [{"publisher-name": "Tor Books", "publisher-url": "https://torpublishinggroup.com/"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 18.0}, "subtitle_html": null, "description_text": "<p><b>From author Charlie Jane Anders comes a Tor.com Original, <i>Six Months, Three Days, </i>winner of the Hugo Award for Best Novelette.\n\n</b>Doug and Judy have both had a secret power all their life. Judy can see every possible future, branching out from each moment like infinite trees. Doug can also see the future, but for him, it's a single, locked-in, inexorable sequence of foreordained events. They can't both be right, but over and over again, they are. \n\nObviously these are the last two people in the world who should date. So, naturally, they do\n\nAt the Publisher's request, this title is being sold without Digital Rights Management Software (DRM) applied.</p>", "user_ratings": {}, "developers": [{"developer-name": "Charlie Jane Anders"}], "item_content_type": "ebook"}, "clover": {"human_name": "Clover", "machine_name": "clover", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Tor Books", "publisher-url": "https://torpublishinggroup.com/"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 18.0}, "subtitle_html": null, "description_text": "<p>Answering the question asked by innumerable readers of the Charlie Jane Anders's novel <i>All the Birds in the Sky:</i> what happened to Patricia's cat? Find out in this Tor.com Original, <i>Clover</i>.\n\nAt the Publisher's request, this title is being sold without Digital Rights Management Software (DRM) applied.</p>", "user_ratings": {}, "developers": [{"developer-name": "Charlie Jane Anders"}], "item_content_type": "ebook"}, "cartographyofsuddendeath": {"human_name": "The Cartography of Sudden Death", "machine_name": "cartographyofsuddendeath", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Tor Books", "publisher-url": "https://torpublishinggroup.com/"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 18.0}, "subtitle_html": null, "description_text": "<p>Time travel doesn't actually solve problems. It just makes them more complex‚Ä¶.\n\n\nAt the Publisher's request, this title is being sold without Digital Rights Management Software (DRM) applied.</p>", "user_ratings": {}, "developers": [{"developer-name": "Charlie Jane Anders"}], "item_content_type": "ebook"}, "asgoodasnew": {"human_name": "As Good as New", "machine_name": "asgoodasnew", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Tor Books", "publisher-url": "https://torpublishinggroup.com/"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 18.0}, "subtitle_html": null, "description_text": "<p>From the author of the Hugo-winning \"Six Months, Three Days,\" a new wrinkle on the old story of three wishes, set after the end of the world.\n\nAt the Publisher's request, this title is being sold without Digital Rights Management Software (DRM) applied.</p>", "user_ratings": {}, "developers": [{"developer-name": "Charlie Jane Anders"}], "item_content_type": "ebook"}, "oldmedia": {"human_name": "Old Media", "machine_name": "oldmedia", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Tor Books", "publisher-url": "https://torpublishinggroup.com/"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 18.0}, "subtitle_html": null, "description_text": "<p>Annalee Newitz's <i>Old Media</i>: A Tor.com Original, tells the story of a freed slave and a robot professor, trying to figure out what it means to be in love while they watch old anime from the 21st century.\n\nAt the Publisher's request, this title is being sold without Digital Rights Management Software (DRM) applied.</p>", "user_ratings": {}, "developers": [{"developer-name": "Annalee Newitz"}], "item_content_type": "ebook"}, "promisesstrongerthandarkness_unstoppable_book3": {"human_name": "Promises Stronger Than Darkness: \nUnstoppable, Book 3", "machine_name": "promisesstrongerthandarkness_unstoppable_book3", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Tor Teen", "publisher-url": "https://torpublishinggroup.com/"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 18.0}, "subtitle_html": null, "description_text": "<p><b><i>Promises Stronger Than Darkness</i> marks the final installment of the international bestselling author Charlie Jane Anders's absolutely heart-stopping YA series, Unstoppable.</b>\n\n<b>They're the galaxy's most wanted‚Äîand our only hope.</b>\n\nWhen Elza became a space princess, she thought she'd be spending her time at the palace, wearing gorgeous couture and soaking up everything there is to know‚Äîbut instead, she's on the run, with everyone hunting for her and her friends.\n\nRachael followed her best friend Tina on the adventure of a lifetime‚Äîbut now Tina's gone, and Rachael's the only one keeping her friends together, as they go on a desperate quest to save everyone from an ancient curse.\n\nRachael, Elza and their friends have found one clue, one shining mysterious chance to stop the end of the world. And that takes them back to the second-to-last place they'd want to be: enlisting the aid of Captain Thaoh Argentian, the woman who stole Tina's body (and who now seems to be relishing a second chance at teenage chaos and drama, instead of living up to her legacy of an intrepid heroic commander). \n\nWith only a ragtag band of misfits, crewmates, earthlings, friends, lovers (and one annoying frenemy), the Unstoppable Crew are up against the universe--and they soon find that in order to survive, they may have to cross a line they vowed never to cross. \n\n<b>Also by Charlie Jane Anders</b>\n\n<b>Unstoppable</b><i>\nVictories Greater Than Death\nDreams Bigger Than Heartbreak\nPromises Stronger than Darkness</i>\n\n<b>Other Books</b>\n<i>The City in the Middle of the Night\nNever Say You Can't Survive\nAll the Birds in the Sky</i>\n\nAt the Publisher's request, this title is being sold without Digital Rights Management Software (DRM) applied.</p>", "user_ratings": {}, "developers": [{"developer-name": "Charlie Jane Anders"}], "item_content_type": "ebook"}, "selfcare": {"human_name": "#Selfcare", "machine_name": "selfcare", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Tor Books", "publisher-url": "https://torpublishinggroup.com/"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 18.0}, "subtitle_html": null, "description_text": "<p><b>From the Lambda award-winning author of <i>Autonomous</i> comes Annalee Newitz's Tor.com Original short story, \"#Selfcare\"</b>\n\n In a near-future San Francisco where the gig economy has made work more precarious than ever, Edwina is an average twenty-something scrambling to hold down her job with a major skin care brand. Until her awful boss does something you should never do‚Äîangers the fae on social media‚Äîand the struggles of her job take on an even nastier shade.\n\nAt the Publisher's request, this title is being sold without Digital Rights Management Software (DRM) applied.</p>", "user_ratings": {}, "developers": [{"developer-name": "Annalee Newitz"}], "item_content_type": "ebook"}, "dreamsbiggerthanheartbreakunstoppable_book2": {"human_name": "Dreams Bigger Than Heartbreak:\nUnstoppable, Book 2", "machine_name": "dreamsbiggerthanheartbreakunstoppable_book2", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Tor Teen", "publisher-url": "https://torpublishinggroup.com/"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 18.0}, "subtitle_html": null, "description_text": "<p><b>From the international bestselling author of <i>All the Birds in the Sky</i>, Charlie Jane Anders, comes <i>Dreams Bigger Than Heartbreak</i>, the sequel to <i>Victories Greater Than Death</i> in the thrilling adventure Unstoppable series.</b>\n\n<b>They'll do anything to be the people they were meant to be ‚Äî even journey into the heart of evil.</b>\n\n<b>Rachael Townsend</b> is the first artist ever to leave Earth and journey out into the galaxy ‚Äî but after an encounter with an alien artifact, she can't make art at all. \n\n<b>Elza Monteiro</b> is determined to be the first human to venture inside the Palace of Scented Tears and compete for the chance to become a princess ‚Äî except that inside the palace, she finds the last person she ever wanted to see again. \n\n<b>Tina Mains</b> is studying at the Royal Space Academy with her friends, but she's not the badass space hero everyone was expecting. \n\nSoon Rachael is journeying into a dark void, Elza is on a deadly spy mission, and Tina is facing an impossible choice that could change all her friends lives forever.\n\nAt the Publisher's request, this title is being sold without Digital Rights Management Software (DRM) applied.</p>", "user_ratings": {}, "developers": [{"developer-name": "Charlie Jane Anders"}], "item_content_type": "ebook"}, "lessonsinmagicanddisaster": {"human_name": "Lessons in Magic and Disaster", "machine_name": "lessonsinmagicanddisaster", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Tor Books", "publisher-url": "https://torpublishinggroup.com/"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 10.0}, "subtitle_html": null, "description_text": "<p><b>In the vein of Alice Hoffman and Charlie Jane Anders's own <i>All the Birds in the Sky</i> comes a novel full of love, disaster, and magic. </b>\n\n<i>A young witch teaches her mother how to do magic--with very unexpected results--in this relatable, resonant novel about family, identity, and the power of love.\n</i>\nJamie is the average New England academic in-training--she has a strong queer relationship, generational trauma, and an esoteric dissertation proposal. But she has one extraordinary secret: she's also a powerful witch.\n\nSerena, Jamie's mother, has been hiding from the world in an old one-room schoolhouse for several years, grieving the death of her wife and the simultaneous explosion in her professional life. All she has left are memories.\n\nJamie‚Äôs busy digging into a three-hundred-year-old magical book, but she still finds time to teach Serena to cast spells and help her come out of her shell. But Jamie doesn't know the whole story of what happened to her mom years ago, and those secrets are leading Serena down a destructive path.\n\nNow it's up to this grad student and literature nerd to understand the secrets behind this mysterious novel from 1749, unearth a long-buried scandal hinted therein, and learn the true nature of magic, before her mother ruins both of their lives.\n\nAt the Publisher's request, this title is being sold without Digital Rights Management Software (DRM) applied.</p>", "user_ratings": {}, "developers": [{"developer-name": "Charlie Jane Anders"}], "item_content_type": "ebook"}, "automaticnoodle_ebook": {"human_name": "Automatic Noodle", "machine_name": "automaticnoodle_ebook", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Tordotcom", "publisher-url": "https://torpublishinggroup.com/"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 10.0}, "subtitle_html": null, "description_text": "<p><b>A cozy near-future novella about a crew of leftover robots opening their very own noodle shop, from acclaimed sci-fi author Annalee Newitz.</b>\n\n<b>An instant <i>USA Today </i>and indie bestseller!</b>\n\n<b>Indie Next pick | Library Reads pick | Best of the Year at <i>Elle, </i>Gizmodo, Reactor, <i>Library Journal</i>, and more!\n</b>\nYou don‚Äôt have to eat food to know the way to a city‚Äôs heart is through its stomach. So when a group of deactivated robots come back online in an abandoned ghost kitchen, they decide to make their own way doing what they know: making food‚Äîthe tastiest hand-pulled noodles around‚Äîfor the humans of San Francisco, who are recovering from a devastating war.\n\nBut when their robot-run business starts causing a stir, a targeted wave of one-star reviews threatens to boil over into a crisis. To keep their doors open, they‚Äôll have to call on their customers, their community, and each other‚Äîand find a way to survive and thrive in a world that wasn‚Äôt built for them.\n\nAt the Publisher's request, this title is being sold without Digital Rights Management Software (DRM) applied.</p>", "user_ratings": {}, "developers": [{"developer-name": "Annalee Newitz"}], "item_content_type": "ebook"}, "neversayyoucantsurvive": {"human_name": "Never Say You Can't Survive", "machine_name": "neversayyoucantsurvive", "youtube_link": null, "callout": "<div class=\"accolades\">Winner of the 2022 Nebula Award for Best Related Work</div>", "publishers": [{"publisher-name": "Tordotcom", "publisher-url": "https://torpublishinggroup.com/"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 18.0}, "subtitle_html": null, "description_text": "<p><b>WINNER OF THE 2022 HUGO AWARD FOR BEST RELATED WORK</b>\n<b>From Charlie Jane Anders, the award-winning author of novels such as <i>All the Birds in the Sky</i> and <i>The City in the Middle of the Night</i>, this is one of the most practical guides to storytelling that you will ever read.</b>\n\nThe world is on fire.\nSo tell your story.\n\nThings are scary right now. We‚Äôre all being swept along by a tidal wave of history, and it‚Äôs easy to feel helpless. But we‚Äôre not helpless: we have minds, and imaginations, and the ability to visualize other worlds and valiant struggles. And writing can be an act of resistance that reminds us that other futures and other ways of living are possible.\n\nFull of memoir, personal anecdote, and insight about how to flourish during the present emergency, <i>Never Say You Can‚Äôt Survive</i> is the perfect manual for creativity in unprecedented times.\n\nAt the Publisher's request, this title is being sold without Digital Rights Management Software (DRM) applied.</p>", "user_ratings": {}, "developers": [{"developer-name": "Charlie Jane Anders"}], "item_content_type": "ebook"}, "victoriesgreaterthandeath_unstoppable_book1": {"human_name": "Victories Greater Than Death: \nUnstoppable, Book 1", "machine_name": "victoriesgreaterthandeath_unstoppable_book1", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Tor Teen", "publisher-url": "https://torpublishinggroup.com/"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 18.0}, "subtitle_html": null, "description_text": "<p><b><i>Outsmart Your Enemies. Outrun the Galaxy</i>.</b>\n<i>\n‚ÄúJust please, remember what I told you. Run. Don‚Äôt stop running for anything.‚Äù</i>\n\nTina never worries about being 'ordinary'--she doesn't have to, since she's known practically <i>forever</i> that she's not just Tina Mains, average teenager and beloved daughter. She's also the keeper of an interplanetary rescue beacon, and one day soon, it's going to activate, and then her dreams of saving <i>all</i> the worlds and adventuring among the stars will finally be possible. Tina's legacy, after all, is intergalactic--she is the hidden clone of a famed alien hero, left on Earth disguised as a human to give the universe another chance to defeat a terrible evil.\n\nBut when the beacon activates, it turns out that Tina's destiny isn't quite what she expected. Things are far more dangerous than she ever assumed--and everyone in the galaxy is expecting her to <i>actually be</i> the brilliant tactician and legendary savior Captain Thaoh Argentian, but Tina....is just Tina. And the Royal Fleet is losing the war, badly--the starship that found her is on the run and they barely manage to escape Earth with the planet still intact.\n\nLuckily, Tina is surrounded by a crew she can trust, and her best friend Rachel, and she is still determined to save all the worlds. But first she'll have to save herself.\n\n<i>Buckle up your seatbelt for this thrilling YA sci-fi adventure set against an intergalactic war from internationally bestselling author Charlie Jane Anders.</i>\n\nAt the Publisher's request, this title is being sold without Digital Rights Management Software (DRM) applied.</p>", "user_ratings": {}, "developers": [{"developer-name": "Charlie Jane Anders"}], "item_content_type": "ebook"}, "evengreatermistakes_stories": {"human_name": "Even Greater Mistakes: Stories", "machine_name": "evengreatermistakes_stories", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Tordotcom", "publisher-url": "https://torpublishinggroup.com/"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 18.0}, "subtitle_html": null, "description_text": "<p><b>In her short story collection, <i>Even Greater Mistakes</i>, Charlie Jane Anders upends genre cliches and revitalizes classic tropes with heartfelt and pants-wettingly funny social commentary. </b>\n\nThe woman who can see all possible futures is dating the man who can see the one and only foreordained future.\n\nA wildly popular slapstick filmmaker is drawn, against his better judgment, into working with a fascist militia, against a background of social collapse. \n\nTwo friends must embark on an Epic Quest To Capture The Weapon That Threatens The Galaxy<i>,</i> or else they‚Äôll never achieve their dream of opening a restaurant. \n\nThe stories in this collection, by their very outrageousness, achieve a heightened realism unlike any other. Anders once again proves she is one of the strongest voices in modern science fiction, the writer called by Andrew Sean Greer, ‚Äúthis generation‚Äôs Le Guin.‚Äù\n\nAt the Publisher's request, this title is being sold without Digital Rights Management Software (DRM) applied.</p>", "user_ratings": {}, "developers": [{"developer-name": "Charlie Jane Anders"}], "item_content_type": "ebook"}, "cityinthemiddleofthenight": {"human_name": "The City in the Middle of the Night", "machine_name": "cityinthemiddleofthenight", "youtube_link": null, "callout": "<div class=\"accolades\">Nominated for the 2020 Hugo & Arthur C. Clarke Awards</div>", "publishers": [{"publisher-name": "Tor Books", "publisher-url": "https://torpublishinggroup.com/"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 3.0}, "subtitle_html": null, "description_text": "<p><b>LOCUS AWARD FINALIST!</b><b>\n\n‚ÄúThis generation‚Äôs Le Guin.‚Äù ‚ÄîAndrew Sean Greer, Pulitzer Prize-winning author of <i>Less</i></b>\n\n<b>Charlie Jane Anders, the nationally bestselling author of </b><b><i>All the Birds in the Sky</i></b><b> delivers a brilliant new novel set in a hauntingly strange future with #10 <i>LA Times</i> bestseller <i>The City in the Middle of the Night.</i></b>\n\n<i>\"If you control our sleep, then you can own our dreams... And from there, it's easy to control our entire lives.\"</i>\n\nJanuary is a dying planet‚Äîdivided between a permanently frozen darkness on one side, and blazing endless sunshine on the other. Humanity clings to life, spread across two archaic cities built in the sliver of habitable dusk.\n\nBut life inside the cities is just as dangerous as the uninhabitable wastelands outside.\n\nSophie, a student and reluctant revolutionary, is supposed to be dead after being exiled into the night. Saved only by forming an unusual bond with the enigmatic beasts who roam the ice, Sophie vows to stay hidden from the world, hoping she can heal. \n\nBut fate has other plans‚Äîand Sophie's ensuing odyssey and the ragtag family she finds will change the entire world.\n\nAt the Publisher's request, this title is being sold without Digital Rights Management Software (DRM) applied.</p>", "user_ratings": {}, "developers": [{"developer-name": "Charlie Jane Anders"}], "item_content_type": "ebook"}, "autonomous": {"human_name": "Autonomous", "machine_name": "autonomous", "youtube_link": null, "callout": "<div class=\"accolades\">Winner of the 2018 Lambda Literary Award</div>", "publishers": [{"publisher-name": "Tor Books", "publisher-url": "https://torpublishinggroup.com/"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 3.0}, "subtitle_html": null, "description_text": "<p><b>\"</b><i><b>Autonomous</b></i><b> is to biotech and AI what </b><i><b>Neuromancer </b></i><b>was to the Internet.\"‚ÄîNeal Stephenson</b>\n\n<b>\"Something genuinely and thrillingly new in the naturalistic, subjective, paradoxically humanistic but non-anthropomorphic depiction of bot-POV‚Äîand all in the service of vivid, solid storytelling.\"‚ÄîWilliam Gibson</b>\n\n<i>When anything can be owned, how can we be free?</i>\n\nEarth, 2144. Jack is an anti-patent scientist turned drug pirate, traversing the world in a submarine as a pharmaceutical Robin Hood, fabricating cheap scrips for poor people who can‚Äôt otherwise afford them. But her latest drug hack has left a trail of lethal overdoses as people become addicted to their work, doing repetitive tasks until they become unsafe or insane.\n\nHot on her trail, an unlikely pair: Eliasz, a brooding military agent, and his robotic partner, Paladin. As they race to stop information about the sinister origins of Jack‚Äôs drug from getting out, they begin to form an uncommonly close bond that neither of them fully understand.\n\nAnd underlying it all is one fundamental question: Is freedom possible in a culture where everything, even people, can be owned?\n\nAt the Publisher's request, this title is being sold without Digital Rights Management Software (DRM) applied.</p>", "user_ratings": {}, "developers": [{"developer-name": "Annalee Newitz"}], "item_content_type": "ebook"}}, "charity_data": {"charity_items": {"miss_major_alexander_l_lee_tgijp_black_trans_cultural_center": {"machine_name": "miss_major_alexander_l_lee_tgijp_black_trans_cultural_center", "youtube_link": null, "item_content_type": null, "subtitle_html": null, "description_text": "<span><span><em>Donations to support&nbsp;</em></span></span>Miss Major Alexander L. Lee TGIJP Black Trans Cultural Center <em>are made to <a href=\"https://support.humblebundle.com/hc/en-us/articles/205183597\" target=\"_blank\" rel=\"noopener\">PayPal Giving Fund</a>, subject to its policies.</em><span><span><em><br></em></span></span><span><br>The Miss Major Alexander L. Lee TGIJP Black Trans Cultural Center is a team of transgender, gender-variant and intersex people, inside and outside of prisons, jails, detention centers, and other locked facilities creating a united family in the struggle for survival and freedom. We work in collaboration with others to forge a culture of resistance and resilience to strengthen us for the fight against human rights abuses, imprisonment, police violence, racism, poverty, and societal pressures. We seek to create a world rooted in self-determination, freedom of expression, and gender justice.<br></span>", "human_name": "Miss Major Alexander L. Lee TGIJP Black Trans Cultural Center / Transgender Gender-Variant Intersex Justice Project (TGIJP)", "developers": [], "publishers": [], "user_ratings": {}}}}, "from_bundle": {"machine_name": "charliejaneandersannaleenewitztor_bookbundle", "tile_short_name": "Charlie Jane Anders & Annalee Newitz by TOR", "short_marketing_blurb": "Speculative fiction like you’ve never seen before", "marketing_blurb": "Get <em>Clover</em>, <em>#Selfcare</em>, <em>Autonomous</em>, and more!", "detailed_marketing_blurb": "You’ve never read sci-fi quite like this. We’ve joined forces with TOR for our latest ebook bundle, which features no less than 21 fantastic ebooks and digital shorts written by acclaimed authors Charlie Jane Anders and Annalee Newitz, co-founders of io9 and co-hosts of the Hugo-winning podcast <em>Our Opinions Are Correct</em>. Survive the dystopian corporate controlled future of Annalee Newitz’s <em>Autonomous</em>! Journey to the dark side of an alien planet in Charlie Jane Anders’ <em>The City in the Middle of the Night</em>! Follow the exploits of a vengeful mother-daughter witch duo in Anders’ <em>Lessons in Magic and Disaster</em>! Explore a post-war San Francisco with the sentient food service robots of Newitz’s <em>Automatic Noodle</em>! If you’ve been looking for a wealth of imaginative speculative fiction to add to your library, grab this bundle while you can, and support Miss Major and Alexander L. Lee’s TGIJP Black Trans Cultural Center with your purchase! ", "author": "Macmillan Publishers", "start_date|datetime": "2026-02-02T19:00:00", "end_date|datetime": "2026-02-23T19:00:00", "type": "bundle", "product_url": "/books/charlie-jane-anders-annalee-newitz-tor-books"}, "updated_at|datetime": "2026-02-03T03:46:39.814157", "first_seen_at|datetime": "2026-02-03T03:46:39.814157"}
