{"machine_name": "warhammer40000roleplaywrathglorycubicle7_bookbundle", "author": "Cubicle 7 Entertainment Ltd", "basic_data": {"eula": null, "human_name": "Humble RPG Bundle: Warhammer 40,000 Roleplay: Wrath & Glory by Cubicle 7", "detailed_marketing_blurb": "Our latest <em>Warhammer 40,000</em> bundle gives you the freedom to roleplay your way! Sit down with your friends, decide what kind of story you want to tell, and host an awesome <em>Warhammer 40,000 Roleplay: Wrath &amp; Glory</em> adventure. Download the core rulebook and additional campaigns like <em>Space Marine 2 - Purge the Swarm</em>, <em>Threat Assessment: Xenos</em> PDF, and more! Get everything you need to embark on an epic journey in the darkness of the 41st Millennium, and help support Children's Health Ireland with your purchase!<br><br><em><sub>Warhammer 40,000 Roleplay: Wrath &amp; Glory © Copyright Games Workshop Limited 2025. Warhammer 40,000 Roleplay, the Warhammer 40,000 Roleplay logo, Wrath &amp; Glory, the Wrath &amp; Glory logo, GW, Games Workshop, Space Marine, 40k, Warhammer, Warhammer 40,000, 40,000, the ‘Aquila’ Doubleheaded Eagle logo, and all associated logos, illustrations, images, names, creatures, races, vehicles, locations, weapons, characters, and the distinctive likeness thereof, are either ® or ™, and/or © Games Workshop Limited, variably registered around the world, and used under licence. Cubicle 7 Entertainment and the Cubicle 7 Entertainment logo are trademarks of Cubicle 7 Entertainment Limited. All rights reserved.</sub></em>", "short_marketing_blurb": "Bring the wrath—earn the glory", "media_type": "ebook", "description": "<p><strong>Bring the wrath—earn the glory.</strong> Our latest <em>Warhammer 40,000</em> bundle gives you the freedom to roleplay your way! Sit down with your friends, decide what kind of story you want to tell, and host an awesome <em>Warhammer 40,000 Roleplay: Wrath &amp; Glory</em> adventure. Download the core rulebook and additional campaigns like <em>Space Marine 2 - Purge the Swarm</em>, <em>Threat Assessment: Xenos</em> PDF, and more! Get everything you need to embark on an epic journey in the darkness of the 41st Millennium, and help support Children's Health Ireland with your purchase!<br><br><em><sub>Warhammer 40,000 Roleplay: Wrath &amp; Glory © Copyright Games Workshop Limited 2025. Warhammer 40,000 Roleplay, the Warhammer 40,000 Roleplay logo, Wrath &amp; Glory, the Wrath &amp; Glory logo, GW, Games Workshop, Space Marine, 40k, Warhammer, Warhammer 40,000, 40,000, the ‘Aquila’ Doubleheaded Eagle logo, and all associated logos, illustrations, images, names, creatures, races, vehicles, locations, weapons, characters, and the distinctive likeness thereof, are either ® or ™, and/or © Games Workshop Limited, variably registered around the world, and used under licence. Cubicle 7 Entertainment and the Cubicle 7 Entertainment logo are trademarks of Cubicle 7 Entertainment Limited. All rights reserved.</sub></em></p>\n<p><strong>Pay $1 or more.</strong> Normally, the total cost for the ebooks in this bundle is as much as $232. Here at Humble Bundle, you choose the price and increase your contribution to upgrade your bundle! This bundle has a minimum $1 purchase.</p>\n<p><strong>Read them anywhere.</strong> The ebooks in this bundle are available in PDF and ZIP formats, so they work on your computer, e-readers, iPads, cell phones, and a wide array of mobile devices! Instructions and a list of recommended reading programs can be found <a href=\"https://support.humblebundle.com/hc/articles/202712300\" rel=\"noopener\" target=\"_blank\">here</a>.</p>\n<p><strong>Support charity.</strong> Choose where the money goes - between the publisher and to support Children's Health Ireland. If you like what we do, you can leave us a Humble Tip too!</p>", "legal_disclaimer": null, "required_account_links": ["steam"], "end_time|datetime": "2025-03-22T18:00:00"}, "tier_item_data": {"warhammer40000_wrathandglory_redactedrecords": {"human_name": "Warhammer 40,000 Wrath & Glory: Redacted Records PDF", "machine_name": "warhammer40000_wrathandglory_redactedrecords", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Cubicle 7 Games", "publisher-url": "https://cubicle7games.com/redacted-records-pdf"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Confront the Perils of the Void</p><p>Explore the space hulks of the Gilead System — huge, drifting masses of ships welded together by gravity and the flames of the Warp, and home to hazard and opportunity in equal measure. Redacted Records I takes Wrath &amp; Glory games away from the relative safety of the Gilead System’s planets and out into the depths of the Void to face unimaginable danger.</p><p>This magazine-style collection of articles uncovers numerous secrets of the Gilead System, opening up new settings and antagonists for players to explore and confront, and new character options to increase Agents’ chance of surviving these new and perilous situations.</p><p>Redacted Records includes:</p><ul><li>Insight into the diverse and terrifying space hulks of the Gilead System, from the Chaos-touched Caveat Emptor to the Genestealer-infested Dominus Vobiscum and the Orkish battleground designated Wrath of Janus.</li><li>Rules and tables to generate your own space hulk, including areas, occupants, events, and salvage.</li><li>New Frameworks for Agents from all branches of the Imperium, including the elite Adeptus Astra Telepathica.</li><li>Dozens of new Talents to enrich your Wrath &amp; Glory games.</li><li>Reports on the strange Servitor patterns of the Gilead System, including the corrupted butcher-servitors of the Abattoir of the Luminous Emperor.</li><li>Dossiers on some of the sinister cults of Avachrus and Nethreus, to further imperil your Agents</li></ul>", "user_ratings": {}, "developers": [{"developer-name": "Oliver Darkshire, Michael Duxbury, Cat Evans, Chris Edwards, Thurston Hillman, Jude Reid", "developer-url": "https://cubicle7games.com"}], "item_content_type": "ebook"}, "warhammer40000wrathandglory_threatassessment_xenospdf": {"human_name": "Warhammer 40,000 Wrath & Glory: Threat Assessment: Xenos PDF", "machine_name": "warhammer40000wrathandglory_threatassessment_xenospdf", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Cubicle 7 Games", "publisher-url": "https://cubicle7games.com/warhammer-40-000-wrath-glory-threat-assessment-xenos-pdf"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Threat Assessment: Xenos contains a mass of new alien threats to challenge Agents of any Tier, and is the perfect companion to any Warhammer 40,000 Wrath &amp; Glory campaign. As well as massively expanding the Xenos factions found in the Wrath &amp; Glory Core Rulebook, this book explores newcomers to the Gilead system, including the enigmatic T’au, the voracious Kroot, and the slowly stirring Necrons whose claim to the system may be older than the Imperium itself.</p><p>Threat Assessment: Xenos is the first in a collection of bestiaries for Wrath &amp; and Glory, containing a wealth of new and exciting GM information and deadly enemies. The book includes:</p><ul><li>New rules for lethal battlezone hazards to surprise your Agents</li><li>Profiles for the ancient Aeldari, including Asuryani, Harlequins, Corsairs, and Drukhari.</li><li>Enough rampaging Orks to start a WAAAGH!</li><li>The waking Necrons, including powerful units such as Crypteks and Flayed Ones</li><li>A stranded T’au Strike Force of Fire Warriors, Drones, Crisis Suits, and more.</li><li>A full Kroot mercenary company, and their attendant beasts</li><li>Insidious hybrids of the Genestealer Cults, paving the way for their true masters to descend from the stars</li><li>Threat Assessment: Xenos is an essential purchase for the Wrath and Glory line, massively expanding a GM’s arsenal of Threats with carefully crafted stat blocks for a host of factions.</li></ul>", "user_ratings": {}, "developers": [{"developer-name": "Christopher Colston, Michael Duxbury, Chris Edwards, Chris Handley, Travis Legge, Ciarán O’Brien, Sven Truckenbrodt", "developer-url": "https://cubicle7games.com"}], "item_content_type": "ebook"}, "warhammer40000wrathandglory_onthewingsofvalkyriespdf": {"human_name": "Warhammer 40,000 Wrath & Glory: On The Wings of Valkyries PDF", "machine_name": "warhammer40000wrathandglory_onthewingsofvalkyriespdf", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Cubicle 7 Games", "publisher-url": "https://cubicle7games.com/wrath-glory-on-the-wings-of-valkyries-pdf"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 15.0}, "subtitle_html": null, "description_text": "<p>Rebuke the witch, cleanse the sanctuary, reclaim the spire.</p><p>Heretic traitors hold the Hive Spire of Tora Armis, in the heart of Gilead Primus. While the Astra Militarum fight tooth and nail for the outer districts, an elite Imperial strike team forges deeper into the spire in pursuit of the witch Raurok the Herald and his twisted acolytes. In a spire overwhelmed by corruption, the Agents’ only allies are a gang of hive scum; not much support, against a hive full of twisted heretics.</p><p>Raurok, a sorcerer in service to the Plague God, is not long for this world, but his death is a sacrifice that welcomes in the Ruinous Powers. Can the strike team face down the Daemonic threat he’ll summon?</p><p>The second of four battlefield adventures set during the battle for Tora Armis, On the Wings of Valkyries is a Tier-2 scenario for a group of Imperial Agents acting as a specialist strike team. The next part, Lord of the Spire, will feature the exploits of Tier-3 characters on the same battlefield.</p>", "user_ratings": {}, "developers": [{"developer-name": "Martin Lloyd", "developer-url": "https://cubicle7games.com"}], "item_content_type": "ebook"}, "warhammer40000wrathandglory_brasstaxpdf": {"human_name": "Warhammer 40,000 Wrath & Glory: Brass Tax PDF", "machine_name": "warhammer40000wrathandglory_brasstaxpdf", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Cubicle 7 Games", "publisher-url": "https://cubicle7games.com/wrath-glory-brass-tax-pdf"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 15.0}, "subtitle_html": null, "description_text": "<p>Centuries ago, the Absolvers swore to defend Gilead. Like any vow made by this Chapter of the Adeptus Astartes, they will follow that promise to its bitter end. Though the system is caught in the grip of the merciless Cicatrix Maledictum, isolated from the Imperium at large, and with little chance of either escape or reinforcement, the Absolvers have not swayed from this course. They have bolstered the beleaguered system’s defences impressively, but mighty as they are, these stalwart defenders of the Imperium are stretched thin.</p><p>So it is that the Absolvers 10th Company, their neophyte Scouts, have been tasked with missions that, in ordinary times, would almost certainly demand the attention of a tactical squad of full fledged battle brothers. On the world of Enoch, an illicit trade in relic bolter shells has ever been a concern for the Chapter. With ammunition in ever shorter supply in the Gilead System, this trade has become more than a mere annoyance.</p><p>Brass Tax is an adventure for Wrath and Glory, and comes with four pre-generated character profiles, though players are encouraged to create their own Space Marine Scout Squad using the Wrath and Glory Core Rulebook.</p>", "user_ratings": {}, "developers": [{"developer-name": "Pádraig Murphy", "developer-url": "https://cubicle7games.com"}], "item_content_type": "ebook"}, "warhammer40000wrathandglory_startersetpdf": {"human_name": "Warhammer 40,000 Wrath & Glory: Starter Set", "machine_name": "warhammer40000wrathandglory_startersetpdf", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Cubicle 7 Games", "publisher-url": "https://cubicle7games.com/warhammer-40000-wrath-and-glory-starter-set-pdf"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>The Wrath and Glory Starter Set contains everything you need to begin roleplaying action packed adventures in the world of Warhammer 40,000. Whether this is your first tabletop roleplaying game, or you are an experienced Gamemaster, this exciting boxed set is the perfect starting point for anyone interested in Wrath and Glory. The Starter Set includes:</p><p>Traitor’s Hymn, a 48 page adventure set aboard the Varonius Flotilla, the beleaguered flotilla of ships intended to relieve the system, but which is now trapped in Gilead along with the rest of the system’s denizens. The adventure teaches you and your friends how to play — no prep required.</p><p>The Varonius Flotilla, a guide to the ships, crew, and brutal internal politics of the fleet lead to Gilead by the Rogue Trader Jakel Varonius. Packed with NPCs, plot hooks, one page adventures and detailed ports of call around the system, this is the perfect way to continue your Wrath and Glory campaign.</p><p>An thrilling introduction to the Gilead System, the exciting setting of Wrath and Glory</p><p>6 gatefold character sheets with pre-generated characters, each with their own goals, background, and connections.</p><p>Three two-sided rules reference sheets with summaries of important rules and combat.</p><p>Tokens for tracking Wrath, Glory, and Ruin.</p><p>A set of 8, six-sided dice, including one unique Wrath Die.</p>", "user_ratings": {}, "developers": [{"developer-name": "Christopher Colston, Zak Dale-Clutterbuck, Oliver Darkshire, Michael Duxbury, Cat Evans, Kai Linder, Eleanor Hingley, Elaine Lithgow, Sarah Madsen, Pádraig Murphy, Sven Truckenbrodtw, Pádraig Murphy", "developer-url": "https://cubicle7games.com"}], "item_content_type": "ebook"}, "warhammer40000wrathandglory_rainofmercypdf": {"human_name": "Warhammer 40,000 Wrath & Glory: Rain of Mercy PDF", "machine_name": "warhammer40000wrathandglory_rainofmercypdf", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Cubicle 7 Games", "publisher-url": "https://cubicle7games.com/wrath-glory-rain-of-mercy-pdf"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 1.0}, "subtitle_html": null, "description_text": "<p>Rain of Mercy is an entertaining introduction to the grim darkness of the 41st Millennium and Warhammer 40,000 Roleplay: Wrath &amp; Glory. The booklet —originally available only as part of Free RPG Day — is a short primer on the world of Warhammer 40,000, the glorious Imperium and its many foes, and the forsaken Gilead System trapped by the Great Rift. It also includes an action-packed adventure using simplified game rules so you can start playing immediately.</p><p>Rumours abound in the shrine world of an Imperial Saint emerging majestically from the wretched conditions of Holy Enoch’s appalling refugee camps. Can you navigate a treacherous town run by water-selling gangs? Is the Saint a pious vessel for the Emperor’s will, or a perfidious Psyker manipulating the populace?</p><p>Employed as judge, jury, and executioner by the Imperium’s representatives on a troubled world fraught with danger and wracked by the Great Rift’s malignant forces — what choices will you and your party make in these perilous conditions?</p>", "user_ratings": {}, "developers": [{"developer-name": "Zak Dale-Clutterbuck, TS Luikart", "developer-url": "https://cubicle7games.com"}], "item_content_type": "ebook"}, "warhammer40000wrathandglory_gamemastersscreenpdf": {"human_name": "Warhammer 40,000 Wrath & Glory: Gamemaster's Screen", "machine_name": "warhammer40000wrathandglory_gamemastersscreenpdf", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Cubicle 7 Games", "publisher-url": "https://cubicle7games.com/wrath-glory-gamemaster-s-screen-pdf"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>The Wrath and Glory Gamemaster’s Screen is an indispensable addition to every GM’s toolkit! The GM screen contains a wealth of information, commonly referenced rules, and an additional 32 page booklet packed with advice, NPCs, and short adventures suitable for any group.</p><p>The Gamemaster’s Screen: A three-panel GM screen with stunning artwork depicting an epic struggle between the Adepta Sororitas and Necrons of an unknown dynasty.</p><p>The interior screen contains at-a-glance references for the most used rules, perfect to keep gameplay flowing.</p><p>The Gamemaster’s Guide: A 32-page booklet packed with advice, NPCs and Adventures.</p><p>Six new, highly detailed NPCs with plot hooks and agendas, spread throughout the Gilead system, perfect for use as trusted allies or staunch foes.</p><p>Eight new adventures, two each for Tiers 1 through 4, designed to draw players into the intrigue and adventure of Wrath and Glory.</p>", "user_ratings": {}, "developers": [{"developer-name": "Zak Dale-Clutterbuck, Chris Edwards, Cat Evans, Thurston Hillman, TS Luikart, Pádraig Murphy", "developer-url": "https://cubicle7games.com"}], "item_content_type": "ebook"}, "warhammer40000wrathandglory_corerulebookpdf": {"human_name": "Warhammer 40,000 Wrath & Glory: Core Rulebook", "machine_name": "warhammer40000wrathandglory_corerulebookpdf", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Cubicle 7 Games", "publisher-url": "https://cubicle7games.com/wrath-glory-core-rulebook-pdf"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Wrath &amp; Glory is the story of the Gilead System, eight Imperial worlds cut off from the Emperor’s light by the Great Rift. The new Rulebook focuses on the Gilead System, allowing you to tell your own stories in a society beset by daemonic invasion and internal corruption.</p><p>You have a wide variety of character options for this, such as Space Marines, Sisters of Battle, Rogue Traders, Imperial Guardsmen, Tech-Priests, Inquisitors, Sanctioned Psykers, and more. The stakes are so high for everyone trapped in the system that many desperate alliances are necessary, and so you can also play Aeldari and even Ork characters too!</p><ul><li>The new Rulebook focuses on the Gilead System, allowing you to tell your own stories in a system beset by daemonic invasion and internal corruption</li><li>Character Creation has been streamlined, with a focus on Archetypes</li><li>Play as Space Marines, Sisters of Battle, Rogue Traders, Imperial Guardsmen, Tech-Priests, Inquisitors, Sanctioned Psykers, and more</li><li>Devlop and upgrade your characters by acquiring XP through gameplay, missions and achievements</li><li>Player Currenecy: Gather Wrath points to spend in advantageous situations such as re-rolling failures or adding details to the narrative to aid your party. Spend Glory points to increase your dice pool or damage done to enemies</li><li>GM Currencey: As a GM spend Ruin to hinder your players when luck has being going their way to often or shape the narrative in exciting ways</li><li>D6 Dice Pool System with easy to understand skill tests</li><li>Break free form the Imperium and play as Aeldari, Ork and Chaos. New rules for Faith, Talents, Corruption and Psyhic Powers allow for real depth of play that keeps each game exciting</li></ul>", "user_ratings": {}, "developers": [{"developer-name": "Zak Dale-Clutterbuck, Chris Handley, Eleanor Hingley, Elaine Lithgow, TS Luikart, Dominic McDowall, Jonathan Woodhouse and Ross Watson", "developer-url": "https://cubicle7games.com"}], "item_content_type": "ebook"}, "warhammer40000wrathandglory_thenullhypothesis": {"human_name": "Warhammer 40,000 Wrath & Glory: The Null Hypothesis", "machine_name": "warhammer40000wrathandglory_thenullhypothesis", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Cubicle 7 Games", "publisher-url": "https://cubicle7games.com/wrath-glory-the-null-hypothesis"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 1.0}, "subtitle_html": null, "description_text": "<p>Long ago, an unique order was founded — one that drew together a cadre of gifted outcasts and forged them into one of the Emperor’s finest tools. After His ascension to the Golden Throne this order was all but lost, shunned from greater Imperial society and related to haunt the shadowed fringes of the Imperium.</p><p>The Dispensatus Anathema has changed all that. Primarch Reborn Rouboute Guilliman has called to the Sisters of Silence, and his words were not unheeded. The Primarch’s orders have reached even the Forsaken System, and a hidden enclave has risked their very existence to answer.</p><p>The Null Hypothesis is a short adventure for Wrath and Glory, suitable for Agents of Tier 3 or above. It also includes a new Archetype, the Sister of Silence, a powerful enemy of Chaos in all its forms. Their very presence is sufficient to nullify most psychic powers, and they are anathema to all those who have been touched by the immaterium. Unfortunately, even ordinary humans have some faint connection to the warp, and find those who lack it to be disconcerting or outright loathsome.</p><p>This worries the Sisters little, however. Their ancient vows bind them tightly, and they are possessed of a higher calling. In Gilead in particular, there is much to be done.</p>", "user_ratings": {}, "developers": [{"developer-name": "Pádraig Murphy", "developer-url": "https://cubicle7games.com"}], "item_content_type": "ebook"}, "warhammer40000wrathandglory_thelordofthespirepdf": {"human_name": "Warhammer 40,000 Wrath & Glory: The Lord of the Spire PDF", "machine_name": "warhammer40000wrathandglory_thelordofthespirepdf", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Cubicle 7 Games", "publisher-url": "https://cubicle7games.com/wrath-glory-the-lord-of-the-spire-pdf"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 15.0}, "subtitle_html": null, "description_text": "<p>Breach the palace. Purge corruption. Confront the Plague Lord’s servant.</p><p>The corruption runs deep in Tora Armis. The Astra Militarum have pried the gates open and reclaimed the outer zones of the spire, but Lord Van Staten’s palace pumps out poisonous heresy like a bloated heart pumps diseased blood. A team in service to Inquisitor Tytrona Dikaisune must lead an elite military strike team into the depths of a palace infected with Nurgle’s rot, confront the daemon responsible, and stop the sickness from spreading.</p><p>The third of four battlefield adventures set during the battle for Tora Armis, Lord of the Spire is a Tier-3 scenario for a group of elite Agents seconded to assist the Inquisition. The next part, Affliction Ascendant, will feature a Tier-4 squad of Space Marines on the same battlefield.</p><p>Designed for 2 to 3 sessions of play.</p>", "user_ratings": {}, "developers": [{"developer-name": "Martin Lloyd", "developer-url": "https://cubicle7games.com"}], "item_content_type": "ebook"}, "warhammer40000wrathandglory_churchofsteelpdf": {"human_name": "Warhammer 40,000 Wrath & Glory: Church of Steel PDF", "machine_name": "warhammer40000wrathandglory_churchofsteelpdf", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Cubicle 7 Games", "publisher-url": "https://cubicle7games.com/wrath-glory-church-of-steel-pdf"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Vehicular mayhem in the 41st Millennium</p><p>Unveil the mysteries of the Machine Spirit and unleash the massive power of machines of war with Church of Steel, a comprehensive guide to vehicles in Warhammer 40,000: Wrath &amp; Glory. Within this weighty tome are rules for more than 80 vehicles from the diverse Species and Factions of the 41st Millennium, as well as narrative-focused rules for running them in your games.</p><p>Take to the Mechanicus workshop to customise your engines of destruction with a panoply of weapons and upgrades, including detailed explanations of Machine Spirits and rules for interacting with them. Build a unique history for your venerable vehicle and travel the harsh wastes of the Gilead System with story-building travel rules.</p><p>Church of Steel includes:</p><ul><li>A detailed exploration of the Adeptus Mechanicus and the Machine Cult in the Gilead System as well as the reverence other factions have for their vehicles.</li><li>Rules for customising a vehicle’s appearance and quirks and building a rich history of its exploits.</li><li>Information on the nature of Machine Spirits in the Imperial vehicles as well as how xenos species view their vehicles.Guidance for incorporating travel into your games, from interplanetary voyages to treks across planetary wasteland and slogs across massive hive cities.</li><li>Rules for vehicle actions, interactions, and complications in and out of combat.</li><li>Customisation options for upgrading vehicle performance, adding new wargear, and installing weapons.</li><li>Stats for dozens of vehicles from tanks, to troop carriers, to personal flyers, including a section on Necron vehicles and the mysterious living metal necrodermis.</li><li>Rules fo vehicular weaponry and wargear, including massive battle cannons, deadly melee weapons, and powerful means of protection.</li></ul>", "user_ratings": {}, "developers": [{"developer-name": "Zak Dale-Clutterbuck, Cat Evans, Cody Faulk, Thurston Hillman, TS Luikart, Pádraig Murphy, Judith Reid", "developer-url": "https://cubicle7games.com"}], "item_content_type": "ebook"}, "warhammer40000wrathandglory_departmentomunitorumshotgunspdf": {"human_name": "Warhammer 40,000 Wrath & Glory: Departmento Munitorum Shotguns PDF", "machine_name": "warhammer40000wrathandglory_departmentomunitorumshotgunspdf", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Cubicle 7 Games", "publisher-url": "https://cubicle7games.com/wrath-glory-departmento-munitorum-shotguns"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>As a multitude of threats extend their malignant tendrils across the beleaguered Gilead System, the last bulwark of humanity stands in determined defiance, for in the grim dark future there is only war.</p><p>In these increasingly dark and uncertain times many of the Emperor’s faithful turn to their most trusted and inviolable instruments of faith. While the mighty Astartes and the honourable Sisters Sororitas bring their fury to the Imperium’s many foes by means of the mighty Bolter or with cleansing, sacred flame, the ordinary Imperial citizen must turn to the more readily available weaponry in their defence of the Gilead System.</p><p>From the Data-Archives of Arc Logis Byn XVII, Monitor Malevolus of the great forge world of Avachrus, comes Departmento Munitorum: Shotguns. A comprehensive and detailed guide to the plethora of Shotgun variants and ammunition types for this most ancient weapon, found across the Gilead System. This pdf contains:</p><p>An introduction from Arch Logis Byn XVII of Avachrus.</p><p>New Shotguns unique to the Gilead System, including the devastating Avachrus “Gravefiller” and the esoteric Enochian Sanctified Shotgun!</p><p>New Ammunition types, some carefully loaded with powder, shot, and prayer by the trembling hand of decrepit priests, others hastily stamped out by vast manufactoums to satisfy Gilead’s endless hunger for lethal ordinance.</p><p>From the commonly used Mk V pattern shotgun found throughout the Varonius Flotilla, to the deadly Netherian Penetrators used in the darkened service shafts that permeate the great domed cities, in the austere silence of long abandoned Hulks to the frenzied disorder of boarding actions, the humble Shotgun excels in bringing the fury of humanity to the Imperiums enemies.</p><p>This PDF is the perfect addition to any Wrath &amp; Glory game, offering a multitude of new weapons for players with the Imperium keywords, useful to both Agents or GMs seeking new methods to unleash the Emperors wrath on their foes in the fight for the Gilead System.</p>", "user_ratings": {}, "developers": [{"developer-name": "Christopher Colston, Vincent Burke", "developer-url": "https://cubicle7games.com"}], "item_content_type": "ebook"}, "warhammer40000wrathandglory_spacemarine2_purgetheswarm": {"human_name": "Warhammer 40,000 Wrath & Glory: Space Marine 2 - Purge the Swarm", "machine_name": "warhammer40000wrathandglory_spacemarine2_purgetheswarm", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Cubicle 7 Games", "publisher-url": "https://cubicle7games.com/warhammer-40-000-wrath-glory-space-marine-2-purge-the-swarm"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>“Swarming from beyond the galaxy itself, in the cold void between the stars, come the Tyranids. A slavering brood of horrors, the Tyranids are driven forward by a gestalt consciousness known as the Hive Mind, with only one goal: to consume.”</p><p>We’ve got an incredible release today, a tie-in PDF for Saber Interactive’s hit videogame — Warhammer 40,000 Roleplay: Space Marine 2: Purge the Swarm! Designed to provide an easy introduction to Wrath &amp; Glory for players coming from the videogame, Purge the Swarm is packed with locations and characters for use in your games, including:</p><ul><li>Stats and lore for the three Space Marine heroes, the heroic Titus, Gadriel, and Chairon.</li><li>New hazards from the planets of Kadaku, a lethal death world made all the more terrifying by invading Tyranids and Avarax, a chaotic urban sprawl slowly being lost to the insidious influence of Chaos, two of the key locations from the game.</li><li>Exclusive missions to aid in the Ultramarines fight for the Recidious System, including the recovery of precious Space Marine gene-seed.</li><li>Iconic Tyranid threats, including Gaunts, Warriors, Carnifexes, and more, appearing in Wrath &amp; Glory for the first time!</li><li>This epic PDF is available now for purchase, so take up your chainsword, swear your oath to the Emperor and fight alongside the Ultramarines and their legendary champion Lieutenant Titus!</li></ul>", "user_ratings": {}, "developers": [{"developer-name": "Ciarán O'Brien, Pádraig Murphy, Calum Collins", "developer-url": "https://cubicle7games.com"}], "item_content_type": "ebook"}, "warhammer40000wrathandglory_gutshivaskommandospdf": {"human_name": "Warhammer 40,000 Wrath & Glory: Gutshiva's Kommandos PDF", "machine_name": "warhammer40000wrathandglory_gutshivaskommandospdf", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Cubicle 7 Games", "publisher-url": "https://cubicle7games.com/wrath-glory-gutshiva-s-kommandos-pdf"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>The Ork Freebooter Kaptin Goldteef has a plan — build a big Rok, pack in all the Orks he can, and send it screaming into the heart of Gilead. Most Orks agree this is a pretty good plan, but with room for improvement.</p><p>The Ork Kommando Gutshiva and his boyz like Da Rok, but don’t like how long it’s taking to launch. They want to do what Kommandos do best — infiltrate behind enemy lines and blow up as much of stuff as possible as quickly as possible. Unwilling to wait any longer, Gutshiva paid good teef to Mek ‘Edspannerz to use his teleporta’, launching his own assault on Gilead Primus. Unfortunately, not everything has gone according to plan…</p><p>Gutshiva’s Kommandos is a supplement for Warhammer 40,000 Roleplay: Wrath &amp; Glory designed for a group of kunnin’ Ork Agents willing to take on everything a ‘umie hive has to offer. It contains seven new NPCs, with detailed descriptions and plot hooks to engage even the most unruly of Orks. Each Ork NPC also comes with their own special Loyalty Mission, something they won’t risk trusting the Agents with until they’ve proven themselves to be proper Orks.</p><p>Gutshiva’s Kommandos can also be used for games featuring Imperial Agents, as Gutshiva and his boyz make ideal enemies for Tier 2-3 Agents of the Imperium. Defend Hive Gulgatha and put a stop to Gutshiva’s endless sabotage before a small Ork incursion turns into a full blown Waaagh!</p>", "user_ratings": {}, "developers": [{"developer-name": "Pádraig Murphy", "developer-url": "https://cubicle7games.com"}], "item_content_type": "ebook"}, "warhammer40000wrathandglory_litaniesofthelostpdf": {"human_name": "Warhammer 40,000 Wrath & Glory: Litanies of the Lost", "machine_name": "warhammer40000wrathandglory_litaniesofthelostpdf", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Cubicle 7 Games", "publisher-url": "https://cubicle7games.com/wrath-glory-litanies-of-the-lost-pdf"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>FOUR GRIM ADVENTURES IN THE DARKNESS OF IMPERIUM NIHILUS</p><p>Bathed in the corrupt light of the Great Rift, the Gilead System is rife with peril. Vile xenos assail humanity from all sides, internecine strife between the factions of the Imperium threaten a catastrophic civil war, and daemonic entities penetrate reality from Cicatrix Maledictum.</p><p>Discover devious plots and unravel murderous mysteries amongst feuding faiths on the agri world of Ostia. Investigate tech heresy, mechanical misdemeanours, and arcane rituals amongst the manufactora of the forge world Avachrus. Protect the holy shrine world of Enoch from enemies without, and traitors within.</p><p>Litanies of the Lost contains four exciting scenarios suitable for Wrath &amp; Glory characters of Tiers 1 and 2. These can be played as entertaining stand-alone adventures, or combined into a perilous planet-hopping campaign that highlights the political strife and myriad dangers present in the Gilead System.</p><p>Litanies of the Lost includes:</p><ul><li>Duty Beyond Death: something has gone nightmarishly wrong at the Pakthertius Servitor Manufactorum — investigate to discover its arcane technological secrets, and try to be the first to emerge alive!</li><li>Dark Bidding: a clandestine contract to procure a stolen stasis coffin with mysterious contents leads the party deep into the mechanical bowels of the Adeptus Mechanicus’s underworld.</li><li>Grim Harvest: a spate of strange deaths at an agri world mega-acreage threatens its crucial crops, but the source may be more sinister than the frictions between the competing Imperial factions in the area.</li><li>Vow of Silence: an investigation of potential heretical activity at a silent monastery goes awry when some unexpected — and murderous — guests arrive.</li></ul>", "user_ratings": {}, "developers": [{"developer-name": "Michael Duxbury, Thurston Hillman, Elaine Lithgow, David Whitworth", "developer-url": "https://cubicle7games.com"}], "item_content_type": "ebook"}, "childrenshealthireland": {"human_name": "Children's Health Ireland", "machine_name": "childrenshealthireland", "youtube_link": null, "callout": null, "publishers": [], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "subtitle_html": null, "description_text": "<em>Donations to support Children's Health Ireland are made to &nbsp;<a href=\"https://support.humblebundle.com/hc/en-us/articles/205183597\" target=\"_blank\" rel=\"noopener\">PayPal Giving Fund</a>, subject to its policies.</em><br><br>Children’s Health Foundation raises vital funds to support sick children and their families in Children’s Health Ireland hospitals and urgent care centres – from funding vital life-saving equipment and providing essential patient and parental supports to making ground-breaking, pediatric research possible.", "user_ratings": {}, "developers": [{"developer-name": "Children's Health Ireland", "developer-url": "https://childrenshealthireland.ie/"}], "item_content_type": null}, "warhammer40000wrathandglory_redactedrecords2": {"human_name": "Warhammer 40,000 Wrath & Glory: Redacted Records 2", "machine_name": "warhammer40000wrathandglory_redactedrecords2", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Cubicle 7 Games", "publisher-url": "https://cubicle7games.com/warhammer-40-000-wrath-glory-redacted-records-2-pdf"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>When shields sunder, and weapons falter, only faith endures. Step into the embattled Gilead System, a forsaken haven of Humanity amidst the writhing Chaos of the Cicatrix Maledictum. Wield the sacred Motive Force to flay your foes as an Electro-Priest, or take up the Emperor’s blessed arms and wage war in His name, as a Sister Dogmata.</p><p>Redacted Records II is an invaluable resource for players and Gamemasters alike, suffused with scriptures of righteous destruction and technological liturgies to empower your games of Wrath &amp; Glory with an abundance of new ways to play. The book is packed with eight fervent new archetypes from the Adeptus Mechanicus and Adeptus Sororitas, powerful holy relics, hallowed locations, and a host of new Talents for players to customise their characters.</p><p>Redacted Records II is a treasure trove of content for games of Wrath &amp; Glory, featuring:</p><ul><li>Rules for generating unique ancient items of myriad forms and functions, perfect for Gamemasters that want to create blessed artefacts or malign relics of terrible power.</li><li>8 ready-to-play Archetypes from the Adeptus Mechanicus and Adeptus Ministorum</li><li>A collection of sacred Shrines across the Gilead System, each with a built-in adventure and a mysterious secret.</li><li>Patrons for the Ecclesiarchy and Adeptus Mechanicus, each with their own engaging missions in the spiritual battlegrounds of the Gilead System.</li><li>Expanded Ascension Packages for the triumphant faithful, Talents for character customisation, and blessed Wargear — a wealth of material for any pious roleplayer.</li></ul>", "user_ratings": {}, "developers": [{"developer-name": "Zak Dale-Clutterbuck, Michael Duxbury, Chris Edwards, Pádraig Murphy, Ciarán O'Brien, Jude Reid", "developer-url": "https://cubicle7games.com"}], "item_content_type": "ebook"}, "warhammer40000wrathandglory_afflictionascendantpdf": {"human_name": "Warhammer 40,000 Wrath & Glory: Affliction Ascendant PDF", "machine_name": "warhammer40000wrathandglory_afflictionascendantpdf", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Cubicle 7 Games", "publisher-url": "https://cubicle7games.com/wrath-glory-affliction-ascendant-pdf"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>The battle for Tora Armis ends here.</p><p>Deep beneath the hive spire of Tora Armis, the Absolvers Space Marine chapter dispatches a squad of Primaris battle-brothers to finally purge all traces of Chaos. They know they’re chasing the Chaos Lord Putradyne Corporis, but breaching an ancient tomb reveals a still mightier foe: the Great Unclean One Botuthrax Clostidia, newly released from its prison beneath the spire. Faced with three objectives — stopping Corporis, conclusively defeating a millennia-old foe, and saving Tora Armis — the Agents must decide what they’ll sacrifice in the name of duty.</p><p>As well as the challenging conclusion to the Battlefield Adventures, Affliction Ascendant includes a new character Archetype; the First Company Veteran represents the most capable and experienced of Space Marines, those with the right to don mighty Terminator armour.</p><p>Designed for two to three sessions of play.</p>", "user_ratings": {}, "developers": [{"developer-name": "Martin Lloyd", "developer-url": "https://cubicle7games.com"}], "item_content_type": "ebook"}, "warhammer40000_wrathandglory_forsakensystemplayersguide": {"human_name": "Warhammer 40,000 Wrath & Glory: Forsaken System Player's Guide PDF", "machine_name": "warhammer40000_wrathandglory_forsakensystemplayersguide", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Cubicle 7 Games", "publisher-url": "https://cubicle7games.com/wrath-glory-forsaken-system-player-s-guide-pdf"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>EXPLORE A SYSTEM FORSAKEN BY THE GREAT RIFT</p><p>Cut off from the might of the Imperium by the Great Rift, and beset on all sides by the daemonic forces that emerge from the tear in reality, the Gilead System stands as a bastion of faith in the Emperor. Unable to call for reinforcements or escape the System, the citizens of these planets fight to preserve the Imperial Creed as they battle back the vile xenos, corrupted renegades, and foul daemons that assail them.</p><p>But even as the Imperium’s diverse factions unite in this time of desperation, the rifts between them grow. With the Emperor’s watchful gaze obscured by the Great Rift, powerful opportunists pursue their own goals, and reignite old rivalries. The grim worlds of the Gilead System are rife with intrigue, betrayal, and secretive plots.</p><p>The Forsaken System Player’s Guide contains a wealth of information for running and playing Warhammer 40,000 Roleplay: Wrath &amp; Glory, including:</p><p>Expanded information on the planets of the Gilead System, including optional backgrounds for Human characters.</p><p>Practical primers on the fractious Factions of the Gilead System, their hierarchies, and their relationships with one another.</p><p>Detailed accounts of the Patrons of the major Factions in the Gilead System, each of which has distinct Frameworks and mission ideas for your campaign.</p><p>3 new playable Species: Ogryns, Ratlings, and Kroot.</p><p>20 new playable Archetypes.</p><p>Optional rules for a system of downtime Endeavours to detail your characters’ exploits between adventures.</p>", "user_ratings": {}, "developers": [{"developer-name": "Tim Cox, Micheal Duxbury, Jeff Hall, Tim Huckelbury, Jordan Goldfarb, Thurston Hillman", "developer-url": "https://cubicle7games.com"}], "item_content_type": "ebook"}, "warhammer40000wrathandglory_bloodygatespdf": {"human_name": "Warhammer 40,000 Wrath & Glory: Bloody Gates", "machine_name": "warhammer40000wrathandglory_bloodygatespdf", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Cubicle 7 Games", "publisher-url": "https://cubicle7games.com/wrath-glory-bloody-gates-pdf"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 15.0}, "subtitle_html": null, "description_text": "<p>Storm the city, subdue the heretics, win your freedom.</p><p>Even Gilead Primus isn’t free of the scourge of heresy. Rebels have taken the Hive City of Tora Armis, and within its walls they preach filth and lies to a captive audience of Imperial citizens. The Astra Militarum and Adeptus Astartes have launched a combined operation to retake the Hive, and a group of Imperial Agents are at ground zero.</p><p>Fireteam 123-B of the Gilead Gravediggers Auxiliary Penal Brigade have one simple job: scale the dam around the Hive City, clear a kilometer-wide minefield, and breach the gates. The plan doesn’t account for the heretics’ horde of Poxwalkers, though.</p><p>Set entirely during the battle for Tora Armis, The Bloody Gates is a Tier-1 scenario for a group of characters sentenced to service in a penal legion, fighting for the slim chance they’ll earn their freedom. The sequel, On the Wings of Valkyries, will feature the exploits of Tier 2 characters on the same battlefield.</p><p>Designed for 2 to 3 sessions of play.</p>", "user_ratings": {}, "developers": [{"developer-name": "Martin Lloyd", "developer-url": "https://cubicle7games.com"}], "item_content_type": "ebook"}, "warhammer40000wrathandglory_thegraveyardshiftpdf": {"human_name": "Warhammer 40:000 Wrath & Glory - The Graveyard Shift PDF", "machine_name": "warhammer40000wrathandglory_thegraveyardshiftpdf", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Cubicle 7 Games", "publisher-url": "https://cubicle7games.com/wrath-glory-the-graveyard-shift-pdf"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 1.0}, "subtitle_html": null, "description_text": "<p>Graveyard Shift is a clandestine mission perfect for introducing players to the horrors of daily life (and death) in the 41st Millennium. Tasked by an Interrogator of the Inquisition to retrieve a dangerous xenotech artefact, the Agents explore a corpse starch production facility, encounter villainous Scum, and scour the dangerous wastes of the Boneyards before confronting the profane dangers of xenos technology.</p><p>This adventure can be played as an introduction to Wrath &amp; Glory, or inserted into an ongoing campaign in the Gilead System. The choices the Agents make in the course of this adventure are almost guaranteed to have wider repercussions, as detailed in the Resolution.</p>", "user_ratings": {}, "developers": [{"developer-name": "Robert Buckey, Zak Dale-Clutterbuck", "developer-url": "https://cubicle7games.com"}], "item_content_type": "ebook"}, "warhammer40000wrathandglory_nemesis_wretchesofthewritpdf": {"human_name": "Warhammer 40,000 Wrath & Glory: Nemesis - Wretches of the Writ PDF", "machine_name": "warhammer40000wrathandglory_nemesis_wretchesofthewritpdf", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Cubicle 7 Games", "publisher-url": "https://cubicle7games.com/warhammer-40-000-wrath-glory-nemesis-wretches-of-the-writ"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>“Only when the fury of war finally subsides and the billow of black smoke and ash clears to reveal the smouldering wastes of Gilead, then… only then… will I cut your strings”</p><p>Wretches of the Writ is a standalone PDF release that expands upon the Chaos Lord Maloquence and his vile presence within the Gilead System. Featuring detailed background information on the Dark Apostle and his dark retinue Wretches of the Writ introduces several new Chaos NPC’s and Plot Hooks that can easily be incorporated into your existing Wrath &amp; Glory campaigns or work as standalone adventures for both Chaos and Imperial aligned players.</p><p>Learn of the Dark Apostle Maloquences’ dark plans for the future of the system and how he intends to accomplish them. Explore several new locations within the Gilead Sector touched by the corrupting influence of Chaos. Wretches of the Writ features several new adventure ideas aimed at a variety of tiers presented alongside;</p><p>5 Traitorous NPC’s to unleash on the Gilead System</p><p>10 intriguing new plot hooks to integrate into your games</p><p>A unique appearance by a well known Daemon of Tzeentch</p><p>Wretches of the Writ is the perfect way to introduce the corrupting tendrils of Chaos into your Wrath &amp; Glory games, for even in the distant, isolated reaches of the Gilead System, the Galaxy MUST burn!</p>", "user_ratings": {}, "developers": [{"developer-name": "Calum Collins, Christopher Colston", "developer-url": "https://cubicle7games.com"}], "item_content_type": "ebook"}, "cubicle7_warhammer40000roleplaywrathglory_25offcoupon": {"human_name": "Cubicle 7 Webstore Discount Coupon - 25% off", "machine_name": "cubicle7_warhammer40000roleplaywrathglory_25offcoupon", "youtube_link": null, "callout": null, "publishers": [], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 1.0}, "subtitle_html": null, "description_text": "<p>Take 25% off your entire purchase at the Cubicle7 store!</p><p>NOTE: Discount must be used before April 30th, 2025. Excludes preorder and sale products.</p>", "user_ratings": {}, "developers": [{"developer-name": "Cubicle 7 Games", "developer-url": "https://cubicle7games.com"}], "item_content_type": null}}, "charity_data": {"charity_items": {"childrenshealthireland": {"machine_name": "childrenshealthireland", "youtube_link": null, "item_content_type": null, "subtitle_html": null, "description_text": "<em>Donations to support Children's Health Ireland are made to &nbsp;<a href=\"https://support.humblebundle.com/hc/en-us/articles/205183597\" target=\"_blank\" rel=\"noopener\">PayPal Giving Fund</a>, subject to its policies.</em><br><br>Children’s Health Foundation raises vital funds to support sick children and their families in Children’s Health Ireland hospitals and urgent care centres – from funding vital life-saving equipment and providing essential patient and parental supports to making ground-breaking, pediatric research possible.", "human_name": "Children's Health Ireland", "developers": [{"developer-name": "Children's Health Ireland", "developer-url": "https://childrenshealthireland.ie/"}], "publishers": [], "user_ratings": {}}}}, "from_bundle": {"machine_name": "warhammer40000roleplaywrathglorycubicle7_bookbundle", "tile_short_name": "Warhammer 40,000 Roleplay: Wrath & Glory by Cubicle 7", "short_marketing_blurb": "Bring the wrath—earn the glory", "marketing_blurb": "Get <em>Warhammer 40,000 Wrath & Glory: Starter Set PDF</em>, <em>Warhammer 40,000 Wrath & Glory: Core Rulebook PDF</em>, <em>Warhammer 40,000 Wrath & Glory: Threat Assessment: Xenos PDF</em>, and more!", "detailed_marketing_blurb": "Our latest <em>Warhammer 40,000</em> bundle gives you the freedom to roleplay your way! Sit down with your friends, decide what kind of story you want to tell, and host an awesome <em>Warhammer 40,000 Roleplay: Wrath &amp; Glory</em> adventure. Download the core rulebook and additional campaigns like <em>Space Marine 2 - Purge the Swarm</em>, <em>Threat Assessment: Xenos</em> PDF, and more! Get everything you need to embark on an epic journey in the darkness of the 41st Millennium, and help support Children's Health Ireland with your purchase!<br><br><em><sub>Warhammer 40,000 Roleplay: Wrath &amp; Glory © Copyright Games Workshop Limited 2025. Warhammer 40,000 Roleplay, the Warhammer 40,000 Roleplay logo, Wrath &amp; Glory, the Wrath &amp; Glory logo, GW, Games Workshop, Space Marine, 40k, Warhammer, Warhammer 40,000, 40,000, the ‘Aquila’ Doubleheaded Eagle logo, and all associated logos, illustrations, images, names, creatures, races, vehicles, locations, weapons, characters, and the distinctive likeness thereof, are either ® or ™, and/or © Games Workshop Limited, variably registered around the world, and used under licence. Cubicle 7 Entertainment and the Cubicle 7 Entertainment logo are trademarks of Cubicle 7 Entertainment Limited. All rights reserved.</sub></em>", "author": "Cubicle 7 Entertainment Ltd", "start_date|datetime": "2025-03-01T19:00:00", "end_date|datetime": "2025-03-22T18:00:00", "type": "bundle", "product_url": "/books/warhammer-40000-roleplay-wrath-glory-cubicle-7-books"}, "updated_at|datetime": "2025-03-02T03:09:59.819766", "first_seen_at|datetime": "2025-03-02T03:09:59.819766"}
