{"machine_name": "pathfinderprimerbundlepaizo_bookbundle", "author": "Paizo", "basic_data": {"eula": null, "human_name": "Humble RPG Bundle: Pathfinder Primer Bundle by Paizo", "detailed_marketing_blurb": "A world of adventure and danger awaits—and the only thing missing is your heroism. Gather your party of trusty companions for countless quests with our latest <em>Pathfinder</em> bundle from Paizo. Mix up your fun with the hottest <em>Pathfinder</em> TTRPG campaigns and expansions like <em>Pathfinder Second Edition Beginner Box: Remastered Edition</em>, <em>Pathfinder Player Core</em>, <em>Sky King’s Tomb Player’s Guide</em>, and more. Get everything you need to embark on an epic high-fantasy journey together, and help support Take This! with your purchase!", "short_marketing_blurb": "Forge your own high-fantasy adventures", "media_type": "ebook", "description": "<p><strong>Forge your own high-fantasy adventures.</strong> A world of adventure and danger awaits—and the only thing missing is your heroism. Gather your party of trusty companions for countless quests with our latest <em>Pathfinder</em> bundle from Paizo. Mix up your fun with the hottest <em>Pathfinder</em> TTRPG campaigns and expansions like <em>Pathfinder Second Edition Beginner Box: Remastered Edition</em>, <em>Pathfinder Player Core</em>, <em>Sky King’s Tomb Player’s Guide</em>, and more. Get everything you need to embark on an epic high-fantasy journey together, and help support Take This! with your purchase!</p>\n<p><strong>Pay $5 or more.</strong> Normally, the total cost for the ebooks in this bundle is as much as $438. Here at Humble Bundle, you choose the price and increase your contribution to upgrade your bundle! This bundle has a minimum $5 purchase. Pay $5 or more to access keys.</p>\n<p><strong>Redeem your keys.</strong> <span>The ebooks in this bundle can be redeemed on the <a href=\"https://paizo.com/\">Paizo website</a>.&nbsp;</span></p>\n<p><strong>Support charity.</strong> Choose where the money goes - between the publisher and to support Take This!. If you like what we do, you can leave us a Humble Tip too!</p>", "legal_disclaimer": null, "required_account_links": ["steam"], "end_time|datetime": "2025-09-25T18:00:00"}, "tier_item_data": {"pathfinderplayercore2pdf": {"human_name": "Pathfinder Player Core 2 (PDF)", "machine_name": "pathfinderplayercore2pdf", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Paizo, inc.", "publisher-url": "https://paizo.com/products/btq034hx?Pathfinder-Player-Core-2"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 30.0}, "subtitle_html": null, "description_text": "<p>Survival in a world beset by magic and evil takes more than a lucky roll of the dice. Pathfinder Player Core 2 significantly expands options available to Pathfinder players, giving them the edge to take on any adventure. This 320-page hardcover rulebook remasters 8 classes from Pathfinder Second Edition, providing everything you need to create a wide array of new characters, ready to take on the world. It also includes more than 40 archetypes, expanded ancestries, and tons of feats, spells, and alchemical items to provide a near-endless array of exciting options for every Pathfinder character! The ideal character option resource for players looking to move beyond the Pathfinder Player Core.</p><p>Pathfinder Player Core 2 is the fourth core rulebook for the fully remastered Pathfinder Second Edition RPG! These rules are compatible with previous Pathfinder Second Edition rulebooks, incorporating comprehensive errata and rules updates and some of the best additions from later books into new, easier-to-access volumes with new presentations inspired by years of player feedback. Along with the Player Core, GM Core, and Monster Core, these books provide a new foundation for the future of tabletop gaming!</p><p>Pathfinder Player Core 2 includes:</p><p>• Eight fully detailed classes, including the alchemist, barbarian, champion, investigator, monk, oracle, sorcerer, and swashbuckler, each containing multiple character paths, multiclassing options, and dozens of feats!</p><ul><li> Expanded ancestry options include the catfolk, gnoll, hobgoblin, kobold, lizardfolk, ratfolk, and tengu, alongside three versatile heritages—the dhampir, duskwalker, and an all-new heritage debuting in this volume!</li><li> More than 40 archetypes, allowing you to further customize your character’s story and abilities. Turn your hero into an aerial acrobat, a high-riding cavalier, a treacherous pirate, and so much more!</li><li> Spells, alchemical items, and magic items to round out the new classes and to provide some new tricks to the classes from Pathfinder Player Core.</li><li> Fully integrated errata from the first 4 years of Pathfinder Second Edition, including a revised alchemist, champion, and oracle!</li><li> Published under the new Open RPG Creative (ORC) license, giving players and Game Masters even more freedom for making their own creations based on Pathfinder Second Edition.</li></ul>", "user_ratings": {}, "developers": [{"developer-name": "Logan Bonner, Jason Bulmahn, Stephen Radney-MacFarland, and Mark Seifter", "developer-url": "https://paizo.com/products/btq034hx?Pathfinder-Player-Core-2"}], "item_content_type": "ebook"}, "pathfinderflip-mat_crownofthekoboldkingpdfandjpg": {"human_name": "Pathfinder Flip-Mat: Crown of the Kobold King (PDF/JPG)", "machine_name": "pathfinderflip-mat_crownofthekoboldkingpdfandjpg", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Paizo, inc.", "publisher-url": "https://paizo.com/products/btq02ash"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 15.0}, "subtitle_html": null, "description_text": "<p>What secrets and dangers lie hidden within the walls of this ancient ruin or this remote boneyard? Pathfinder Flip-Mat: Crown of the Kobold King presents the ruins of an ancient dwarven monastery on one side and a rural cemetery on the other, both of which are significant encounter locations for the new Crown of the Kobold King Anniversary Edition hardcover adventure!</p><p>A special coating on each Flip-Mat allows you to use wet erase, dry erase, AND permanent markers with ease! Removing permanent ink is easy—simply trace over any permanent mark with a dry erase marker, wait 10 seconds, then wipe off both marks with a dry cloth or paper towel. Each Flip-Mat measures 24\"\" x 30\"\" unfolded, and 8\"\" x 10\"\" folded.</p>", "user_ratings": {}, "developers": [], "item_content_type": "ebook"}, "pathfinderflip-mat_junglemulti-pack": {"human_name": "Pathfinder Flip-Mat: Jungle Multi-Pack (PDF/JPG)", "machine_name": "pathfinderflip-mat_junglemulti-pack", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Paizo, inc.", "publisher-url": "https://paizo.com/products/btq02ao5"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 15.0}, "subtitle_html": null, "description_text": "<p>What forgotten mysteries and deadly perils await in the depths of the jungle? No Game Master wants to put the action on pause to draw every overgrown ruin or tangle of tropical trees. Fortunately, you don’t have to! Pathfinder Flip-Mats provide ready-to-use and captivatingly detailed fantasy set pieces for the busy Game Master. Whether the heroes seek to explore an overgrown ruin, navigate a twisting pathway, discover a hidden waterfall, or seek shelter in a local village, these jungle scenes have you covered with four different combat maps in all! Don't waste your time sketching when you could be playing. With Pathfinder Flip-Mat: Jungle Multi-Pack, you’ll be ready next time your players head into the jungle!</p>", "user_ratings": {}, "developers": [{"developer-name": "Jason Engle", "developer-url": "https://paizo.com/products/btq02ao5"}], "item_content_type": "ebook"}, "pathfinderadventurepath_cultofthecavewormskykingstomb2of3pdf": {"human_name": "Pathfinder Adventure Path: Cult of the Cave Worm (Sky King's Tomb 2 of 3)(PDF)", "machine_name": "pathfinderadventurepath_cultofthecavewormskykingstomb2of3pdf", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Paizo, inc.", "publisher-url": "https://paizo.com/products/btq02ebj?Pathfinder-Adventure-Path-194-Cult-of-the-Cave-Worm"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 30.0}, "subtitle_html": null, "description_text": "<p>Finding a legendary tomb requires tracking an equally legendary cave worm said to dwell there. As the adventurers set out from Highhelm, they must brave the Darklands’ dangers, navigate a treacherous fey city, and recover the relic that retraces the cave worm’s path. Yet in doing so, they learn of nefarious rivals who also seek the tomb—rivals the adventurers might stop by infiltrating an unforgiving underground metropolis.</p><p>Cult of the Cave Worm is a Pathfinder adventure for four 5th-level characters, continuing the Sky King’s Tomb Adventure Path, a three-part monthly campaign in which a group of adventurers travel deep underground to discover a legendary dwarven king’s tomb, seek subterranean treasures, and heal millennia-old injustices—all while stopping an ambitious villain from weaponizing those same discoveries. This adventure also includes a study of cave worm ecology, a gazetteer of the underground dwarven city of Hagegraf, potent relics, and several monsters to threaten underground explorers.</p>", "user_ratings": {}, "developers": [{"developer-name": "Scott D. Young", "developer-url": "https://paizo.com/products/btq02ebj?Pathfinder-Adventure-Path-194-Cult-of-the-Cave-Worm"}], "item_content_type": "ebook"}, "pathfinderadventure_crownofthekoboldkinganniversaryeditionpdf": {"human_name": "Pathfinder Adventure: Crown of the Kobold King Anniversary Edition (PDF)", "machine_name": "pathfinderadventure_crownofthekoboldkinganniversaryeditionpdf", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Paizo, inc.", "publisher-url": "https://paizo.com/products/btq02e4g?Pathfinder-Adventure-Crown-of-the-Kobold-King"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 15.0}, "subtitle_html": null, "description_text": "<p>Celebrate Paizo’s 20th Anniversary with a glorious new edition of Crown of the Kobold King, the epic original Pathfinder adventure! The town of Falcon’s Hollow is no stranger to peril, yet the danger growing in the dungeons below a nearby ruin pose a threat that only a new band of heroes can face. Ravenous undead, cunning kobolds, and sinister necromancers are but a few of the foes that shall soon menace the small lumber town, yet none are potentially as dangerous as the Kobold King himself!</p><p>This deluxe, 128-page hardcover gathers three classic Pathfinder adventures into one unforgettable compilation, expanding them into a mini-campaign and introducing a brand-new dungeon level for heroes to explore. Completely updated to Pathfinder Second Edition, the insidious Kobold King and his minions return to bedevil a new generation of adventurers! Will your heroes save the town of Falcon’s Hollow from the Kobold King, or are they doomed to become the king’s latest trophies?</p><p>The Crown of the Kobold King contains:</p><p>• The original adventures Hollow’s Last Hope, Crown of the Kobold King, and Hungry are the Dead, all expanded and updated for use with Pathfinder Second Edition.</p><ul><li> Over a hundred pages of adventure for 1st to 6th-level parties.</li><li> A full gazetteer of the lumber town of Falcon’s Hollow.</li><li> Fifteen new magic items and other new treasures to discover.</li><li> Eight classic monsters from the original adventures, all brand new to Pathfinder Second Edition.</li></ul>", "user_ratings": {}, "developers": [{"developer-name": "Jason Bulmahn, Tim Hitchcock, Nicolas Logue, and F. Wesley Schneider", "developer-url": "https://paizo.com/products/btq02e4g?Pathfinder-Adventure-Crown-of-the-Kobold-King"}], "item_content_type": "ebook"}, "pathfinderadventurepath_heavyisthecrownskykingstomb3of3pdf": {"human_name": "Pathfinder Adventure Path: Heavy is the Crown (Sky King's Tomb 3 of 3)(PDF)", "machine_name": "pathfinderadventurepath_heavyisthecrownskykingstomb3of3pdf", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Paizo, inc.", "publisher-url": "https://paizo.com/products/btq02eea?Pathfinder-Adventure-Path-195-Heavy-is-the-Crown"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 30.0}, "subtitle_html": null, "description_text": "<p>For all his epic deeds, the first high king earned countless enemies, and word of his tomb’s rediscovery has gathered an eclectic army of dwarves’ ancient enemies. To preserve the tomb and save a dwarven city, the adventurers must infiltrate, splinter, and sabotage the gathering legion. Only in this chaos can the adventurers catch up to their rival at the tomb itself. The question isn’t just whether they can prevail, but whether their victory makes them worthy of the tomb’s greatest secrets.</p><p>Heavy is the Crown is a Pathfinder adventure for four 8th-level characters, concluding the Sky King’s Tomb Adventure Path, a three-part monthly campaign in which a group of adventurers travel deep underground to discover a legendary dwarven king’s tomb, seek subterranean treasures, and heal millennia-old injustices—all while stopping an ambitious villain from weaponizing those same discoveries. This adventure also includes exciting ways to continue the campaign, an overview of the subterranean Darklands, a gazetteer of a lost dwarven homeland, and fearsome creatures that prowl the darkest caves.</p>", "user_ratings": {}, "developers": [{"developer-name": "Jessica Catalan", "developer-url": "https://paizo.com/products/btq02eea?Pathfinder-Adventure-Path-195-Heavy-is-the-Crown"}], "item_content_type": "ebook"}, "pathfindercharactersheetpackpdf": {"human_name": "Pathfinder Character Sheet Pack (PDF)", "machine_name": "pathfindercharactersheetpackpdf", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Paizo, inc.", "publisher-url": "https://paizo.com/products/btq01zop"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 5.0}, "subtitle_html": null, "description_text": "<p>Create characters of legend and organize your most epic adventures with the Pathfinder Character Sheet Pack. This package includes:</p><p>A folder to store character sheets, with reference information such as game actions, a summary of crucial conditions, and death and dying rules.</p><p>A specialized character sheet for each class from the Pathfinder Core Rulebook, with class features and special actions already filled in.</p><p>One standard character sheet suitable for a character of any class.</p><p>Expanded sheets to track character inventory, campaign notes, and spells, plus a specialized sheet for animal companions and alchemy books.</p>", "user_ratings": {}, "developers": [], "item_content_type": "ebook"}, "pathfinderadventure_afistfulofflowers": {"human_name": "Pathfinder Adventure: A Fistful of Flowers (PDF)", "machine_name": "pathfinderadventure_afistfulofflowers", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Paizo, inc.", "publisher-url": "https://paizo.com/products/btq02d8f?Pathfinder-Adventure-A-Fistful-of-Flowers"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 5.0}, "subtitle_html": null, "description_text": "<p>When a stuffy noblewoman decides that leshys make for pretty centerpieces for her fancy tea party, she has no idea what sort of trouble she's stirring up. Not every plant in the forest wants to be put on display, and some of them are more than well-equipped to fight for those who are plucked from their homes!</p><p>In A Fistful of Flowers, you take on the role of one of four unique leshys—plants who have been granted sapience and wills of their own. When new sproutlings are snatched out of the woods and taken away to civilization, it's up to your band of furious flowers and pugilistic plants to set things right!</p><p>A Fistful of Flowers is a short adventure for 3rd-level characters that takes a band of leshy heroes out of the forest and into that most dangerous of locations—an aristocrat's fancy tea party. In addition, the four pregenerated characters provide a quick way to jump into the adventure right away in this exciting offering for Free RPG Day! Grab some dice and some friends and play the role of the forest's newest heroes!</p>", "user_ratings": {}, "developers": [{"developer-name": "Eleanor Ferron and Linda Zayas-Palmer", "developer-url": "https://paizo.com/products/btq02d8f?Pathfinder-Adventure-A-Fistful-of-Flowers"}], "item_content_type": "ebook"}, "pathfinderplayercorepdf": {"human_name": "Pathfinder Player Core (PDF)", "machine_name": "pathfinderplayercorepdf", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Paizo, inc.", "publisher-url": "https://paizo.com/products/btq02eoj?Pathfinder-Player-Core"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 15.0}, "subtitle_html": null, "description_text": "<p>The Pathfinder Player Core presents a new entry point to Pathfinder Second Edition, with everything a player needs to learn how to play the game! Choose from eight ancestries, eight complete character classes, and hundreds of feats and spells to make unique characters ready for deadly adventures in a world beset by magic and evil! This 464-page hardcover tome is the definitive rules resource for all Pathfinder Second Edition players!</p><p>Pathfinder Player Core is the first core rulebook for the fully remastered Pathfinder Second Edition RPG! These rules are compatible with previous Pathfinder Second Edition rulebooks, incorporating comprehensive errata and rules updates and some of the best additions from later books into new, easier-to-access volumes with new presentations inspired by years of player feedback. Along with the GM Core, Monster Core, and Player Core 2, these books provide a new foundation for the future of tabletop gaming!</p><p>Pathfinder Player Core includes:</p><p>• Easier to Learn! We’ve taken feedback from the Beginner Box and the Core Rulebook and made this new entry into the Pathfinder Roleplaying Game easier to navigate and get right into the fun.</p><ul><li> Complete character creation rules, walking you through building a character by selecting your Ancestry, Background, and Class, with a focus on the bard, cleric, druid, fighter, ranger, rogue, witch, and wizard! Core ancestry options include human, dwarf, elf, gnome, goblin, halfling, leshy, and orc!</li><li> A mountain of options allowing you to customize your character including versatile heritages, like the changeling and nephilim, skills and feats, and hundreds of spells (including dozens of new ones), ensuring that the character you build represents your hero not just in story, but in rules as well!</li><li> Everything you need to know to start playing, from advice on how to explore the world to tips on surviving deadly combats with terrifying foes.</li><li> A primer on the world of Lost Omens so that your character can be a part of an exciting and diverse world!</li><li> Rules and tools to advance your character through play, taking them from a fresh-faced adventurer ready to take on the world to a veteran hero, wielding powerful magic that can reshape reality!</li><li> Fully integrated errata from the first 4 years of Pathfinder Second Edition, including revisions to the witch, expanded options for every character class, streamlined spells, new equipment, and more!</li><li> This is the first Pathfinder product published under the new Open RPG Creative (ORC) license, giving players and Game Masters even more freedom for making their own creations based on Pathfinder Second Edition.</li></ul>", "user_ratings": {}, "developers": [{"developer-name": "Logan Bonner, Jason Bulmahn, Stephen Radney-MacFarland, and Mark Seifter", "developer-url": "https://paizo.com/products/btq02eoj?Pathfinder-Player-Core"}], "item_content_type": "ebook"}, "pathfinderbounty_soddenstories": {"human_name": "Pathfinder Bounty: Sodden Stories", "machine_name": "pathfinderbounty_soddenstories", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Paizo, inc.", "publisher-url": "https://paizo.com/products/btq02al1?Pathfinder-Bounty-17-Sodden-Stories"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 15.0}, "subtitle_html": null, "description_text": "<p>Ecmund Swiftstout was always fascinated by tales of “roughing it” in the wilderness of regions far away from the Inner Sea. Seeking to explore such places, Ecmund’s mother has hired a group of adventurers to keep her son safe during his moment of wanderlust. Now trudging through the Sodden Lands, a group of heroes must content with the dangers of the jungle while keeping tabs on the wandering dwarf. Of course, there’s something else out in the jungle, and it’s only a matter of time before it makes itself known!</p><p>A Pathfinder Bounty for level 1.</p>", "user_ratings": {}, "developers": [{"developer-name": "Michael Bramnik", "developer-url": "https://paizo.com/products/btq02al1?Pathfinder-Bounty-17-Sodden-Stories"}], "item_content_type": "ebook"}, "pathfinderquest_falconsdescent": {"human_name": "Pathfinder Quest: Falcon's Descent", "machine_name": "pathfinderquest_falconsdescent", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Paizo, inc.", "publisher-url": "https://paizo.com/products/btq024wt"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 15.0}, "subtitle_html": null, "description_text": "<p>On the border between Isger and Andoran, the Pathfinder Society is called to action! Venture-Captain Brackett's allies in the Eagle Knights of Andoran have requested aid with defeating a group of duergar slavers. Before these duergar can cause any more pain and suffering, Brackett hopes that the PCs and Lieutenant Evanno Pratt of the Eagle Knights' Steel Falcons division can mount a pincer attack that will defeat the villains without allowing them to escape into the Darklands with their victims.</p><p>A Pathfinder Society Quest designed for levels 1–4 (subtiers 1–2 and 3–4)</p>", "user_ratings": {}, "developers": [{"developer-name": "Joshue Hennington", "developer-url": "https://paizo.com/products/btq024wt"}], "item_content_type": "ebook"}, "pathfinderlostomenshighhelmpdf": {"human_name": "Pathfinder Lost Omens Highhelm (PDF)", "machine_name": "pathfinderlostomenshighhelmpdf", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Paizo, inc.", "publisher-url": "https://paizo.com/products/btq02ehs?Pathfinder-Lost-Omens-Highhelm"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 30.0}, "subtitle_html": null, "description_text": "<p>Delve the mountain deep!</p><p>When the first dwarves reached the surface of Golarion, they built enormous keeps as a monument to their legacy and to serve as their new home. The mightiest of these keeps was Highhelm, a Sky Citadel deep in the Five Kings Mountains. While other Sky Citadels have fallen since the Quest for Sky, Highhelm holds strong, serving as one of the major centers of dwarven culture.</p><p>Lost Omens Highhelm delves deep into the Emperor's Peak to present Highhelm in all its glory. This book details everyday life in the city, dwarven culture, and the various clans that influence the Sky Citadel. It also provides a full gazetteer of the city's layers and surroundings, each with adventuring locations and sites of intrigue suitable for a multitude of adventures. An included poster map presents Highhelm's layers in high detail and serves as an aid for campaigns centered on the dwarven city. Characters looking for new options can visit Highhelm for new equipment, ancestry feats, animal companions, and more!</p>", "user_ratings": {}, "developers": [{"developer-name": "Dan Cascone, Caryn DiMarco, Dana Ebert, Sen H.H.S., Michelle Jones, Stephanie Lundeen, Liane Merciel, Matt Morris, Dave Nelson, Nathan Reinecke, Mikhail Rekun, Erin Roberts, Owen K.C. Stephens, Andrew White, and Shan Wolf", "developer-url": "https://paizo.com/products/btq02ehs?Pathfinder-Lost-Omens-Highhelm"}], "item_content_type": "ebook"}, "pathfindercoregmscreenpdf": {"human_name": "Pathfinder Core GM Screen (PDF)", "machine_name": "pathfindercoregmscreenpdf", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Paizo, inc.", "publisher-url": "https://paizo.com/products/btq02f05"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 5.0}, "subtitle_html": null, "description_text": "<p>A good Game Master keeps many secrets, only to reveal them to the players when the time is right. Keep your secrets safe behind the Pathfinder Core GM Screen. This sturdy four-panel horizontal screen features a stunning battle scene on one side and handy charts and game tables on the other side to give a busy GM everything they need to run Pathfinder. This screen has been updated with rules from the Pathfinder Remaster and includes a useful chart of new terms, making it simple to run any adventure from Pathfinder Second Edition!</p><p>The Pathfinder Core GM Screen measures 44\" by 8.5\", giving you plenty of space to hide your notes, dice rolls, and secret plans.</p>", "user_ratings": {}, "developers": [], "item_content_type": "ebook"}, "pathfinderremastericonicspregeneratedcharacterspdf": {"human_name": "Pathfinder Remaster Iconics Pregenerated Characters (PDF)", "machine_name": "pathfinderremastericonicspregeneratedcharacterspdf", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Paizo, inc.", "publisher-url": "https://paizo.com/products/btq02evu"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 5.0}, "subtitle_html": null, "description_text": "<p>This package contains pregenerated characters for use in the Pathfinder Society and personal games. The following can be found in this download package:</p><p>Pathfinder Player Core</p><p>Ezren: Human Wizard (Level 1, 3 and 5)</p><p>Feiya: Human Witch (Level 1, 3 and 5)</p><p>Harsk: Dwarf Ranger (Level 1, 3 and 5)</p><p>Kyra: Human Cleric (Level 1, 3 and 5)</p><p>Lem: Halfling Bard (Level 1, 3 and 5)</p><p>Lini: Gnome Druid (Level 1, 3 and 5)</p><p>Merisiel: Elf Rogue (Level 1, 3 and 5)</p><p>Valeros: Human Fighter (Level 1, 3 and 5)</p><p>Pathfinder Player Core 2</p><p>Amiri: Human Barbarian (Level 1, 3 and 5)</p><p>Fumbus: Goblin Alchemist (Level 1, 3 and 5)</p><p>Jirelle: Aiuvarin Swashbuckler (Level 1, 3 and 5)</p><p>Korakai: Tengu Oracle (Level 1, 3 and 5)</p><p>Quinn: Human Investigator (Level 1, 3 and 5)</p><p>Sajan: Human Monk (Level 1, 3 and 5)</p><p>Seelah: Human Champion (Level 1, 3 and 5)</p><p>Seoni: Human Sorcerer (Level 1, 3 and 5)</p><p>Pathfinder Rage of Elements</p><p>Yoon: Human Kineticist (Level 1, 3 and 5)</p><p>Pathfinder War of Immortals</p><p>Nahoa: Human Nephilim Exemplar (Level 1, 3 and 5)</p><p>Samo: Human Nephilim Animist (Level 1, 3 and 5)</p><p>These character sheets have been updated for the Pathfinder Remaster.</p>", "user_ratings": {}, "developers": [], "item_content_type": "ebook"}, "skykingstombplayersguide": {"human_name": "Sky King's Tomb Player's Guide", "machine_name": "skykingstombplayersguide", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Paizo, inc.", "publisher-url": "https://paizo.com/"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 30.0}, "subtitle_html": null, "description_text": "<p>Discover dwarven drama as you descend into the Darklands!</p><p>The magnificent metropolis of Highhelm displays millennia of dwarven history, yet one of its greatest heroes vanished over 9,000 years ago: High King Taargick, better known as the Sky King. Without his bravery and leadership, dwarves might never have colonized the surface world during their Quest for Sky migration. Understandably, most dwarves today revere Taargick’s memory more than they understand his mythologized deeds.</p><p>Yet one of the Sky King’s relics is about to reappear, kicking off a dangerous expedition into the Darklands. The PCs are archivists, explorers, and truth-seekers recruited by Highhelm’s foremost historians and have been entrusted with investigating this strange relic’s mysteries: discoveries that might at last unearth the apocryphal Sky King’s Tomb!</p><p>Inside the Sky King’s Tomb Player’s Guide, you’ll find player-friendly, spoiler-free lore and tips to create an exciting character suited for the Sky King’s Tomb Adventure Path. Contents include:</p><ul><li> An overview of the Sky Citadel Highhelm, dwarven culture, and dwarven faiths.</li><li> Character advice, including ways different character classes and ancestries might excel in this Adventure Path.</li><li> New character backgrounds specifically designed for this Adventure Path, including Conservator, Child of Notoriety, and Historical Reenactor.</li><li> An extensive guide to underground exploration and adventuring in the dark.</li></ul>", "user_ratings": {}, "developers": [{"developer-name": "John Compton", "developer-url": "https://paizo.com/"}], "item_content_type": "ebook"}, "lostomensworldguidepdf": {"human_name": "Lost Omens World Guide (PDF)", "machine_name": "lostomensworldguidepdf", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Paizo, inc.", "publisher-url": "https://paizo.com/products/btq01y0o"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 5.0}, "subtitle_html": null, "description_text": "<p>This indispensable 136-page guidebook to the world of Pathfinder presents everything you need to know for a lifetime of adventure in the uncertain Age of Lost Omens. The god of humanity is dead and prophecy is broken, leaving adventuring heroes like you to carve their own destinies out of an uncertain future!</p><p>This gazetteer features 10 diverse regions packed with thrilling and deadly possibilities and is accompanied by a giant two-sided poster map depicting the heart of the Pathfinder setting.</p>", "user_ratings": {}, "developers": [{"developer-name": "John Compton, Sasha Laranoa Harving, Amanda Hamon, Mike Kimmel, Luis Loza, Ron Lundeen, Matt Morris, Patchen Mortimer, Andrew Mullen, Mikhail Rekun, Michael Sayre, Owen K.C. Stephens, Isabelle Thorne, and Linda Zayas-Palmer", "developer-url": "https://paizo.com/products/btq01y0o"}], "item_content_type": "ebook"}, "takethis": {"human_name": "Take This", "machine_name": "takethis", "youtube_link": "Kej-3ADUzK0", "callout": null, "publishers": [], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "subtitle_html": null, "description_text": "<p><em>Payments to&nbsp;<span data-sheets-value=\"{&quot;1&quot;:2,&quot;2&quot;:&quot;Keep A Breast&quot;}\" data-sheets-userformat=\"{&quot;2&quot;:17187,&quot;3&quot;:{&quot;1&quot;:0},&quot;4&quot;:{&quot;1&quot;:2,&quot;2&quot;:11982760},&quot;8&quot;:{&quot;1&quot;:[{&quot;1&quot;:2,&quot;2&quot;:0,&quot;5&quot;:{&quot;1&quot;:2,&quot;2&quot;:0}},{&quot;1&quot;:0,&quot;2&quot;:0,&quot;3&quot;:3},{&quot;1&quot;:1,&quot;2&quot;:0,&quot;4&quot;:1}]},&quot;11&quot;:1,&quot;12&quot;:0,&quot;17&quot;:1}\">Take This</span>&nbsp;are made via the&nbsp;<a href=\"https://support.humblebundle.com/hc/en-us/articles/205183597\" target=\"_blank\" rel=\"noopener\">PayPal Giving Fund</a>.<br></em></p>\n<p class=\"p1\"><span>Take This is a mental health nonprofit serving the game community/industry that provides resources, guidelines and training about mental health issues in the game community, thus reducing the stigma of mental illness.</span></p>\n<p><span>Take This provides gamers and developers with resources, guidelines, and training that help them support themselves and others in dealing with mental health challenges.</span></p>\n<p><span>Take This’ key programs are its AFK Room Program at conventions, its mental health consulting program for game developers, and its ambassador program for streamers.</span></p>", "user_ratings": {}, "developers": [{"developer-name": "takethis.org", "developer-url": "http://www.takethis.org"}], "item_content_type": null}, "pathfindergmcorepdf": {"human_name": "Pathfinder GM Core (PDF)", "machine_name": "pathfindergmcorepdf", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Paizo, inc.", "publisher-url": "https://paizo.com/products/btq02eok?Pathfinder-GM-Core"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 15.0}, "subtitle_html": null, "description_text": "<p>Unleash your imagination, creating worlds and stories beyond measure with the new Pathfinder GM Core for Pathfinder Second Edition! This comprehensive 336-page hardcover rulebook gives Game Masters everything they need to craft thrilling tales of adventure, from a single-night’s dungeon delve to complex epics spanning years. Within these pages you’ll find clear guidelines for creating new hazards and monsters, tools to design challenging, balanced encounters, and rules for rewarding characters for the dastardly challenges you array before them! Pathfinder GM Core also contains a dragon’s hoard of magic items and treasure to entice and reward your players, from simple healing potions to magic weapons and armor and legendary artifacts, including dozens of brand-new items!</p><p>Pathfinder GM Core is the second core rulebook for the fully remastered Pathfinder Second Edition RPG! These rules are compatible with previous Pathfinder Second Edition rulebooks, incorporating comprehensive errata and rules updates and some of the best additions from later books into new, easier-to-access volumes with new presentations inspired by years of player feedback. Along with the Player Core, Monster Core, and Player Core 2, these books provide a new foundation for the future of tabletop gaming!</p><p>Pathfinder GM Core includes:</p><p>• The rules needed to run a game of Pathfinder, including guidelines for creating challenging encounters, determining success, and giving out rewards.</p><ul><li> Advice aimed at making you an incredible Game Master, along with tools to ensure you and everyone else at your table has a safe and enjoyable experience.</li><li> Guidelines to help you create your own content, from campaigns and adventures to hazards and monsters.</li><li> Rules subsystems to help you handle a wide array of game situations, including rules for chases, duels, research, infiltration, and more!</li><li> A guide to the world of Lost Omens, with a look at several important regions, an examination of the peoples and cultures of the world, and a glimpse into what lies beyond the veil of the universe!</li><li> Fully integrated errata from the first 4 years of Pathfinder Second Edition, including improvements to staves and talismans and all-new apex magic items!</li><li> Published under the new Open RPG Creative (ORC) license, giving players and Game Masters even more freedom for making their own creations based on Pathfinder Second Edition.</li></ul>", "user_ratings": {}, "developers": [{"developer-name": "Logan Bonner and Mark Seifter", "developer-url": "https://paizo.com/products/btq02eok?Pathfinder-GM-Core"}], "item_content_type": "ebook"}, "pathfindermonstercorepdf": {"human_name": "Pathfinder Monster Core (PDF)", "machine_name": "pathfindermonstercorepdf", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Paizo, inc.", "publisher-url": "https://paizo.com/products/btq02ex5?Pathfinder-Monster-Core"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 30.0}, "subtitle_html": null, "description_text": "<p>Heroes are defined by their foes—from shambling skeletons to terrifying dragons, each enemy leaves a mark on their growing legend. Make your legends memorable with foes from the new Pathfinder Monster Core rulebook for Pathfinder Second Edition! This 376-page hardcover book is packed with a wide range of monsters useful to all Pathfinder campaigns, giving the Game Master plenty of threats to throw at their adventurers, at any level of experience. The lavishly illustrated tome also includes guidelines for reading monster entries and adjusting existing monsters to tailor fit your story! This is the definitive resource for Pathfinder Second Edition monsters!</p><p>Pathfinder Monster Core is the third core rulebook for the fully remastered Pathfinder Second Edition RPG! These rules are compatible with previous Pathfinder Second Edition rulebooks, incorporating comprehensive errata and rules updates and some of the best additions from later books into new, easier-to-access volumes with new presentations inspired by years of player feedback. Along with the Player Core, GM Core, and Player Core 2, these books provide a new foundation for the future of tabletop gaming!</p><p>Pathfinder Monster Core includes:</p><p>• Over 400 individual monster writeups, including everything from common animals, like wolves and bears, to terrifying supernatural foes, such as the rune giant or the grim reaper!</p><ul><li> Eight brand new dragons to challenge your players, including the power-hungry fortune dragon, the peerless adamantine dragon, the mischievous mirage dragon, the fiendish diabolic dragon, and more!</li><li> Classic monsters drawn from mythology, like the minotaur and the medusa, as well as creatures drawn from the legends of the Lost Omens setting, including favorites like the wicked sinspawn and unpredictable proteans.</li><li> Simple templates that allow you to customize a monster, making it more or less powerful with just a few simple adjustments.</li><li> Guidelines for reading and using a monster statistics, ensuring you get the most out of a creature both in and out of combat.</li><li> Lists of creatures sorted by both type and level, making it easy to find the monster you need when you need it.</li><li> Fully integrated errata from the first 4 years of Pathfinder Second Edition, including new balance adjustments to ensure that every creature presents a thrilling level-appropriate challenge!</li><li> Hundreds of beautiful full-color creature illustrations!</li><li> Published under the new Open RPG Creative (ORC) license, giving players and Game Masters even more freedom for making their own creations based on Pathfinder Second Edition.</li></ul>", "user_ratings": {}, "developers": [{"developer-name": "Logan Bonner, Jason Bulmahn, Stephen Radney-MacFarland, and Mark Seifter", "developer-url": "https://paizo.com/products/btq02ex5?Pathfinder-Monster-Core"}], "item_content_type": "ebook"}, "pathfinderadvancedplayersguidecharactersheetpackpdf": {"human_name": "Pathfinder Advanced Player's Guide Character Sheet Pack (PDF)", "machine_name": "pathfinderadvancedplayersguidecharactersheetpackpdf", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Paizo, inc.", "publisher-url": "https://paizo.com/products/btq024u9?Pathfinder-Advanced-Players-Guide-Character-Sheet-Pack"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 5.0}, "subtitle_html": null, "description_text": "<p>Advance your character with the Advanced Player's Guide Character Sheet Pack! Track your hero's statistics and accomplishments with these full-color character sheets designed to include exactly what your character needs! This product comes in a sturdy folder to store character sheets, with reference information such as game actions, a summary of crucial conditions, and death and dying rules. Inside are 16 sheets for characters and campaign tracking. These include specialized character sheets for each of the four classes from the Advanced Player's Guide, with class features and special actions already filled in! Plus you'll find sheets for the evil champions and for oracle spells and curses from that book. Furthermore, there are three standard blank sheets suitable for characters of any class, an alternate sheet with a simplified design, and expanded sheets to track character inventory, campaign notes, adventure logs, NPCs, spells, animal companions, and alchemy books.</p>", "user_ratings": {}, "developers": [], "item_content_type": "ebook"}, "pathfinderbounty_somewherebelow": {"human_name": "Pathfinder Bounty: Somewhere Below", "machine_name": "pathfinderbounty_somewherebelow", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Paizo, inc.", "publisher-url": "https://paizo.com/products/btq027tl"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 15.0}, "subtitle_html": null, "description_text": "<p>While sheltering in a cave from a storm, the PCs discover a note from a stranded spelunker in need of immediate assistance. They must navigate the hazards and creatures of the treacherous caverns if they want to help their bounty make it out alive.</p><p>A Pathfinder Bounty for level 1.</p>", "user_ratings": {}, "developers": [{"developer-name": "Kim Frandsen", "developer-url": "https://paizo.com/products/btq027tl"}], "item_content_type": "ebook"}, "pathfinderflip-matclassics_twistedcaverns": {"human_name": "Pathfinder Flip-Mat Classics: Twisted Caverns (PDF/JPG)", "machine_name": "pathfinderflip-matclassics_twistedcaverns", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Paizo, inc.", "publisher-url": "https://paizo.com/products/btq027rt"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 15.0}, "subtitle_html": null, "description_text": "<p>Whether your party is venturing into a maze of twisty passages or escaping from the creature that dragged them to the center of its distressingly bone-strewn lair, no Game Master wants to spend time drawing every narrow cave tunnel and dead end. Fortunately, with Paizo's latest Pathfinder Flip-Mat Classics, you don't have to! This line of gaming maps provides ready-to-use fantasy set pieces for the busy Game Master. Full of beautiful details, including a fungus-infested cave and a spiraling descent, this double-sided map makes the perfect setting for encounters in the dank and dark! Don't waste your time sketching when you could be playing. With Pathfinder Flip-Mat Classics: Twisted Caverns, you'll be prepared next time your players head underground!</p><p>Contains two 24\"\" x 30\"\" battle maps. Used in Pathfinder Society Scenario 3–15: Cavern of the Sundered Song.</p>", "user_ratings": {}, "developers": [{"developer-name": "Jason Engle", "developer-url": "https://paizo.com/products/btq027rt"}], "item_content_type": "ebook"}, "pathfindermonstercoresketchcoverhardcover": {"human_name": "Pathfinder Monster Core [Sketch Cover] (hardcover)", "machine_name": "pathfindermonstercoresketchcoverhardcover", "youtube_link": null, "callout": "<strong><em><span style=\"color: #ef9741;\">Limited Quantities Available!</span></em></strong>", "publishers": [{"publisher-name": "Paizo, inc.", "publisher-url": "https://paizo.com/products/btq02elu?Pathfinder-Monster-Core-Sketch-Cover"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 45.0}, "subtitle_html": null, "description_text": "<p><b data-stringify-type=\"bold\">ESTIMATED SHIPPING COSTS</b><br><span>Your Humble Bundle cost DOES NOT include shipping fees for the physical Pathfinder Monster Core, which will be calculated when you redeem your code on&nbsp;</span><a target=\"_blank\" class=\"c-link\" data-stringify-link=\"http://Paizo.com\" delay=\"150\" data-sk=\"tooltip_parent\" href=\"http://paizo.com/\" rel=\"noopener noreferrer\">Paizo.com</a><span>. See below for an estimate of shipping fees.<br><br></span><span class=\"c-mrkdwn__br\" data-stringify-type=\"paragraph-break\"></span><b data-stringify-type=\"bold\">Domestic:</b><span>&nbsp;$12 - 40*<br></span><b data-stringify-type=\"bold\">International:</b><span>&nbsp;$40 - 80*</span></p>\n<p>Heroes are defined by their foes—from shambling skeletons to terrifying dragons, each enemy leaves a mark on their growing legend. Make your legends memorable with foes from the new Pathfinder Monster Core rulebook for Pathfinder Second Edition! This 376-page hardcover book is packed with a wide range of monsters useful to all Pathfinder campaigns, giving the Game Master plenty of threats to throw at their adventurers, at any level of experience. The lavishly illustrated tome also includes guidelines for reading monster entries and adjusting existing monsters to tailor fit your story! This is the definitive resource for Pathfinder Second Edition monsters!</p>\n<p>Pathfinder Monster Core is the third core rulebook for the fully remastered Pathfinder Second Edition RPG! These rules are compatible with previous Pathfinder Second Edition rulebooks, incorporating comprehensive errata and rules updates and some of the best additions from later books into new, easier-to-access volumes with new presentations inspired by years of player feedback. Along with the Player Core, GM Core, and Player Core 2, these books provide a new foundation for the future of tabletop gaming!</p>\n<p>This sketch cover edition features a beautiful image of the original pencil sketch of the Pathfinder Monster Core cover by superstar artist Wayne Reynolds, and is offered exclusively to Paizo’s hobby retail partners for the first 120 days of release.</p>\n<p>Pathfinder Monster Core includes:</p>\n<p>•&nbsp;Over 400 individual monster writeups, including everything from common animals, like wolves and bears, to terrifying supernatural foes, such as the rune giant or the grim reaper!</p>\n<ul>\n<li>&nbsp;Eight brand new dragons to challenge your players, including the power-hungry fortune dragon, the peerless adamantine dragon, the mischievous mirage dragon, the fiendish diabolic dragon, and more!</li>\n<li>&nbsp;Classic monsters drawn from mythology, like the minotaur and the medusa, as well as creatures drawn from the legends of the Lost Omens setting, including favorites like the wicked sinspawn and unpredictable proteans.</li>\n<li>&nbsp;Simple templates that allow you to customize a monster, making it more or less powerful with just a few simple adjustments.</li>\n<li>&nbsp;Guidelines for reading and using a monster statistics, ensuring you get the most out of a creature both in and out of combat.</li>\n<li>&nbsp;Lists of creatures sorted by both type and level, making it easy to find the monster you need when you need it.</li>\n<li>&nbsp;Fully integrated errata from the first 4 years of Pathfinder Second Edition, including new balance adjustments to ensure that every creature presents a thrilling level-appropriate challenge!</li>\n<li>&nbsp;Hundreds of beautiful full-color creature illustrations!</li>\n<li>&nbsp;Published under the new Open RPG Creative (ORC) license, giving players and Game Masters even more freedom for making their own creations based on Pathfinder Second Edition.</li>\n</ul>", "user_ratings": {}, "developers": [{"developer-name": "Logan Bonner, Jason Bulmahn, Stephen Radney-MacFarland, and Mark Seifter", "developer-url": "https://paizo.com/products/btq02elu?Pathfinder-Monster-Core-Sketch-Cover"}], "item_content_type": "game"}, "pathfinderadventurepath_mantleofgoldskykingstomb1of3pdf": {"human_name": "Pathfinder Adventure Path: Mantle of Gold (Sky King's Tomb 1 of 3)(PDF)", "machine_name": "pathfinderadventurepath_mantleofgoldskykingstomb1of3pdf", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Paizo, inc.", "publisher-url": "https://paizo.com/products/btq02eao?Pathfinder-Adventure-Path-193-Mantle-of-Gold"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 30.0}, "subtitle_html": null, "description_text": "<p>Invited to a prestigious storytelling festival in Highhelm, the greatest dwarven city, a clan’s eclectic guests explore every corner of the metropolis to build their own legends. Yet when these budding celebrities find a relic linked to one of dwarvenkind’s greatest heroes, they’re drawn into a mysterious ancient urban intrigue that kicks off a deadly treasure hunt.</p><p>Mantle of Gold is a Pathfinder adventure for four 1st-level characters. This adventure begins the Sky King’s Tomb Adventure Path, a three-part monthly campaign in which a group of adventurers travel deep underground to discover a legendary dwarven king’s tomb, seek subterranean treasures, and heal millennia-old injustices—all while stopping an ambitious villain from weaponizing those same discoveries. This adventure also includes a detailed look at lost dwarven treasures, tricks for adventuring in the dark, potent relics, and several monsters to threaten underground explorers.</p>", "user_ratings": {}, "developers": [{"developer-name": "John Compton, Crystal Frasier, and Caryn DiMarco", "developer-url": "https://paizo.com/products/btq02eao?Pathfinder-Adventure-Path-193-Mantle-of-Gold"}], "item_content_type": "ebook"}, "pathfinderadventure_rusthengepdf": {"human_name": "Pathfinder Adventure: Rusthenge (PDF)", "machine_name": "pathfinderadventure_rusthengepdf", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Paizo, inc.", "publisher-url": "https://paizo.com/products/btq02efw"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 15.0}, "subtitle_html": null, "description_text": "<p>Rusthenge is a deluxe Pathfinder adventure for 1st-level characters. The ruins of Rusthenge have stood silent vigil over the southern coastline of Chakikoth Isle for eons, dating back to the era of the runelords of ancient Thassilon. The town of Iron Harbor was built in Rusthenge's shadow, but now that New Thassilon has risen from the depths of the distant past, the old ruins are coming under unexpected scrutiny. Something sinister is afoot in Rusthenge, and it falls to a brand new band of adventurers to learn the truth of the ancient evil that stirs deep within its long-abandoned halls! This adventure also includes new items and character backgrounds, as well as a pair of new monsters tied to the region's notorious history.</p>", "user_ratings": {}, "developers": [{"developer-name": "Vanessa Hoskins", "developer-url": "https://paizo.com/products/btq02efw"}], "item_content_type": "ebook"}, "pathfindersecondeditionbeginnerbox_remasterededition": {"human_name": "Pathfinder Second Edition Beginner Box: Remastered Edition (PDF)", "machine_name": "pathfindersecondeditionbeginnerbox_remasterededition", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Paizo, inc.", "publisher-url": "https://paizo.com/products/btq023dx"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 5.0}, "subtitle_html": null, "description_text": "<p>Take the first step into an amazing world of fantasy adventure! The Pathfinder Beginner Box contains everything you need to learn how to play the Pathfinder Roleplaying Game, including rules to create your own fantasy hero and tools to make your own amazing stories.</p><p>Will you be a courageous fighter, charging headfirst into battle, or a sly rogue, moving quietly to strike at foes from the shadows? Maybe you will be a knowledgeable wizard, wielding incredible arcane spells or a wise and pious cleric, using the power of your deity to shape the world for the better. It is all up to you!</p><p>Inside you will find a rich toolbox, filled with everything you need to get started, including rules for character generation, an introductory adventure, guidelines to build your own campaign, character sheets, a full-color map, character pawns, and dice. This deluxe box set is the ideal introduction to the Pathfinder Roleplaying Game, leading the way to a lifetime of adventure!</p><p>The Pathfinder Beginner Box includes:</p><p>•An 80-page Hero's Handbook, including rules for character generation, a solo adventure, skills, spells, and equipment.</p><ul><li>A 96-page Game Master's Handbook, containing an introductory adventure, over 20 pages of monsters, rules for building your own adventure, and magic items.</li><li>Four premade characters so you can jump right into the action and four blank character sheets if you want to make your own hero.</li><li>Over 100 character and monster pawns to use on the full-color double-sided adventure map.</li><li>Four game reference cards to help players remember their actions.<p>Note: This version of the Beginner Box includes content updates to bring it up-to-date with the Pathfinder Second Edition Remaster Project. Purchase of the PDF version will include both the legacy (OGL) and Remaster (ORC) versions.</p></li></ul>", "user_ratings": {}, "developers": [{"developer-name": "Jason Bulmahn, Mark Seifter, Lyz Liddell and Logan Bonner", "developer-url": "https://paizo.com/products/btq023dx"}], "item_content_type": "ebook"}, "pathfinderflip-mat_rusthengepdfandjpg": {"human_name": "Pathfinder Flip-Mat: Rusthenge (PDF/JPG)", "machine_name": "pathfinderflip-mat_rusthengepdfandjpg", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Paizo, inc.", "publisher-url": "https://paizo.com/products/btq02esf?Pathfinder-FlipMat-Rusthenge"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 15.0}, "subtitle_html": null, "description_text": "<p>Bring your adventures near the town of Iron Harbor to life on your tabletop with this double-sided full-color Flip-Mat featuring two key encounter locations from the new introductory Pathfinder Second Edition adventure Rusthenge on either side! One side depicts a twisting coastline, while the other side shows the mysterious ruins of Rusthenge itself! Don't waste your time sketching when you could be playing. With Pathfinder Flip-Mat: Rusthenge, you'll be ready to introduce Pathfinder in style!</p><p>Pathfinder Flip-Mat: Rusthenge measures 24\"\" x 30\"\" unfolded, and 8\"\" x 10\"\" folded. A Flip-Mat's coated surface can handle any dry erase, wet erase, or even permanent marker. Usable by experienced GMs and novices alike, Pathfinder Flip-Mats fit perfectly into any Game Master's arsenal!</p>", "user_ratings": {}, "developers": [{"developer-name": "Jason Engle", "developer-url": "https://paizo.com/products/btq02esf?Pathfinder-FlipMat-Rusthenge"}], "item_content_type": "ebook"}, "pathfinderadventure_afewflowersmorepdf": {"human_name": "Pathfinder Adventure: A Few Flowers More (PDF)", "machine_name": "pathfinderadventure_afewflowersmorepdf", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Paizo, inc.", "publisher-url": "https://paizo.com/products/btq02eio?Pathfinder-Adventure-A-Few-Flowers-More"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 5.0}, "subtitle_html": null, "description_text": "<p>FLOWER POWER!</p><p>A hero's work is never done! Especially when strange new plants start appearing in the woods—plants whose presence draws all manner of trespassers eager to take advantage of the sudden, mysterious bounty. But where are these plants coming from, and what sinister development in the heart of the forest does their arrival signify? Could it be the beginning of an invasion from another dimension... or something worse?</p><p>In A Few Flowers More, you take on the role of one of four unique leshys—mobile plants who have been granted wills of their own. When word of strange supernatural developments in the depths of the forest comes to light, it falls to you and your friends to take care of things!</p><p>A Few Flowers More is a short adventure for 4th-level characters that serves as a sequel to A Fistful of Flowers, yet it can be played on its own. This adventure takes a band of leshy heroes into the very depths of a primeval forest and pits them against a supernatural threat that's literally out of this world. The four pregenerated characters also provide a quick way to jump into this exciting Free RPG Day offering right away! Grab your friends, grab some dice, and play the role of the forest's newest heroes!</p>", "user_ratings": {}, "developers": [{"developer-name": "Linda Zayas-Palmer", "developer-url": "https://paizo.com/products/btq02eio?Pathfinder-Adventure-A-Few-Flowers-More"}], "item_content_type": "ebook"}, "pathfinderflip-tiles_darklandsstartersetpdfandjpg": {"human_name": "Pathfinder Flip-Tiles: Darklands Starter Set (PDF/JPG)", "machine_name": "pathfinderflip-tiles_darklandsstartersetpdfandjpg", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Paizo, inc.", "publisher-url": "https://paizo.com/products/btq0206a?Pathfinder-FlipTiles-Darklands-Starter-Set"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 15.0}, "subtitle_html": null, "description_text": "<p>More tiles! More options! Convenient size! Create a path to the center of the world with just a flip! The new and useful Flip-Tiles: Darklands Starter Set features 42 full-color 6 x 6-inch map tiles, with twisted caverns, dank chambers, and other subterranean Darklands features, both sides stunningly crafted by cartographer Jason A. Engle. These exciting new tiles put an endless cavern complex your fingertips!</p><p>Suitable for experienced GMs and novices alike, this product fits perfectly into any Game Master's arsenal.</p><p>Used in Pathfinder Society Scenario 3–10: Dee the Pallid Depths.</p>", "user_ratings": {}, "developers": [{"developer-name": "Jason Engle", "developer-url": "https://paizo.com/products/btq0206a?Pathfinder-FlipTiles-Darklands-Starter-Set"}], "item_content_type": "ebook"}}, "charity_data": {"charity_items": {"takethis": {"machine_name": "takethis", "youtube_link": "Kej-3ADUzK0", "item_content_type": null, "subtitle_html": null, "description_text": "<p><em>Payments to&nbsp;<span data-sheets-value=\"{&quot;1&quot;:2,&quot;2&quot;:&quot;Keep A Breast&quot;}\" data-sheets-userformat=\"{&quot;2&quot;:17187,&quot;3&quot;:{&quot;1&quot;:0},&quot;4&quot;:{&quot;1&quot;:2,&quot;2&quot;:11982760},&quot;8&quot;:{&quot;1&quot;:[{&quot;1&quot;:2,&quot;2&quot;:0,&quot;5&quot;:{&quot;1&quot;:2,&quot;2&quot;:0}},{&quot;1&quot;:0,&quot;2&quot;:0,&quot;3&quot;:3},{&quot;1&quot;:1,&quot;2&quot;:0,&quot;4&quot;:1}]},&quot;11&quot;:1,&quot;12&quot;:0,&quot;17&quot;:1}\">Take This</span>&nbsp;are made via the&nbsp;<a href=\"https://support.humblebundle.com/hc/en-us/articles/205183597\" target=\"_blank\" rel=\"noopener\">PayPal Giving Fund</a>.<br></em></p>\n<p class=\"p1\"><span>Take This is a mental health nonprofit serving the game community/industry that provides resources, guidelines and training about mental health issues in the game community, thus reducing the stigma of mental illness.</span></p>\n<p><span>Take This provides gamers and developers with resources, guidelines, and training that help them support themselves and others in dealing with mental health challenges.</span></p>\n<p><span>Take This’ key programs are its AFK Room Program at conventions, its mental health consulting program for game developers, and its ambassador program for streamers.</span></p>", "human_name": "Take This", "developers": [{"developer-name": "takethis.org", "developer-url": "http://www.takethis.org"}], "publishers": [], "user_ratings": {}}}}, "from_bundle": {"machine_name": "pathfinderprimerbundlepaizo_bookbundle", "tile_short_name": "Pathfinder Primer Bundle by Paizo", "short_marketing_blurb": "Forge your own high-fantasy adventures", "marketing_blurb": "Get <em>Pathfinder GM Core (PDF)</em>, <em>Lost Omens World Guide (PDF)</em>, <em>Pathfinder Player Core (PDF)</em>, and more!", "detailed_marketing_blurb": "A world of adventure and danger awaits—and the only thing missing is your heroism. Gather your party of trusty companions for countless quests with our latest <em>Pathfinder</em> bundle from Paizo. Mix up your fun with the hottest <em>Pathfinder</em> TTRPG campaigns and expansions like <em>Pathfinder Second Edition Beginner Box: Remastered Edition</em>, <em>Pathfinder Player Core</em>, <em>Sky King’s Tomb Player’s Guide</em>, and more. Get everything you need to embark on an epic high-fantasy journey together, and help support Take This! with your purchase!", "author": "Paizo", "start_date|datetime": "2025-09-04T18:00:00", "end_date|datetime": "2025-09-25T18:00:00", "type": "bundle", "product_url": "/books/pathfinder-primer-bundle-paizo-books"}, "updated_at|datetime": "2025-09-05T03:13:07.918691", "first_seen_at|datetime": "2025-09-05T03:13:07.918691"}
{"machine_name": "learngodotin2025completecoursebundle_softwarebundle", "author": "Zenva Pty Ltd", "basic_data": {"eula": null, "human_name": "Learn Godot in 2025: Complete Course Bundle", "detailed_marketing_blurb": "Your creative possibilities are limitless with the right game engine. Say hello to our latest Software Bundle: Learn Godot in 2025—a complete course collection designed to help you master Godot’s powerful, open-source, and beginner-friendly tools. Build any game you can imagine with step-by-step lessons like <em>Make a Complete Bullet Hell from Scratch in Godot </em> and <em>Make a Fully-Fledged Farming RPG with Godot</em>—then, learn to upload them online with <em>Publishing to Steam for Godot Game Projects</em>! Pay what you want for these great tools and help support NPower with your purchase.", "short_marketing_blurb": "Harness the freedom to create with Godot ", "media_type": "software", "description": "<p><strong>Harness the freedom to create with Godot.</strong> Your creative possibilities are limitless with the right game engine. Say hello to our latest Software Bundle: Learn Godot in 2025—a complete course collection designed to help you master Godot’s powerful, open-source, and beginner-friendly tools. Build any game you can imagine with step-by-step lessons like <em>Make a Complete Bullet Hell from Scratch in Godot </em> and <em>Make a Fully-Fledged Farming RPG with Godot</em>—then, learn to upload them online with <em>Publishing to Steam for Godot Game Projects</em>! Pay what you want for these great tools and help support NPower with your purchase.</p>\n<p><strong>Pay $1 or more.</strong> Normally, the total cost for the software in this bundle is as much as $1,500. Here at Humble Bundle, you choose the price and increase your contribution to upgrade your bundle! This bundle has a minimum $1 purchase. Pay $1 or more to access keys.</p>\n<p><strong>Redeem your keys.</strong> All of the software in this bundle is available for Windows, Mac, and Linux.</p>\n<p><strong>Support charity.</strong> Choose where the money goes - between the developer and to support NPower. If you like what we do, you can leave us a Humble Tip too!</p>", "legal_disclaimer": null, "required_account_links": ["steam"], "end_time|datetime": "2025-09-25T18:00:00"}, "tier_item_data": {"uvmappinginblenderforbeginners": {"human_name": "UV Mapping in Blender for Beginners", "machine_name": "uvmappinginblenderforbeginners", "youtube_link": "bCMPqxpxZis", "callout": "<div class=\"accolades\">MSRP: $50</div>", "publishers": [], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Master texturing in Blender by learning how to use UV maps!</p> <p>UV mapping - a process by which you \"unwrap\" a 3D model into a flat surface - offers creators an easy way to paint complex textures. You'll explore creating UV maps for different 3D objects and set them up to suit your material's needs. These skills in UV mapping will provide you with key techniques to customize your 3D graphics to your exact specifications.</p> <p>This course assumes basic familiarity with Blender.</p> <p><strong>You will learn how to:</strong></p> <ul> <li>Apply textures to an object</li> <li>Create UV maps for primitive shapes</li> <li>Build models suitable for UV mapping</li> <li>Combine techniques to unwrap complex objects</li> <li>Export UV maps for 2D software</li> <li>Paint textures onto a flattened UV map</li></ul>", "user_ratings": {}, "developers": [{"developer-name": "Zenva", "developer-url": "https://academy.zenva.com/product/uv-mapping-in-blender-for-beginners/"}], "item_content_type": "software"}, "makeanrtsgameingodotfromstarttofinish2025edition": {"human_name": "Make an RTS Game in Godot from Start to Finish (2025 Edition)", "machine_name": "makeanrtsgameingodotfromstarttofinish2025edition", "youtube_link": "iO6QcnVPVrU", "callout": "<div class=\"accolades\">MSRP: $50</div>", "publishers": [], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Build a real-time strategy game from start to finish in Godot!</p><p>RTS games challenge players to think on their feet and make strategic decisions in dynamic environments. In this course, you'll create an engaging RTS game featuring player-controlled units, an AI team, and strategy-driven gameplay using modular systems. By creating an RTS game, you’ll explore one of gaming's most exciting genres while mastering key development skills like AI behavior, navigation systems, and game mechanics—unlocking opportunities for more advanced projects.</p><strong>You’ll learn how to:</strong><ul><li>Design real-time strategy gameplay mechanics</li><li>Implement player-controlled unit selection</li><li>Program AI units with pathfinding</li><li>Apply navigation systems to avoid obstacles</li><li>Create dynamic win/loss systems</li><li>Add game juice and polish</li></ul><p>... and more!</p>", "user_ratings": {}, "developers": [{"developer-name": "Zenva", "developer-url": "https://academy.zenva.com/product/godot-rts-course/"}], "item_content_type": "software"}, "3daction-adventuregameingodot_unit1_characters": {"human_name": "3D Action-Adventure Game in Godot - Unit 1 - Characters", "machine_name": "3daction-adventuregameingodot_unit1_characters", "youtube_link": "eViQ0nDdX3E", "callout": "<div class=\"accolades\">MSRP: $50</div>", "publishers": [], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Build an epic 3D action-adventure game from start to finish!</p><p>Action-adventure games, with their immersive gameplay and dynamic challenges, are a staple of modern gaming. Through this course, you'll explore the basics of creating characters in Godot - developing smooth animations, dynamic combat mechanics, and randomized enemies to bring your game to life. By mastering these techniques, you’ll be ready to expand into creating other 3D genres with confidence and add more advanced features to your action-adventure project.</p><p><strong>You’ll learn how to:</strong></p><ul><li>Design and configure a 3D character</li><li>Animate actions with Godot’s animation trees</li><li>Add multiple weapons and shields</li><li>Generate enemies with random appearances</li><li>Program player combat mechanics, including defending</li><li>Work with inheritance for cleaner code</li></ul><p>... and more!</p>", "user_ratings": {}, "developers": [{"developer-name": "Zenva", "developer-url": "https://academy.zenva.com/product/godot-3d-adventure-characters-course/"}], "item_content_type": "software"}, "learnuisystemsandlayoutsforgodot": {"human_name": "Learn UI Systems and Layouts for Godot", "machine_name": "learnuisystemsandlayoutsforgodot", "youtube_link": "4lBGYatr95A", "callout": "<div class=\"accolades\">MSRP: $50</div>", "publishers": [], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 27.24}, "subtitle_html": null, "description_text": "<p>Master the essentials of designing responsive game UIs with Godot!</p><p>User interfaces (UI) are a core element of any game, bridging the gap between gameplay and the player’s experience. In this course, you will gain hands-on experience creating fully-fledged menus and UI layouts using Godot’s powerful layout system. By the end, you’ll have the skills to craft dynamic, adaptable interfaces ready for use in real-world game projects.</p><p>A basic understanding of Godot and GDScript is needed for this course.</p><strong>You’ll learn how to:</strong><ul><li>Place and position UI elements</li><li>Add custom themes to your UI</li><li>Handle controller input for usability</li><li>Use containers for dynamic layouts</li><li>Work with presets and customizations</li><li>Design adaptable, scalable UI systems</li></ul><p>... and more!</p>", "user_ratings": {}, "developers": [{"developer-name": "Zenva", "developer-url": "https://academy.zenva.com/product/godot-ui-course/"}], "item_content_type": "software"}, "4xstrategygameingodotandc_unit3_units": {"human_name": "4X Strategy Game in Godot & C# - Unit 3 - Units", "machine_name": "4xstrategygameingodotandc_unit3_units", "youtube_link": "8sigPJC-Gd0", "callout": "<div class=\"accolades\">MSRP: $50</div>", "publishers": [], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Expand your knowledge of 4X strategy games by learning how to spawn and manage units!</p><p>Unit mechanics are crucial for creating immersive 4X experiences - and a deep understanding of these will drive the exploration of your games. In this course, you'll use Godot and C# to build a comprehensive unit system, as well as implement a customizable main menu. These skills will not only round out your 4X strategy game-making skills, but open the doors to even more advanced strategy mechanics.</p><p>A solid understanding of Godot and C# is needed for this course.</p><p><strong>You'll learn how to:</strong></p><ul><li>Spawn units from cities</li><li>Display unit data with UIs</li><li>Move units on the map</li><li>Implement unit combat mechanics</li><li>Capture cities using units</li><li>Create customizable overlays and menus</li></ul><p>... and more!</p>", "user_ratings": {}, "developers": [{"developer-name": "Zenva", "developer-url": "https://academy.zenva.com/product/godot-csharp-4x-unit-course/"}], "item_content_type": "software"}, "introtogodot4gamedevelopment2025edition": {"human_name": "Intro to Godot 4 Game Development (2025 Edition)", "machine_name": "introtogodot4gamedevelopment2025edition", "youtube_link": "dBnPIYk_pAA", "callout": "<div class=\"accolades\">MSRP: $50</div>", "publishers": [], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 1.0}, "subtitle_html": null, "description_text": "<p>Start your game development journey with Godot — the powerful, open-source game engine!</p><p>From its beginner-friendly workflow to its robust capabilities for professionals, mastering Godot opens up endless possibilities in the world of game development. In this course, you'll explore the essential features of Godot by gaining hands-on experience in core development tools, 2D design, 3D environments, and coding gameplay behaviors with GDScript from start to finish.</p><p>Dive in and gain the foundations you'll need to make RPGs, survival games, and more with Godot!</p><p><strong>You’ll learn how to:</strong></p><ul><li>Navigate the Godot editor</li><li>Utilize core editing tools</li><li>Understand Nodes and Scenes</li><li>Work with 2D &amp; 3D assets</li><li>Script gameplay behaviors with GDScript</li><li>Develop a basic interactive game</li></ul><p>... and more!</p>", "user_ratings": {}, "developers": [{"developer-name": "Zenva", "developer-url": "https://academy.zenva.com/product/intro-to-godot-4-game-development/"}], "item_content_type": "software"}, "developacomplete3dplatformeringodot2025edition": {"human_name": "Develop a Complete 3D Platformer in Godot (2025 Edition)", "machine_name": "developacomplete3dplatformeringodot2025edition", "youtube_link": "DwOXkHwH4eM", "callout": "<div class=\"accolades\">MSRP: $50</div>", "publishers": [], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Craft a complete 3D platformer game from start to finish!</p> <p>3D platformers are a staple of game design, combining engaging challenges with rewarding exploration across dynamic environments. In this course, you’ll harness the power of Godot to create a fully-fledged 3D platformer game, complete with collectible items, enemy hazards, and multiple levels. By walking through every step of development, you’ll not only build a compelling game but also gain practical experience that will equip you to tackle even more complex 3D game projects.</p> <p> <strong>You’ll learn how to:</strong> </p><ul> <li>Set up levels using Godot's 3D tools</li> <li>Create a responsive player controller</li> <li>Enhance player movements with visual feedback</li> <li>Implement collectibles with scores and effects</li> <li>Design custom enemy behaviors</li> <li>Build seamless level transitions</li> </ul> <p>... and more!</p>", "user_ratings": {}, "developers": [{"developer-name": "Zenva", "developer-url": "https://academy.zenva.com/product/godot-3d-platformer-course/"}], "item_content_type": "software"}, "makeafully-fledgedfarmingrpgwithgodot2025edition": {"human_name": "Make a Fully-Fledged Farming RPG with Godot (2025 Edition)", "machine_name": "makeafully-fledgedfarmingrpgwithgodot2025edition", "youtube_link": "IJPEw0SvLHE", "callout": "<div class=\"accolades\">MSRP: $50</div>", "publishers": [], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Create a farming RPG from start to finish in Godot!</p> <p>Farming RPGs are a cornerstone of the game development world, seamlessly blending creativity, resource management, and engaging progression systems. In this course, you’ll build a complete tile-based farming RPG complete with seed planting, crop nurturing, harvesting, and more. By mastering the modular concepts featured, you'll be ready to expand these skills for your own project or add farming mechanics to any existing Godot project.</p> <p> <strong>You’ll learn how to:</strong> </p><ul> <li>Interact with and modify TileMaps</li> <li>Use Autoloads for global managers</li> <li>Script crop growth and harvesting cycles</li> <li>Handle in-game purchases and inventory</li> <li>Organize logic with GDScript dictionaries</li> <li>Structure mechanics with custom GDScript classes</li> </ul> <p>... and more!</p>", "user_ratings": {}, "developers": [{"developer-name": "Zenva", "developer-url": "https://academy.zenva.com/product/godot-farm-rpg-course/"}], "item_content_type": "software"}, "npower": {"human_name": "NPower", "machine_name": "npower", "youtube_link": null, "callout": null, "publishers": [], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "subtitle_html": null, "description_text": "<p><em>Donations to support NPower are made to &nbsp;<a href=\"https://support.humblebundle.com/hc/en-us/articles/205183597\" target=\"_blank\" rel=\"noopener\">PayPal Giving Fund</a>, subject to its policies.</em><em><br></em></p>\n<p>NPower is a national nonprofit, rooted in community that is committed to empowering young adults and military connected individuals to thrive in the digital economy through transformative IT training, creating pathways to economic prosperity. Through skills training, real-world experience, support and mentorship, NPower graduates launch burgeoning careers and a pathway to financial freedom for themselves and their families.</p>", "user_ratings": {}, "developers": [{"developer-name": "NPower", "developer-url": "https://www.npower.org/"}], "item_content_type": null}, "makeacompletebullethellfromscratchingodot2025edition": {"human_name": "Make a Complete Bullet Hell from Scratch in Godot (2025 Edition)", "machine_name": "makeacompletebullethellfromscratchingodot2025edition", "youtube_link": "XK94Rmlj-dU", "callout": "<div class=\"accolades\">MSRP: $50</div>", "publishers": [], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Craft a fully-fledged bullet hell game in Godot!</p> <p>Bullet hell games are renowned for their fast-paced action, dense attack patterns, and the technical challenge of managing hundreds of objects on screen - making them a fantastic way to advance your game development skills. In this course, you’ll build a complete bullet hell experience, mastering techniques such as node pooling, scene inheritance, and randomization. These new skills will vastly enhance your Godot skills and enable you to make increasingly complex games with many objects.</p> <p> <strong>You’ll learn how to:</strong> </p><ul> <li>Implement efficient object pooling</li> <li>Utilize scene inheritance for scaling</li> <li>Create dynamic object spawn systems</li> <li>Work with sprite sheets and tilemaps</li> <li>Add polished audio and SFX</li> <li>Design pickups and stat upgrades</li> </ul> <p>... and more!</p>", "user_ratings": {}, "developers": [{"developer-name": "Zenva", "developer-url": "https://academy.zenva.com/product/godot-bullet-hell-course/"}], "item_content_type": "software"}, "godot4mini-projects2025edition": {"human_name": "Godot 4 Mini-Projects (2025 Edition)", "machine_name": "godot4mini-projects2025edition", "youtube_link": "dJDsLgDli18", "callout": "<div class=\"accolades\">MSRP: $50</div>", "publishers": [], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Learn essential game development tools through engaging Godot mini-projects!</p><p>Godot is a leading open-source game engine known for its flexibility in creating both 2D and 3D games. In this course, you'll create four practical mini-projects designed to solidify your grasp on crucial game mechanics and programming concepts. From mouse input handling to 2D physics systems and collision detection, these hands-on projects will form the foundation needed to build more complex, complete games in the future.</p><p><strong>You’ll learn how to:</strong></p><ul><li>Implement mouse-click-driven interactions</li><li>Work with Godot’s physics engine</li><li>Detect collisions and handle responses</li><li>Use loops to automate complex systems</li><li>Create dynamic UI for player interaction</li><li>Communicate between scripts</li></ul><p>... and more!</p>", "user_ratings": {}, "developers": [{"developer-name": "Zenva", "developer-url": "https://academy.zenva.com/product/godot-4-mini-projects/"}], "item_content_type": "software"}, "2dcozysandboxingodot_unit2_toolmechanics": {"human_name": "Cozy Sandbox in Godot - Unit 2 - Tool Mechanics", "machine_name": "2dcozysandboxingodot_unit2_toolmechanics", "youtube_link": "EnoMhuAKXYQ", "callout": "<div class=\"accolades\">MSRP: $50</div>", "publishers": [], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Unlock interactive tool mechanics for your cozy sandbox adventure!</p><p>Tool mechanics breathe life into sandbox games, enabling players to build, farm, and explore with creativity. In this course, you’ll develop a complete tool system for your 2D Godot game while mastering system toggling and unique interactions for tools like watering cans, axes, and more. These skills will give you the modular techniques needed to add tools to any game and connect different, complex game systems together with ease!</p><p>An intermediate understanding of Godot and GDScript is needed for this course.</p><strong>You’ll learn how to:</strong><ul><li>Utilize enums and data typing</li><li>Manipulate TileMap layers via script</li><li>Set up basic combat systems</li><li>Build plant growing systems</li><li>Create interactive tool mechanics end-to-end</li><li>Add basic weather to games</li></ul><p>... and more!</p>", "user_ratings": {}, "developers": [{"developer-name": "Zenva", "developer-url": "https://academy.zenva.com/product/2d-cozy-sandbox-tools-course/"}], "item_content_type": "software"}, "4xstrategygameingodotandc_unit2_cityspawning": {"human_name": "4X Strategy Game in Godot & C# - Unit 2 - City Spawning", "machine_name": "4xstrategygameingodotandc_unit2_cityspawning", "youtube_link": "fD3KIa6-TNI", "callout": "<div class=\"accolades\">MSRP: $50</div>", "publishers": [], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Explore spawning resources, cities, and more for 4X strategy games.</p><p>Cities are an integral part of 4X strategy game development and represent one of the core mechanics of how they work. In this course, you'll master the intricacies of city spawning on a procedural hexagonal-based map and advanced UI management using Godot and C#. These skills will enable you to further master strategy game development and expand procedural map generation with functional game mechanics.</p><p>A solid understanding of Godot and C# is needed for this course.</p><p><strong>You will learn how to:</strong></p><ul><li>Select and manipulate hex map tiles</li><li>Add randomized resources to tiles</li><li>Manage UI events effectively</li><li>Differentiate signals and delegates</li><li>Spawn and manage game cities</li><li>Generate random faction colors</li></ul><p>... and more!</p>", "user_ratings": {}, "developers": [{"developer-name": "Zenva", "developer-url": "https://academy.zenva.com/product/godot-csharp-4x-city-course/"}], "item_content_type": "software"}, "uiuxforgamedesign": {"human_name": "UI/UX for Game Design", "machine_name": "uiuxforgamedesign", "youtube_link": "f0tBF6qfoMc", "callout": "<div class=\"accolades\">MSRP: $50</div>", "publishers": [], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 27.24}, "subtitle_html": null, "description_text": "<p>Discover UI and UX design principles for games!</p> <p>The user interface and user experience play a critical role in communicating information to players and creating smooth, interactive gameplay. In this course, you'll build a UI/UX mockup for a mobile game while exploring design methodologies and wireframing techniques. These techniques will provide you new ways to approach UI/UX game design and to meaningfully apply iterative design to optimize your game's experience.</p> <p><strong>You will learn how to:</strong></p> <ul> <li>Understand users with user stories</li> <li>Create definitive design criteria</li> <li>Utilize wireframes for mockups</li> <li>Apply common design conventions</li> <li>Test and iterate design choices</li> <li>Recognize design processes</li> </ul> <p>... and more!</p>", "user_ratings": {}, "developers": [{"developer-name": "Zenva", "developer-url": "https://academy.zenva.com/product/ui-ux-for-game-design/"}], "item_content_type": "software"}, "magicavoxelforbeginners_createvoxelgameassets": {"human_name": "MagicaVoxel for Beginners - Create Voxel Game Assets", "machine_name": "magicavoxelforbeginners_createvoxelgameassets", "youtube_link": "jJDHSG20ZJQ", "callout": "<div class=\"accolades\">MSRP: $50</div>", "publishers": [], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Not an artist, but eager to create Minecraft-style voxel art models for your Unity games? Discover how to build your own 3D game models with MagicaVoxel - the free program that will enable you to build simple game models and environment. No experience in MagicaVoxel, 3D modeling or artistic experience is required - you will be shown how to use the essential tools from scratch, and how to export them into Unity.</p><h5>Topics included</h5><ul><li>Using the different brushes and tools</li><li>Camera controls to navigate your scene</li><li>Creating a voxel art tree, a character, and a landscape</li><li>Importing models into Unity</li><li>Working with color palettes</li></ul><p>... and more!</p>", "user_ratings": {}, "developers": [{"developer-name": "Zenva", "developer-url": "https://academy.zenva.com/product/magicavoxel-for-non-artists-create-voxel-game-assets/"}], "item_content_type": "software"}, "buildacompleteroguelikefromscratchwithgodot2025edition": {"human_name": "Build a Complete Roguelike from Scratch with Godot (2025 Edition)", "machine_name": "buildacompleteroguelikefromscratchwithgodot2025edition", "youtube_link": "h5bdE7nFGuc", "callout": "<div class=\"accolades\">MSRP: $50</div>", "publishers": [], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Master roguelike development from start to finish with Godot.</p> <p>A staple of game development, the roguelike genre provides a framework for creating endlessly replayable and dynamic experiences for players. Through this course, you’ll construct a fully-fledged, action-packed roguelike game featuring procedural generation, challenging enemies, and powerful items. These modular-based skills will empower you to customize and expand upon the project, creating unique and complex roguelike worlds of your own.</p> <p> <strong>You will learn how to:</strong> </p><ul> <li>Generate procedural room layouts</li> <li>Design unique enemies and bosses</li> <li>Implement a functional mini-map</li> <li>Add sounds and damage visuals</li> <li>Create collectible player items</li> <li>Manage room states with doors</li> </ul> <p>... and more!</p>", "user_ratings": {}, "developers": [{"developer-name": "Zenva", "developer-url": "https://academy.zenva.com/product/godot-roguelike-course/"}], "item_content_type": "software"}, "3daction-adventuregameingodot_unit3_world": {"human_name": "3D Action-Adventure Game in Godot - Unit 3 - World", "machine_name": "3daction-adventuregameingodot_unit3_world", "youtube_link": "UWRmLIqbRy8", "callout": "<div class=\"accolades\">MSRP: $50</div>", "publishers": [], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Create fully-fledged 3D levels in Godot!</p><p>Action-adventure games hinge on immersive environments, and creating compelling levels is a crucial skill for any game developer. In this course, you'll create two distinct 3D levels - an overworld imported from Blender and a modular castle built with Godot's grid maps - while enhancing them with custom shaders for water, grass, and lava to blend functionality with visual appeal. By the end, you’ll have the skills to complete your own fully-fledged action-adventure game, ready to expand into more complex 3D projects.</p><p> <strong>You’ll learn how to:</strong></p><ul><li>Use 3D models from Blender</li><li>Create modular levels with grid maps</li><li>Build shaders for water, grass, &amp; lava</li><li>Implement level transition systems</li><li>Add environmental variety for player immersion</li><li>Implement item pickups</li></ul><p>... and more!</p>", "user_ratings": {}, "developers": [{"developer-name": "Zenva", "developer-url": "https://academy.zenva.com/product/godot-3d-adventure-levels-course/"}], "item_content_type": "software"}, "2dcozysandboxingodot_unit3_basebuilding": {"human_name": "Cozy Sandbox in Godot - Unit 3 - Base Building", "machine_name": "2dcozysandboxingodot_unit3_basebuilding", "youtube_link": "Qs6PKaL9Fp4", "callout": "<div class=\"accolades\">MSRP: $50</div>", "publishers": [], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Build a fully-fledged base-building system in your own cozy sandbox game!</p> <p>Base building and resource management are essential skills for sandbox games that invite creativity and replayability. In this course, you'll expand a 2D tile-based world with a construction mechanic, letting players gather resources and shape their environment. By weaving together multiple complex features, you’ll master integrating systems vital for advanced sandbox game development and set the stage for larger-scale, real-world Godot projects.</p> <strong>You'll learn how to:</strong> <ul> <li>Implement player-driven building systems</li> <li>Design resource gathering mechanics</li> <li>Work with advanced TileMap layers</li> <li>Dynamically place objects in game worlds</li> <li>Integrate tools, resources, and UI</li> <li>Organize code for complex features</li> </ul> <p>... and more!</p>", "user_ratings": {}, "developers": [{"developer-name": "Zenva", "developer-url": "https://academy.zenva.com/product/2d-cozy-sandbox-building-course/"}], "item_content_type": "software"}, "publishingtosteamforgodotgameprojects": {"human_name": "Publishing to Steam for Godot Game Projects", "machine_name": "publishingtosteamforgodotgameprojects", "youtube_link": "M_DZL7slM-M", "callout": "<div class=\"accolades\">MSRP: $50</div>", "publishers": [], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Publish your Godot game to Steam with confidence!</p> <p>Steamworks provides crucial tools for developers, enabling seamless publishing, player interaction, and monetization for games on Steam. In this course, you'll learn how to integrate Steamworks into your Godot project, equipping you to bring your games to a global audience as a fully-fledged Steam release. By completing the course, you’ll understand how to polish your game for publication and uncover the tools necessary to implement real-world features like achievements and player stats.</p> <p> <strong>You’ll learn how to:</strong> </p><ul> <li>Initialize Steamworks in a Godot project</li> <li>Fetch user-specific data</li> <li>Integrate player avatars into the UI</li> <li>Track and unlock Steam achievements</li> <li>Modify and display in-game stats</li> <li>Prepare your game for Steam publishing</li> </ul> <p>... and more!</p>", "user_ratings": {}, "developers": [{"developer-name": "Zenva", "developer-url": "https://academy.zenva.com/product/godot-steam-publishing-course/"}], "item_content_type": "software"}, "explorevfxwithparticlesingodot2025edition": {"human_name": "Explore VFX with Particles in Godot (2025 Edition)", "machine_name": "explorevfxwithparticlesingodot2025edition", "youtube_link": "tdGYcVccAVA", "callout": "<div class=\"accolades\">MSRP: $50</div>", "publishers": [], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Bring your games to life with dazzling visual effects in Godot!</p> <p>No matter the game, particles can provide the magic touch that transforms ordinary scenes into unforgettable moments. Through this course, you’ll dive into Godot's flexible particle system as you build a suite of five real-world effects, including fire, rain, and more. These projects will help you master the core settings and tools needed to create unique visual effects - which can easily be applied to your own Godot projects!</p> <strong>You will learn how to:</strong> <ul> <li>Work with versatile particle emitters</li> <li>Create sparks with gravity and collision</li> <li>Design immersive fire and smoke effects</li> <li>Script interactive walking dirt trails</li> <li>Craft custom impact (hit) particles</li> <li>Simulate atmospheric rain with collisions</li> </ul> <p>... and more!</p>", "user_ratings": {}, "developers": [{"developer-name": "Zenva", "developer-url": "https://academy.zenva.com/product/godot-vfx-course/"}], "item_content_type": "software"}, "createacomplete2dplatformeringodot2025edition": {"human_name": "Create a Complete 2D Platformer in Godot (2025 Edition)", "machine_name": "createacomplete2dplatformeringodot2025edition", "youtube_link": "q_FVagfyQ5g", "callout": "<div class=\"accolades\">MSRP: $50</div>", "publishers": [], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Build a fully-fledged 2D platformer using Godot!</p><p>Creating platformer games is one of the most exciting and versatile ways to explore 2D game mechanics, with a great blend of player movement, enemy AI, and interactive objects. In this course, you'll construct a complete 2D platformer game from scratch – learning core mechanics like platforming fundamentals, health systems, coin collection, and level progression. By the end, you’ll have a polished, engaging 2D platformer and the skills to expand into any sort of 2D game you might imagine!</p><p> <strong>You’ll learn how to:</strong></p><ul><li>Set up a fully functional player</li><li>Create enemies with basic AI behavior</li><li>Design and implement a health system</li><li>Add a coin collection and scoring system</li><li>Use persistent data across multiple scenes</li><li>Set up level transitions with end flags</li></ul><p>... and more!</p>", "user_ratings": {}, "developers": [{"developer-name": "Zenva", "developer-url": "https://academy.zenva.com/product/godot-2d-platformer-course/"}], "item_content_type": "software"}, "4xstrategygameingodotandc_unit1_hex-basedmap": {"human_name": "4X Strategy Game in Godot & C# - Unit 1 - Hex-Based Map", "machine_name": "4xstrategygameingodotandc_unit1_hex-basedmap", "youtube_link": "d8fS0aCHe8A", "callout": "<div class=\"accolades\">MSRP: $50</div>", "publishers": [], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 27.24}, "subtitle_html": null, "description_text": "<p>Unlock the secrets to creating engaging 4X strategy games from scratch!</p><p>Strategy games are known for their rich mechanics and complex features, with many rooted in hex-based map designs. In this course, you’ll embark on a journey to develop a turn-based strategy game using Godot and C# by learning the essential skills for creating a map from hexagonal tiles. These skills will not only put you on the starting path for making strategy games, but give you map skills that can be used in a variety of other genres and projects!</p><p><strong>You'll learn how to:</strong></p><ul><li>Create procedural terrain generation</li><li>Work with Godot's tilemap layers</li><li>Implement camera panning &amp; zooming</li><li>Handle mouse input for map scrolling</li><li>Utilize the FastNoiseLite generator</li><li>Apply C# LINQ for data queries</li></ul><p>... and more!</p>", "user_ratings": {}, "developers": [{"developer-name": "Zenva", "developer-url": "https://academy.zenva.com/product/godot-csharp-4x-hex-map/"}], "item_content_type": "software"}, "introtoriggingmodelsinblender": {"human_name": "Intro to Rigging Models in Blender", "machine_name": "introtoriggingmodelsinblender", "youtube_link": "tVccjBYF2Ic", "callout": "<div class=\"accolades\">MSRP: $50</div>", "publishers": [], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p><p>Prepare your 3D models for animation!</p></p><p><p>Rigging is an important technique for 3D animation by which one creates a skeletal-like armature that can be manipulated to move parts of the 3D mesh around. You’ll discover everything required for rigging – from setting up the “bones” to weight painting and controlling which parts of the mesh are affected by each bone.</p></p><p><p>By the end, you’ll have the foundations you’ll need to master rigging any kind of 3D model and expand your skills in creating custom assets.</p></p><p><strong>You will learn how to:</strong></p><ul><li><p>Create bones to build an armature</p></li><li><p>Connect your armature and 3D mesh</p></li><li><p>Control affected vertices with weight painting</p></li><li><p>Export rigged models</p></li><li><p>Apply Mixamo animations to your models</p></li></ul>", "user_ratings": {}, "developers": [{"developer-name": "Zenva", "developer-url": "https://academy.zenva.com/product/intro-to-rigging-models-in-blender/"}], "item_content_type": "software"}, "buildawalkingsimulatorwithgodot4": {"human_name": "Build a Walking Simulator with Godot 4", "machine_name": "buildawalkingsimulatorwithgodot4", "youtube_link": "STGr8QRB7Ao", "callout": "<div class=\"accolades\">MSRP: $50</div>", "publishers": [], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Discover the fundamentals for walking simulators in Godot 4!</p><p>Walking simulators are a popular genre for storytellers looking for new ways to convey atmosphere and visuals with their tales. In this course, you'll create modular systems for players and interactive elements that can easily be dragged and dropped into any sort of walking simulator-like game. These skills will provide you with the core features to be able to tell a multitude of stories and expand into similar genres such as horror, survival, and more.</p><p>Basic familiarity with Godot and GDScript is needed for this course.</p><p><strong>You will learn how to:</strong></p><ul><li>Set up input controls</li><li>Generate navigatable terrain</li><li>Work with first-person cameras</li><li>Implement walking, sprinting, and jumping</li><li>Improve overall game feel</li><li>Create multi-use interaction systems</li></ul><p>... and more!</p>", "user_ratings": {}, "developers": [{"developer-name": "Zenva", "developer-url": "https://academy.zenva.com/product/godot-walking-sim/"}], "item_content_type": "software"}, "2dcozysandboxingodot_unit1_playerandworld": {"human_name": "Cozy Sandbox in Godot - Unit 1 - Player & World", "machine_name": "2dcozysandboxingodot_unit1_playerandworld", "youtube_link": "6bSSIdnGDHY", "callout": "<div class=\"accolades\">MSRP: $50</div>", "publishers": [], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Build the core systems behind your own 2D cozy sandbox game!</p> <p>A charming sandbox experience begins with a lively player and a richly interactive world - essentials that bring cozy games to life and make the genre popular with players. In this course, you’ll create a complete player character with detailed animations, design tile-based worlds with auto-tiling, and add atmosphere using day-night cycles and background music. With these skills, you’ll be ready to implement 2D animations or tilemaps in any future Godot project with streamlined techniques!</p> <p> <strong>You’ll learn how to:</strong> </p><ul> <li>Set up animated player characters</li> <li>Master AnimationTree for movement</li> <li>Create layered TileMap environments</li> <li>Implement auto-tiling techniques</li> <li>Build seamless day/night cycles</li> <li>Add background music and SFX</li> </ul> <p>... and more!</p>", "user_ratings": {}, "developers": [{"developer-name": "Zenva", "developer-url": "https://academy.zenva.com/product/2d-cozy-sandbox-player-course/"}], "item_content_type": "software"}, "introtothegamedevelopmentindustry": {"human_name": "Intro to the Game Development Industry", "machine_name": "introtothegamedevelopmentindustry", "youtube_link": "Bx45Zdv0woc", "callout": "<div class=\"accolades\">MSRP: $50</div>", "publishers": [], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 1.0}, "subtitle_html": null, "description_text": "<p>Learn how the video game industry works!</p> <p>Video games are a well-established, profitable industry with unique characteristics that support the development process. You'll explore the industry's structure by learning the overall stages of development, how work is divided by role, and more. This information will help you interact with the game industry with solid footing and have a greater understanding of how games are made.</p> <p>No prior experience with the game industry is needed.</p> <p><strong>You'll learn all about:</strong></p> <ul> <li>Job roles &amp; responsibilities</li> <li>Large vs. small companies</li> <li>The development cycle</li> <li>IP copyrights</li> <li>NDAs</li> </ul> <p>... and more!</p>", "user_ratings": {}, "developers": [{"developer-name": "Zenva", "developer-url": "https://academy.zenva.com/product/intro-to-the-game-development-industry/"}], "item_content_type": "software"}, "learn3dmodelingwithblenderfromscratch": {"human_name": "Learn 3D Modeling with Blender from Scratch", "machine_name": "learn3dmodelingwithblenderfromscratch", "youtube_link": "AC557GnNGqQ", "callout": "<div class=\"accolades\">MSRP: $50</div>", "publishers": [], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Master the foundations of Blender and 3D modeling!</p><p>3D modeling, the process of creating digital 3D objects, is a robust field of study with real-world applications for animation, game development, and more. In this course, you'll explore the free and open-source Blender software and learn the fundamental techniques for manipulating meshes and creating custom assets. These skills will form the basis for expanding your 3D modeling skills and open up opportunities to create unique assets for your projects.</p><p>No prior experience is needed for this course.</p><p><strong>You will learn how to:</strong></p><ul><li>Understand how 3D objects work</li><li>Move, rotate, and scale objects</li><li>Edit vertices, edges, and faces</li><li>Work with Blender's modifiers</li><li>Apply materials to meshes</li><li>Export models for other programs</li></ul><p>... and more!</p>", "user_ratings": {}, "developers": [{"developer-name": "Zenva", "developer-url": "https://academy.zenva.com/product/learn-3d-modeling-with-blender/"}], "item_content_type": "software"}, "3daction-adventuregameingodot_unit2_inventory": {"human_name": "3D Action-Adventure Game in Godot - Unit 2 - Inventory", "machine_name": "3daction-adventuregameingodot_unit2_inventory", "youtube_link": "IcuOueQiHbQ", "callout": "<div class=\"accolades\">MSRP: $50</div>", "publishers": [], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Master advanced inventory systems for 3D action-adventure games in Godot!</p> <p>Inventory systems are a cornerstone of action-adventure games, enhancing player engagement by providing seamless item management and customization options. Through this course, you'll construct a complete inventory system from start to finish, enabling players to select weapons, shields, and style items with a dynamic 3D preview. These skills will empower you to develop robust inventory management for immersive game worlds.</p> <p> <strong>You’ll learn how to:</strong> </p><ul> <li>Build dynamic UI layouts with Godot</li> <li>Create inventory systems for equippable items</li> <li>Implement 3D item preview functionality</li> <li>Work with anchors, containers, and layout nodes</li> <li>Develop interactivity using GDScript logic</li> <li>Add visual enhancements to improve aesthetics</li> </ul> <p>... and more!</p>", "user_ratings": {}, "developers": [{"developer-name": "Zenva", "developer-url": "https://academy.zenva.com/product/godot-3d-adventure-inventory-course/"}], "item_content_type": "software"}, "constructamultiplayerlobbyingodot": {"human_name": "Construct a Multiplayer Lobby in Godot", "machine_name": "constructamultiplayerlobbyingodot", "youtube_link": "F5H2oRo91lU", "callout": "<div class=\"accolades\">MSRP: $50</div>", "publishers": [], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Build a multiplayer lobby with Godot's networking tools!</p><p>Multiplayer is a core feature in many of today’s most popular games, offering engaging social experiences for players. In this course, you'll create a complete multiplayer lobby system with player joining, management tools, and seamless game scene transitions, ready to integrate into a sample multiplayer platformer game. By mastering these concepts, you’ll have the confidence to implement robust player management systems for any kind of multiplayer game you have in mind.</p><p><strong>You’ll learn how to:</strong></p><ul><li>Connect players using IP and port setup</li><li>Construct UI elements for lobby systems</li><li>Display users by username</li><li>Individualize host and client control tools</li><li>Transition players into game scenes seamlessly</li><li>Synchronize player input using server logic</li></ul><p>... and more!</p>", "user_ratings": {}, "developers": [{"developer-name": "Zenva", "developer-url": "https://academy.zenva.com/product/godot-multiplayer-lobby-course/"}], "item_content_type": "software"}, "buildpracticalreal-worldappsusinggodot": {"human_name": "Build Practical Real-World Apps using Godot", "machine_name": "buildpracticalreal-worldappsusinggodot", "youtube_link": "Yod56xV1LVY", "callout": "<div class=\"accolades\">MSRP: $50</div>", "publishers": [], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Master real-world app development with Godot!</p><p>Godot isn’t just for games - this versatile, open-source engine is perfect for creating useful, fully-fledged applications as well! In this course, you’ll build two complete projects from start to finish: a calculator and a Body Mass Index (BMI) measurer, each with fully functional light and dark modes. By the end, you'll have a great understanding of how to harness Godot’s powerful tools and elevate your skills to tackle even more complex real-world projects.</p><p> <strong>You’ll learn how to:</strong></p><ul><li>Design themes with Godot’s styling tools</li><li>Validate and filter user input effectively</li><li>Write dynamic calculations using expressions</li><li>Toggle between light and dark UI modes</li><li>Optimize apps with advanced node structures</li><li>Explore Godot’s potential beyond game creation</li></ul><p>... and more!</p>", "user_ratings": {}, "developers": [{"developer-name": "Zenva", "developer-url": "https://academy.zenva.com/product/godot-apps-course/"}], "item_content_type": "software"}, "intermediategodot_essentialprogrammingpatterns": {"human_name": "Intermediate Godot - Essential Programming Patterns", "machine_name": "intermediategodot_essentialprogrammingpatterns", "youtube_link": "KnO-Q9nvPQY", "callout": "<div class=\"accolades\">MSRP: $50</div>", "publishers": [], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Unlock the power of coding design patterns in Godot!</p><p>Mastering design patterns is crucial for creating scalable and modular game code - regardless of the project you're building. Through this course, you'll deepen your understanding of GDScript by implementing the SOLID principles alongside industry-standard coding patterns. These insights into programming patterns will empower you to tackle more ambitious game projects, ensuring your skills evolve from start to finish.</p><p>An intermediate understanding of Godot and GDScript is needed for this course.</p><p><strong>You'll learn how to:</strong></p><ul><li>Apply SOLID coding principles</li><li>Implement singletons in Godot</li><li>Use the observer pattern effectively</li><li>Execute the command pattern</li><li>Master object pooling techniques</li><li>Optimize for scalable game design</li></ul><p>... and more!</p>", "user_ratings": {}, "developers": [{"developer-name": "Zenva", "developer-url": "https://academy.zenva.com/product/godot-coding-patterns-course/"}], "item_content_type": "software"}}, "charity_data": {"charity_items": {"npower": {"machine_name": "npower", "youtube_link": null, "item_content_type": null, "subtitle_html": null, "description_text": "<p><em>Donations to support NPower are made to &nbsp;<a href=\"https://support.humblebundle.com/hc/en-us/articles/205183597\" target=\"_blank\" rel=\"noopener\">PayPal Giving Fund</a>, subject to its policies.</em><em><br></em></p>\n<p>NPower is a national nonprofit, rooted in community that is committed to empowering young adults and military connected individuals to thrive in the digital economy through transformative IT training, creating pathways to economic prosperity. Through skills training, real-world experience, support and mentorship, NPower graduates launch burgeoning careers and a pathway to financial freedom for themselves and their families.</p>", "human_name": "NPower", "developers": [{"developer-name": "NPower", "developer-url": "https://www.npower.org/"}], "publishers": [], "user_ratings": {}}}}, "from_bundle": {"machine_name": "learngodotin2025completecoursebundle_softwarebundle", "tile_short_name": "Learn Godot in 2025: Complete Course Bundle", "short_marketing_blurb": "Harness the freedom to create with Godot ", "marketing_blurb": "Get UI/UX for Game Design, Intro to Rigging Models in Blender, Intro to the Game Development Industry, and more!", "detailed_marketing_blurb": "Your creative possibilities are limitless with the right game engine. Say hello to our latest Software Bundle: Learn Godot in 2025—a complete course collection designed to help you master Godot’s powerful, open-source, and beginner-friendly tools. Build any game you can imagine with step-by-step lessons like <em>Make a Complete Bullet Hell from Scratch in Godot </em> and <em>Make a Fully-Fledged Farming RPG with Godot</em>—then, learn to upload them online with <em>Publishing to Steam for Godot Game Projects</em>! Pay what you want for these great tools and help support NPower with your purchase.", "author": "Zenva Pty Ltd", "start_date|datetime": "2025-09-04T18:00:00", "end_date|datetime": "2025-09-25T18:00:00", "type": "bundle", "product_url": "/software/learn-godot-in-2025-complete-course-bundle-software"}, "updated_at|datetime": "2025-09-05T03:13:07.918691", "first_seen_at|datetime": "2025-09-05T03:13:07.918691"}
{"machine_name": "legoworldscollide2025_bundle", "author": "WB Games", "basic_data": {"eula": null, "human_name": "The Best of Humble Bundle: LEGO Worlds Collide 2025", "detailed_marketing_blurb": "We’re stacking up great games brick-by-brick with the all-new LEGO Worlds Collide Bundle! This gigantic bundle from Warner Bros. mixes your favorite franchises with the unmistakable LEGO charm to create unique gaming experiences that puts you in the shoes of your favorite characters. Play <em>LEGO® Star Wars™: The Skywalker Saga</em>, <em>LEGO® Marvel Super Heroes 2 Deluxe Edition</em>, <em>LEGO® Batman™ 3: Beyond Gotham Premium Edition</em>, and become the LEGO hero of legend! Pay what you want for the ultimate LEGO bundle, and help support Raiden Science Foundation with your purchase! <br/><br/><a style=\"color: #ef9741;\"><strong><em>Keys expire. Please redeem your key before March 24th. 2026.</em></strong></a>", "short_marketing_blurb": "A LEGO world for every interest ", "media_type": "game", "description": "<p><strong>A LEGO world for every interest.</strong> We’re stacking up great games brick-by-brick with the all-new LEGO Worlds Collide Bundle! This gigantic bundle from Warner Bros. mixes your favorite franchises with the unmistakable LEGO charm to create unique gaming experiences that puts you in the shoes of your favorite characters. Play <em>LEGO® Star Wars™: The Skywalker Saga</em>, <em>LEGO® Marvel Super Heroes 2 Deluxe Edition</em>, <em>LEGO® Batman™ 3: Beyond Gotham Premium Edition</em>, and become the&nbsp;<span>LEGO</span> hero of legend! Pay what you want for the ultimate LEGO bundle, and help support Raiden Science Foundation with your purchase!</p>\n<p><a style=\"color: #ef9741;\"><strong><em>Keys expire. Please redeem keys before March 24th, 2026.</em></strong></a></p>\n<p><strong>Pay $5 or more.</strong> Normally, the total cost for the games in this bundle is as much as $499. Here at Humble Bundle, you choose the price and increase your contribution to upgrade your bundle! This bundle has a minimum $5 purchase. Pay $5 or more to access Steam keys.</p>\n<p><strong>Redeem on Steam.</strong> All of the games in this bundle are available on Steam for Windows. Please check out the full system requirements <a href=\"https://support.humblebundle.com/hc/en-us/articles/27617716224667\" rel=\"noopener\" target=\"_blank\">here</a> prior to purchasing.</p>\n<p><strong>Support charity.</strong> Choose where the money goes - between the developer and to support Fight4Rare aka Raiden Science Foundation. If you like what we do, you can leave us a Humble Tip too!</p>", "legal_disclaimer": null, "required_account_links": ["steam"], "end_time|datetime": "2025-09-25T01:00:00"}, "tier_item_data": {"lego_dcsupervillains": {"human_name": "LEGO® DC Super-Villains DELUXE EDITION", "machine_name": "lego_dcsupervillains", "youtube_link": "B2gn1Qmf9eo", "callout": "For the first time in a LEGO game, you play as the villains. The story has you team up with The Joker and Harley Quinn to save Earth from a new group of heroes from a parallel universe. Deluxe Edition includes the Season Pass, which adds new characters and levels.", "publishers": [{"publisher-name": "Warner Bros. Interactive Entertainment", "publisher-url": "https://www.warnerbros.com/studio/divisions/home-entertainment/warner-bros-interactive-entertainment"}], "side_box_art_text": null, "third_party_subscribe_text": null, "min_price|money": {"currency": "USD", "amount": 15.0}, "subtitle_html": null, "description_text": "<html>\n <head>\n </head>\n <body>\n  It's good to be bad… Embark on an all-new DC/LEGO® adventure by becoming the best villain the universe has seen. Players will create and play as an all-new super-villain throughout the game, unleashing mischievous antics and wreaking havoc in an action-packed story. Set in an open world experience within the DC universe, the Justice League has disappeared, leaving Earth's protection to their counterparts, who have proclaimed themselves as the \"Justice Syndicate\". It's up to you and a crazy group of misfits to uncover the intentions of Earth's new, strange, wannabe superheroes. Joined by renowned DC Super-Villains: The Joker, Harley Quinn, and countless others from the Injustice League, players will set out on an epic adventure.\n </body>\n</html>", "user_ratings": {}, "developers": [{"developer-name": "TT Games", "developer-url": "http://www.ttgames.com/"}], "item_content_type": "game"}, "thelegoninjagomovievideogame": {"human_name": "The LEGO NINJAGO Movie Video Game", "machine_name": "thelegoninjagomovievideogame", "youtube_link": "Ng1G1NN_pLo", "callout": "Play as the ninja heroes of Ninjago, learning to masteryour skills and defend the island from the evil Lord Garmadon. The game features new combat mechanics and a large open world to explore.", "publishers": [{"publisher-name": "Warner Bros. Interactive Entertainment", "publisher-url": "https://www.warnerbros.com/company/divisions/home-entertainment/"}], "side_box_art_text": null, "third_party_subscribe_text": null, "min_price|money": {"currency": "USD", "amount": 10.0}, "subtitle_html": null, "description_text": "Find your inner ninja with the all-new LEGO NINJAGO Movie Video Game! Play as your favorite ninjas, Lloyd, Jay, Kai, Cole, Zane, Nya and Master Wu to defend their home island of Ninjago from the evil Lord Garmadon and his Shark Army. Master the art of Ninjagility by wall-running, high-jumping and battling the foes of Ninjago to rank up and upgrade the ninja's combat skills. Only in <i>the LEGO NINJAGO Movie Video Game</i> will you experience the film across 8 action packed locations each with its own unique Challenge Dojo.  And with the Battle Maps, play against friends and family in competitions for up to four players!\n", "user_ratings": {}, "developers": [{"developer-name": "Traveller's Tales", "developer-url": "https://www.ttgames.com/"}, {"developer-name": "TT Games", "developer-url": "http://www.ttgames.com/"}], "item_content_type": "game"}, "lego_marvelsuperheroes2": {"human_name": "LEGO® Marvel Super Heroes 2 DELUXE EDITION", "machine_name": "lego_marvelsuperheroes2", "youtube_link": "H-bT37vv-DI", "callout": "An open-world adventure where you team up with heroes and villains from across different eras and realities to take down the time-traveling Kang the Conqueror. Deluxe Edition includes the Season Pass, granting access to new levels and characters.", "publishers": [{"publisher-name": "Warner Bros. Interactive Entertainment", "publisher-url": "https://community.wbgames.com/"}], "side_box_art_text": null, "third_party_subscribe_text": null, "min_price|money": {"currency": "USD", "amount": 15.0}, "subtitle_html": null, "description_text": "<html>\n <head>\n </head>\n <body>\n  It's about TIME! Join your favorite Super Heroes and Super Villains from different eras and realities as they go head-to-head with the time-traveling Kang the Conqueror in the all-new, original adventure, <i>LEGO® Marvel Super Heroes 2</i>! Play as the Guardians of the Galaxy, Spider-Man, Thor, Hulk, Black Panther, Captain Marvel, Doctor Strange, Green Goblin and dozens of other Marvel Super Heroes and Villains in this cosmic battle across the time-tossed city of Chronopolis! Travel across lands -- from Ancient Egypt to The Old West, Sakaar and New York City in 2099 -- and transport objects or characters through the centuries! And, with new battle modes, friends and family can play against each other in a series of themed challenges and battle arenas!\n </body>\n</html>", "user_ratings": {}, "developers": [{"developer-name": "TT Games", "developer-url": "http://www.ttgames.com/"}], "item_content_type": "game"}, "lego_lordoftherings": {"human_name": "LEGO® The Lord of the Rings", "machine_name": "lego_lordoftherings", "youtube_link": "Mi-GNyOeCeo", "callout": "Game covers the events of all three Lord of the Rings films. You can play as Frodo, Aragorn, and many other characters as you journey to Mount Doom.", "publishers": [{"publisher-name": "Warner Bros. Interactive Entertainment", "publisher-url": "https://www.warnerbros.com/studio/divisions/home-entertainment/warner-bros-interactive-entertainment"}], "side_box_art_text": null, "third_party_subscribe_text": null, "min_price|money": {"currency": "USD", "amount": 10.0}, "subtitle_html": null, "description_text": "<p>Based on <em>The Lord of the Rings</em> motion picture trilogy, <em>LEGO&reg; The Lord of the Rings</em> follows the original story-lines of <em>The Lord of the Rings: The Fellowship of the Ring</em>, <em>The Lord of the Rings: The Two Towers</em>, and <em>The Lord of the Rings: The Return of the King</em>, taking players through the epic story events re-imagined with the humor and endless variety of LEGO play.</p>\n<p>Trusted with the dangerous task to destroy an ancient magical ring that threatens all that is good, Frodo is forced to leave his peaceful home. But the ring wants to be found and the road to Mount Doom, the only place where it can be destroyed, will be perilous and riddled with Orcs and fouler things. To help Frodo, a Fellowship is formed &mdash;Aragorn the Ranger, Gandalf the Wizard, Legolas the Elf, Gimli the Dwarf, Boromir a Man of Gondor, and Frodo&rsquo;s Hobbit friends Sam, Merry and Pippin. Players relive the legend through the LEGO mini-figures, as they explore wonders, solve timeless riddles, and overcome endless foes in their quest to destroy the Ring.</p>\n<strong>Key Features:</strong>\n<ul>\n<li>Explore all of the open-world of Middle-earth and experience epic battles with Orcs, Uruk-hai, the Balrog, the Witch-king, and other fearsome creatures.</li>\n<li>Wield the power of the Palant&iacute;r or Seeing-stone (&lsquo;one that looks far-away&rsquo;), and jump between multiple story-lines.</li>\n<li>Experience the <em>LEGO The Lord of the Rings</em> heroes come to life in an all new way with the mini-fig characters delivering the dialogue from the films.</li>\n<li>Collect, combine and forge new items in the Blacksmith Shop using Mithril, the most precious metal in Middle-earth.</li>\n<li>Discover and unlock over more than 80 playable characters, including Frodo, Aragorn, Gandalf, and many others.</li>\n<li>Collect and use a variety of weaponry and magical items, including the Light of Earendil, Elven rope, swords, and bows.</li>\n<li>Play with family and friends with easy access drop-in, drop-out game play option.</li>\n</ul>\n<p>&nbsp;</p>\n<em>LEGO THE LORD OF THE RINGS software &copy; 2012 TT Games Publishing Ltd. Produced by TT Games under license from the LEGO Group. LEGO, the LEGO logo, the Brick and the Knob configurations and the Minifigure are trademarks of the LEGO Group. &copy; 2012 The LEGO group. &copy; 2012 New Line Productions Inc. All The Lord of the Rings content other than content from the New Line films &copy; 2012 The Saul Zaentz Company d/b/a Middle-earth Enterprises (&ldquo;SZC&rdquo;). Mithril, The Lord of the Rings and the names of the characters, items, events and places therein are trademarks of SZC under license to Warner Bros. Interactive Entertainment. All other trademarks and copyrights are the property of their respective owners. All rights reserved.</em><br /><br /><em>WB GAMES LOGO, WBIE LOGO, WB SHIELD: &trade; &amp; &copy; Warner Bros. Entertainment Inc.</em><br /><em>(s12)</em>", "user_ratings": {}, "developers": [{"developer-name": "TT Games", "developer-url": "http://www.ttgames.com/"}], "item_content_type": "game"}, "lego_starwars_theforceawakens": {"human_name": "LEGO® Star Wars™: The Force Awakens DELUXE EDITION", "machine_name": "lego_starwars_theforceawakens", "youtube_link": "5FZficSh-s8", "callout": "This game retells the story of the Force Awakens film while also adding new content that bridges the gap between Return of the Jedi and The Force Awakens. Deluxe Edition includes the Season Pass, with new characters, levels, and starship missions.", "publishers": [{"publisher-name": "Warner Bros. Interactive Entertainment", "publisher-url": "http://www.warnerbros.com/studio/divisions/home-entertainment/warner-bros-interactive-entertainment"}], "side_box_art_text": null, "third_party_subscribe_text": null, "min_price|money": {"currency": "USD", "amount": 15.0}, "subtitle_html": null, "description_text": "<html>\n <head>\n </head>\n <body>\n  The Force is strong with this one… The No. 1 LEGO® videogame franchise triumphantly returns with a fun-filled, humorous journey through the new Star Wars adventure. Play as all of the characters from the movie, including Rey, Finn, Poe Dameron, Han Solo, Chewbacca, C-3PO, and BB-8, as well as Kylo Ren, General Hux and Captain Phasma.\n  <br>\n  <br>\n  In <i>LEGO® Star Wars™: The Force Awakens</i>™, relive the epic action from the blockbuster film in way that only LEGO can offer, featuring brand new story content from the Star Wars Universe that explores the time between Star Wars: Return of the Jedi and Star Wars: The Force Awakens.\n  <br>\n  <br>\n  LEGO Star Wars: The Force Awakens introduces new gameplay mechanics, including the enhanced Multi-Builds system, where players can choose from multiple building options to advance the game, or engage in intense new Blaster Battles for the first time, utilizing surrounding environments to drive back the First Order.\"\n </body>\n</html>", "user_ratings": {}, "developers": [{"developer-name": "TT Games", "developer-url": "http://www.ttgames.com/"}], "item_content_type": "game"}, "legostarwars_theskywalkersaga_deluxe": {"human_name": "LEGO Star Wars: The Skywalker Saga - Deluxe Edition", "machine_name": "legostarwars_theskywalkersaga_deluxe", "youtube_link": "n49TsZAwFEs", "callout": "Play through all nine Skywalker saga films in a brand-new LEGO style. Deluxe Edition includes the base game and seven character packs from beyond the films.", "publishers": [{"publisher-name": "Warner Bros. Games"}, {"publisher-name": "Warner Bros. Interactive Entertainment", "publisher-url": "https://warnerbrosgames.com/"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 15.0}, "subtitle_html": null, "description_text": "<span>Pre-order the game and get day one access to the Trooper Pack. The digital edition also includes an exclusive classic Obi-Wan playable character. Play all nine Star Wars saga films in an all-new game and journey to a galaxy far, far, away.</span><br><br>Play through all nine Star Wars saga films in a brand-new LEGO video game unlike any other. Experience fun-filled adventures, whimsical humor, and the freedom to fully immerse yourself in the LEGO Star Wars galaxy. <br><br>Want to play as a Jedi? A Sith? Rebel, bounty hunter, or droid? LEGO Star Wars: The Skywalker Saga features hundreds of playable characters from throughout the galaxy. Whether on land or in space, a variety of vehicles are yours to command. Jump to light speed in the Millennium Falcon, fly the T-47 Airspeeder and battle TIE fighters in Resistance X-wings… it's the ULTIMATE LEGO Star Wars experience.", "user_ratings": {}, "developers": [{"developer-name": "TT Games", "developer-url": "https://www.ttgames.com/"}], "item_content_type": "game"}, "legotheincredibles": {"human_name": "LEGO® Disney•Pixar's The Incredibles", "machine_name": "legotheincredibles", "youtube_link": "2vWoLGyB9qo", "callout": "This game covers the stories of both The Incredibles and Incredibles 2. You play as the Parr family, using your unique super powers to fight crime and rebuild the city. The game features a hub world where you can explore and find new quests.", "publishers": [{"publisher-name": "Warner Bros. Interactive Entertainment", "publisher-url": "https://www.warnerbros.com/studio/divisions/home-entertainment/warner-bros-interactive-entertainment"}], "side_box_art_text": null, "third_party_subscribe_text": null, "min_price|money": {"currency": "USD", "amount": 15.0}, "subtitle_html": null, "description_text": "<html>\n <head>\n </head>\n <body>\n  Experience the thrilling adventures of the Parr family as they conquer crime and family life through both Disney-Pixar films The Incredibles and Incredibles 2, in a LEGO® world full of fun and humor. LEGO® The Incredibles allows players to explore action-packed story levels and an epic hub world - including Municiberg, as they use their unique “Super” abilities to bring the city’s Super Villains to justice. Gamers can also team up with family and friends in 2 player co-op to assemble incredible LEGO® builds!\n </body>\n</html>", "user_ratings": {}, "developers": [{"developer-name": "TT Games", "developer-url": "http://www.ttgames.com/"}, {"developer-name": "Traveller's Tales", "developer-url": "https://www.ttgames.com/"}], "item_content_type": "game"}, "legobatman3_beyondgotham": {"human_name": "LEGO® Batman™ 3: Beyond Gotham PREMIUM EDITION", "machine_name": "legobatman3_beyondgotham", "youtube_link": "7bsHsp2WXUI", "callout": "Batman joins forces with the DC Super Heroes to stop the evil Brainiac from shrinking Earth. Premium Edition includes the Season Pass, with new character packs and levels based on popular TV shows and films.", "publishers": [{"publisher-name": "Warner Bros. Interactive Entertainment", "publisher-url": "https://www.warnerbros.com/studio/divisions/home-entertainment/warner-bros-interactive-entertainment"}], "side_box_art_text": null, "third_party_subscribe_text": null, "min_price|money": {"currency": "USD", "amount": 15.0}, "subtitle_html": null, "description_text": "<html>\n <head>\n </head>\n <body>\n  The best-selling LEGO Batman videogame franchise returns in an out-of-this-world, action-packed adventure!  In LEGO Batman™ 3: Beyond Gotham, the Caped Crusader joins forces with the super heroes of the DC Comics universe and blasts off to outer space to stop the evil Brainiac from destroying Earth.  Using the power of the Lantern Rings, Brainiac shrinks worlds to add to his twisted collection of miniature cities from across the universe.  Now the greatest super heroes and the most cunning villains must unite and journey to different Lantern Worlds to collect the Lantern Rings and stop Brainiac before it’s too late.\n  <br>\n  <br>\n  •\n  <strong>\n   Exciting space combat\n  </strong>\n  - For the first time ever, battle with Batman and his allies in outer space and the various Lantern worlds including Zamaron and Odym.\n  <br>\n  • Robust roster of DC Comics heroes and villains - Play and unlock more than 150 unique characters with amazing powers and abilities, including members of the Justice League, and BIG LEGO Figures such as Cyborg, Solomon Grundy and more.\n  <br>\n  • Unique storyline with new plots and twists –Surprising disguises, Brainiac’s mind control ability, and the power of the Lantern rings bring a whole new twist to characters you thought you knew.\n  <br>\n  • Hack computer terminals - Enter a virtual world to escape mazes, battle in arenas, and race to find the code.\n  <br>\n  • Bat-tastic Gadget Wheel - With a simple press of a button, choose and upgrade select character’s suits and abilities.\n  <br>\n  • Variety of iconic locales - Visit the Hall of Justice, the Batcave, and the Justice League Watchtower to access shops, trophy rooms, and the hero and vehicle customizers.\n </body>\n</html>", "user_ratings": {}, "developers": [{"developer-name": "Traveller's Tales", "developer-url": "http://www.ttgames.com/"}], "item_content_type": "game"}, "lego_marvel_superheroes": {"human_name": "LEGO® Marvel™ Super Heroes", "machine_name": "lego_marvel_superheroes", "youtube_link": "ydXUZbrg1nc", "callout": "This game has you take on the roles of heroes from across the Marvel Universe as you try to stop Doctor Doom from building a superweapon. The game features a large open-world Manhattan to explore and over 100 playable characters", "publishers": [{"publisher-name": "Warner Bros. Interactive Entertainment", "publisher-url": "https://www.warnerbros.com/studio/divisions/home-entertainment/warner-bros-interactive-entertainment"}], "side_box_art_text": null, "third_party_subscribe_text": null, "min_price|money": {"currency": "USD", "amount": 5.0}, "subtitle_html": null, "description_text": "<html>\n <head>\n </head>\n <body>\n  <strong>\n   <i>LEGO® Marvel™ Super Heroes</i>\n  </strong>\n  features an original story crossing the entire Marvel Universe. Players take control of Iron Man, Spider-Man, the Hulk, Captain America, Wolverine and many more Marvel characters as they unite to stop Loki and a host of other Marvel villains from assembling a super-weapon capable of destroying the world. Players will chase down Cosmic Bricks as they travel across LEGO Manhattan and visit key locations from the Marvel Universe, such as Stark Tower, Asteroid M, a Hydra base and the X-Mansion.\n  <br>\n  <br>\n  <ul>\n   <li>\n    Smash, swing  and fly in the first LEGO videogame featuring more than 100 of your favorite Super Heroes and Super Villains from the Marvel Universe, including  Iron Man, Wolverine, the Hulk, Spider-Man, Captain America, Black Widow, Loki and Deadpool.\n    <br>\n   </li>\n   <li>\n    Help save Earth as your favorite Marvel character with your super-cool strengths and abilities:\n    <br>\n    <ul>\n     <li>\n      Iron Man flies, hovers, shoots missiles and unleashes a powerful unibeam directly from his chest.\n      <br>\n     </li>\n     <li>\n      Spider-Man shoots webs, uses his spider-senses to spot objects invisible to others, crawls up walls and, of course, web-slings.\n      <br>\n     </li>\n     <li>\n      Captain America throws his mighty shield at objects and enemies, embeds it into a wall to create a platform, and protects himself from damage.\n      <br>\n     </li>\n     <li>\n      Hulk smashes!\n     </li>\n    </ul>\n   </li>\n   <li>\n    Perform new and powerful moves as “BIG-fig” characters like Hulk and Abomination.  Leave a path of destruction as you smash through LEGO walls and throw cars using hyper strength.\n    <br>\n   </li>\n   <li>\n    Discover LEGO Manhattan like never before, and travel to iconic locations from the Marvel Universe, such as the X-Mansion, Asteroid M and Asgard.\n    <br>\n   </li>\n   <li>\n    Create unique Super Heroes with customizable characters.\n    <br>\n   </li>\n   <li>\n    Enjoy an exciting original story, filled with classic LEGO videogame adventure and humor.\n   </li>\n  </ul>\n </body>\n</html>", "user_ratings": {}, "developers": [{"developer-name": "Traveller's Tales", "developer-url": "http://www.ttgames.com/"}], "item_content_type": "game"}, "thelegomovie2videogame": {"human_name": "The LEGO Movie 2 Videogame", "machine_name": "thelegomovie2videogame", "youtube_link": "yaOctJnBvLY", "callout": "Based on the 2nd film, this game has you explore a wide variety of worlds from the LEGO universe to save your friends. You can build unique items, solve puzzles, and fight alien invaders.", "publishers": [{"publisher-name": "Warner Bros. Interactive Entertainment", "publisher-url": "https://www.warnerbros.com/studio/divisions/home-entertainment/warner-bros-interactive-entertainment"}], "side_box_art_text": null, "third_party_subscribe_text": null, "min_price|money": {"currency": "USD", "amount": 15.0}, "subtitle_html": null, "description_text": "<html>\n <head>\n </head>\n <body>\n  The alien monster invaders have left Bricksburg in ruins and taken Emmet's friends! It is now up to Emmet and a host of heroic characters to go beyond their world and save their friends from the strange inhabitants of the Systar System. Journey into outer space, discover new worlds, and test your Master Building skills.\n </body>\n</html>", "user_ratings": {}, "developers": [{"developer-name": "TT Games", "developer-url": "http://www.ttgames.com/"}], "item_content_type": "game"}, "lego_hobbit": {"human_name": "LEGO® The Hobbit™", "machine_name": "lego_hobbit", "youtube_link": "83OMunaBvqU", "callout": "This game covers the events of the first two Hobbit films, An Unexpected Journey and The Desolation of Smaug. You can play as Bilbo Baggins and the thirteen Dwarves, Gandalf and more as you travel to the Lonely Mountain.", "publishers": [{"publisher-name": "Warner Bros. Interactive Entertainment", "publisher-url": "https://www.warnerbros.com/studio/divisions/home-entertainment/warner-bros-interactive-entertainment"}], "side_box_art_text": null, "third_party_subscribe_text": null, "min_price|money": {"currency": "USD", "amount": 5.0}, "subtitle_html": null, "description_text": "<html>\n <head>\n </head>\n <body>\n  Reclaim the Lost Kingdom brick by brick! Join Bilbo Baggins, Gandalf, Thorin and his company of Dwarves in an epic adventure across Middle-earth to recapture the Lonely Mountain in the most expansive LEGO game to date.\n  <br>\n  <br>\n  • Battle ravenous Trolls, dangerous Orcs and many more!\n  <br>\n  • Combine the Dwarves' unique abilities to solve puzzles - often with hilarious results!\n  <br>\n  • Explore iconic locations in Middle-earth, from the Shire to Goblin-town and beyond.\n </body>\n</html>", "user_ratings": {}, "developers": [{"developer-name": "TT Games", "developer-url": "http://www.ttgames.com/"}], "item_content_type": "game"}, "lego_batman": {"human_name": "LEGO® Batman™: The Videogame", "machine_name": "lego_batman", "youtube_link": "J2L7ThlAU9M", "callout": "The first game in the LEGO Batman series. You can play as Batman and Robin to stop a cast of super-villains from taking over Gotham City. You can also play through a villain campaign to see the story from a different perspective.", "publishers": [{"publisher-name": "Warner Bros. Interactive Entertainment", "publisher-url": "https://www.warnerbros.com/studio/divisions/home-entertainment/warner-bros-interactive-entertainment"}], "side_box_art_text": null, "third_party_subscribe_text": null, "min_price|money": {"currency": "USD", "amount": 5.0}, "subtitle_html": null, "description_text": "<html>\n <head>\n </head>\n <body>\n  When all the villains in Arkham Asylum team up and break loose, only the dynamic duo is bold enough to take them on to save Gotham City. The fun of LEGO, the drama of Batman and the uniqueness of the combination makes for a comical and exciting adventure in LEGO Batman: The Videogame. Play as Batman and his sidekick Robin as you build, drive, swing and fight your way through Gotham City capturing escaped villains including The Joker, Penguin, Scarecrow and more. Then, jump into the story from the other side and play as Batmans foes! Enjoy the power you wield and battle Batman while spreading chaos throughout the city. There is no rest for the good (or evil!).\n </body>\n</html>", "user_ratings": {}, "developers": [{"developer-name": "Traveller's Tales", "developer-url": "http://www.ttgames.com/"}], "item_content_type": "game"}, "lego_worlds": {"human_name": "LEGO® Worlds", "machine_name": "lego_worlds", "youtube_link": "5VdwCxNW4m8", "callout": "An open-world sandbox game where you can create and destroy anything you want. You can build anything you can imagine, from a simple house to a sprawling city, and explore worlds full of different environments and creatures.", "publishers": [{"publisher-name": "Warner Bros. Interactive Entertainment", "publisher-url": "https://www.warnerbros.com/studio/divisions/home-entertainment/warner-bros-interactive-entertainment"}], "side_box_art_text": null, "third_party_subscribe_text": null, "min_price|money": {"currency": "USD", "amount": 15.0}, "subtitle_html": null, "description_text": "EXPLORE. DISCOVER. CREATE. TOGETHER. <i>LEGO® Worlds</i> is an open environment of procedurally-generated Worlds made entirely of LEGO bricks which you can freely manipulate and dynamically populate with LEGO models. Create anything you can imagine one brick at a time, or use large-scale landscaping tools to create vast mountain ranges and dot your world with tropical islands.  Drop in prefabricated structures to build and customize any world to your liking.  Explore using helicopters, dragons, motorbikes or even gorillas and unlock treasures that enhance your gameplay.  Watch your creations come to life through characters and creatures that interact with you and each other in unexpected ways.  In LEGO Worlds, anything is possible!\n<br>\n<br>\n<a>\n https://go.wbgames.com/privacy-center\n</a>", "user_ratings": {}, "developers": [{"developer-name": "TT Games", "developer-url": "http://www.ttgames.com/"}, {"developer-name": "Traveller's Tales", "developer-url": "https://www.ttgames.com/"}], "item_content_type": "game"}, "raidensciencefoundation": {"human_name": "Raiden Science Foundation", "machine_name": "raidensciencefoundation", "youtube_link": null, "callout": null, "publishers": [], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "subtitle_html": null, "description_text": "<p><em>Payments to the&nbsp;<span>Raiden Science Foundation&nbsp;</span>are made via the&nbsp;<a href=\"https://support.humblebundle.com/hc/en-us/articles/205183597\" target=\"_blank\" rel=\"noopener\">PayPal Giving Fund</a>.</em><br><br><span>The Raiden Science Foundation unites the community to drive the advancement of cures for rare diseases that impact children, starting with UBA5 disorder. We are overcoming research barriers in the world of RARE to deliver life-changing therapies. Our aim is to create more than just hope.</span></p>", "user_ratings": {}, "developers": [], "item_content_type": null}, "lego_batman2": {"human_name": "LEGO® Batman™ 2: DC Super Heroes", "machine_name": "lego_batman2", "youtube_link": "x8USMnIVoxs", "callout": "The 2nd Lego Batman game, marks the first time in a LEGO game that characters have voices. You can play as Batman, Robin, and other DC heroes like Superman, Wonder Woman, and Green Lantern and battle Lex Luthor and The Joker.", "publishers": [{"publisher-name": "Warner Bros. Interactive Entertainment", "publisher-url": "https://www.warnerbros.com/studio/divisions/home-entertainment/warner-bros-interactive-entertainment"}], "side_box_art_text": null, "third_party_subscribe_text": null, "min_price|money": {"currency": "USD", "amount": 10.0}, "subtitle_html": null, "description_text": "Legends Unite!  The Dynamic Duo of Batman and Robin join other famous super heroes from the DC Universe including Superman, Wonder Woman and Green Lantern to save Gotham City from destruction at the hands of the notorious villains Lex Luthor and the Joker.\n<strong class=\"hmb\">\n <br>\n <br>\n Key Features\n</strong>\n<br>\n<ul>\n <li>\n  Collect 50 DC Comics characters and flex your new super abilities--soar through the air with free-roaming flight, freeze and push objects with Super-Breath, and heat up and cut holes through objects with Heat Vision.\n  <br>\n </li>\n <li>\n  Master new suits and gadgets such as Batman’s Power Suit and Robin’s Hazard Suit equipped with a Pressure Cannon that can absorb and dispense hazardous liquids.\n  <br>\n </li>\n <li>\n  Players can also explore Gotham City by walking, flying or unlocking and controlling a variety of cool vehicles including the Batmobile, Batwing and Batboat.\n  <br>\n </li>\n <li>\n  For the first time in a LEGO video game, hear the LEGO characters talk!\n  <br>\n </li>\n <li>\n  Enjoy the game with friends and family using easy drop-in/drop-out co-op play that features dynamic split screen.\n </li>\n</ul>", "user_ratings": {}, "developers": [{"developer-name": "Traveller's Tales", "developer-url": "http://www.ttgames.com/"}], "item_content_type": "game"}, "lego_legomovie": {"human_name": "The LEGO® Movie - Videogame", "machine_name": "lego_legomovie", "youtube_link": "hEO0YJ2mzFs", "callout": "Based on the Lego Movie, this game has you play as Emmet and a cast of colorful characters as they try to stop Lord Business from gluing the world together. The game features a new \"Master Builder\" ability that allows you to build anything you can imagine.", "publishers": [{"publisher-name": "Warner Bros. Interactive Entertainment", "publisher-url": "https://www.warnerbros.com/studio/divisions/home-entertainment/warner-bros-interactive-entertainment"}], "side_box_art_text": null, "third_party_subscribe_text": null, "min_price|money": {"currency": "USD", "amount": 5.0}, "subtitle_html": null, "description_text": "<html>\n <head>\n </head>\n <body>\n  Join Emmet and an unlikely group of resistance fighters in their heroic quest to thwart Lord Business’ evil plans—a mission that Emmet is hopelessly and hilariously unprepared for.  It’s a wild ride with a surprising mix of over 90 playable characters including Batman, Superman, Wonder Woman, the Green Ninja, Gandalf, Shakespeare, Cleopatra and more.\n </body>\n</html>", "user_ratings": {}, "developers": [{"developer-name": "TT Fusion"}, {"developer-name": "Traveller's Tales", "developer-url": "http://www.ttgames.com/"}], "item_content_type": "game"}, "lego_jurassicworld": {"human_name": "LEGO® Jurassic World™", "machine_name": "lego_jurassicworld", "youtube_link": "4OSgUJG4a7s", "callout": "All four Jurassic Park films in the LEGO style. You can play as characters from the films and explore Isla Nublar and Isla Sorna. You can also create and customize your own dinosaurs.", "publishers": [{"publisher-name": "Warner Bros. Interactive Entertainment", "publisher-url": "https://www.warnerbros.com/studio/divisions/home-entertainment/warner-bros-interactive-entertainment"}], "side_box_art_text": null, "third_party_subscribe_text": null, "min_price|money": {"currency": "USD", "amount": 15.0}, "subtitle_html": null, "description_text": "<html>\n <head>\n </head>\n <body>\n  Following the epic storylines of Jurassic Park, The Lost World: Jurassic Park and Jurassic Park III, as well as the highly anticipated Jurassic World, LEGO Jurassic World™  is the first videogame where players will be able to relive and experience all four Jurassic films.  Reimagined in LEGO form and told in TT Games’ signature classic LEGO humor, the thrilling adventure recreates unforgettable scenes and action sequences from the films, allowing fans to play through key moments and giving them the opportunity to fully explore the expansive grounds of Isla Nublar and Isla Sorna.\n  <br>\n  <br>\n  GAME FEATURES:\n  <br>\n  • Relive key moments from all four Jurassic films: An adventure 65 million years in the making - now in classic LEGO brick fun!\n  <br>\n  • Wreak havoc as LEGO dinosaurs: Choose from 20 dinosaurs, including the friendly Triceratops, deadly Raptor, vicious Compy and even the mighty T. rex.\n  <br>\n  • Customize your own dinosaur collection: Collect LEGO amber and experiment with DNA to create completely original dinosaurs, like the Dilophosaurus Rex.\n  <br>\n  • Populate and explore Isla Nublar and Isla Sorna: Put your unique dinosaur creations in to paddocks as you complete special Free Play missions.\n  <br>\n  • Play with family and friends with easy access drop-in, drop-out gameplay option.\n </body>\n</html>", "user_ratings": {}, "developers": [{"developer-name": "TT Games Ltd", "developer-url": "http://www.ttgames.com/"}], "item_content_type": "game"}, "legomarvelavengers": {"human_name": "LEGO® MARVEL's Avengers DELUXE EDITION", "machine_name": "legomarvelavengers", "youtube_link": "hyWbPHrsW_g", "callout": "Experience the stories of The Avengers and Avengers: Age of Ultron. You can play as over 200 characters from the Marvel Universe. The Deluxe Edition includes the Season Pass, which adds new character packs and levels.", "publishers": [{"publisher-name": "Warner Bros. Interactive Entertainment", "publisher-url": "http://www.warnerbros.com/studio/divisions/home-entertainment/warner-bros-interactive-entertainment"}], "side_box_art_text": null, "third_party_subscribe_text": null, "min_price|money": {"currency": "USD", "amount": 10.0}, "subtitle_html": null, "description_text": "Avengers Assemble! The best-selling LEGO® MARVEL videogame franchise returns with a new action-packed, Super Hero adventure. Join the <i>LEGO® MARVEL's Avengers</i> team and experience a videogame featuring characters and storylines from the critically-acclaimed films and more. Play as the most powerful Super Heroes in their quest to save the world.\n", "user_ratings": {}, "developers": [{"developer-name": "Traveller's Tales", "developer-url": "http://www.ttgames.com/"}], "item_content_type": "game"}}, "charity_data": {"charity_items": {"raidensciencefoundation": {"machine_name": "raidensciencefoundation", "youtube_link": null, "item_content_type": null, "subtitle_html": null, "description_text": "<p><em>Payments to the&nbsp;<span>Raiden Science Foundation&nbsp;</span>are made via the&nbsp;<a href=\"https://support.humblebundle.com/hc/en-us/articles/205183597\" target=\"_blank\" rel=\"noopener\">PayPal Giving Fund</a>.</em><br><br><span>The Raiden Science Foundation unites the community to drive the advancement of cures for rare diseases that impact children, starting with UBA5 disorder. We are overcoming research barriers in the world of RARE to deliver life-changing therapies. Our aim is to create more than just hope.</span></p>", "human_name": "Raiden Science Foundation", "developers": [], "publishers": [], "user_ratings": {}}}}, "from_bundle": {"machine_name": "legoworldscollide2025_bundle", "tile_short_name": "LEGO Worlds Collide 2025", "short_marketing_blurb": "A LEGO world for every interest ", "marketing_blurb": "Get <em>LEGO® The Hobbit™</em>, <em>LEGO® Jurassic World</em>, <em>LEGO® DC Super-Villains (DELUXE EDITION)</em>, <em>LEGO® Star Wars™: The Skywalker Saga (Deluxe)</em>, <em>LEGO® Marvel Super Heroes 2  (DELUXE EDITION)</em>, and more!", "detailed_marketing_blurb": "We’re stacking up great games brick-by-brick with the all-new LEGO Worlds Collide Bundle! This gigantic bundle from Warner Bros. mixes your favorite franchises with the unmistakable LEGO charm to create unique gaming experiences that puts you in the shoes of your favorite characters. Play <em>LEGO® Star Wars™: The Skywalker Saga</em>, <em>LEGO® Marvel Super Heroes 2 Deluxe Edition</em>, <em>LEGO® Batman™ 3: Beyond Gotham Premium Edition</em>, and become the LEGO hero of legend! Pay what you want for the ultimate LEGO bundle, and help support Raiden Science Foundation with your purchase! <br/><br/><a style=\"color: #ef9741;\"><strong><em>Keys expire. Please redeem your key before March 24th. 2026.</em></strong></a>", "author": "WB Games", "start_date|datetime": "2025-09-03T18:00:00", "end_date|datetime": "2025-09-25T01:00:00", "type": "bundle", "product_url": "/games/lego-worlds-collide-2025"}, "updated_at|datetime": "2025-09-04T03:10:32.223023", "first_seen_at|datetime": "2025-09-04T03:10:32.223023"}
{"machine_name": "indielikesandlites_bundle", "author": "Publishers", "basic_data": {"eula": null, "human_name": "Indie Likes and Lites", "detailed_marketing_blurb": "We’ve curated our hottest bundle of the summer with the coolest indie games around. Explore the action-packed puzzler from the hero that helped establish a genre with <em>Shovel Knight Pocket Dungeon</em>, try the addictive roguelite puzzle mashup <em>Let's! Revolution!</em>, or enjoy a satirical dungeon-crawler based on the monotony of modern life in <em>Going Under</em>, and much more. Fall in love with an unexpected indie game and help support World Central Kitchen with your purchase.", "short_marketing_blurb": "The biggest little indie games ", "media_type": "game", "description": "<p><strong>The biggest little indie games.</strong> We’ve curated our hottest bundle of the summer with the coolest indie games around. Explore the action-packed puzzler from the hero that helped establish a genre with <em>Shovel Knight Pocket Dungeon</em>, try the addictive roguelite puzzle mashup <em>Let's! Revolution!</em>, or enjoy a satirical dungeon-crawler based on the monotony of modern life in <em>Going Under</em>, and much more. Fall in love with an unexpected indie game and help support World Central Kitchen with your purchase.</p>\n<p><strong>Pay $5 or more.</strong> Normally, the total cost for the games in this bundle is as much as $130. Here at Humble Bundle, you choose the price and increase your contribution to upgrade your bundle! This bundle has a minimum $5 purchase. Pay $5 or more to access Steam keys.</p>\n<p><strong>Redeem on Steam.</strong> All of the games in this bundle are available on Steam for Windows — and some for Mac and Linux too.&nbsp;<span>Please review the system requirements <a href=\"https://support.humblebundle.com/hc/articles/40657318529435\">here</a>&nbsp;prior to purchasing.</span></p>\n<p><strong>Support charity.</strong> Choose where the money goes - between the developers and to support World Central Kitchen. If you like what we do, you can leave us a Humble Tip too!</p>", "legal_disclaimer": null, "required_account_links": ["steam"], "end_time|datetime": "2025-09-25T01:00:00"}, "tier_item_data": {"rogueheroes_ruinsoftasos": {"human_name": "Rogue Heroes: Ruins of Tasos", "machine_name": "rogueheroes_ruinsoftasos", "youtube_link": "TSIn5T7iJFQ", "callout": "<p>78% Positive on Steam</p>\n<p><span style=\"color: #FF9900;\">A classic top-down action-adventure roguelite, with a focus on co-op gameplay. You and up to three friends explore procedurally generated dungeons, solve puzzles, and rebuild your village. Upgrade your character and the town, making future runs easier.</span></p>", "publishers": [{"publisher-name": "Team17", "publisher-url": "https://www.team17.com/"}], "side_box_art_text": null, "third_party_subscribe_text": null, "min_price|money": {"currency": "USD", "amount": 5.0}, "subtitle_html": null, "description_text": "A dark evil stirs beneath the once peaceful land of Tasos… Deep within the four Great Dungeons, the ancient seals that hold the Titans at bay are gravely weakened and their minions have unleashed terror upon the world. <br><br>The Goddesses who forged the seals long ago have made a desperate plea for a band of heroes to come forth and save the people from a terrible fate… <br><br>You are one of the heroes tasked with saving the realm of Tasos from the terrifying Titans. Whether you choose to take on your mission solo, or with up to three friends is your decision to make. Do you have what it takes to save Tasos? <strong class=\"hmb\"> <br><br>Key Features:</strong><br><br><strong> 4-Play Rogue-lite Adventure: </strong> Play solo or in co-op with up to 4 players to take down the Titans! Remember that death is not the end; rise again, upgrade your hero and venture out once more, stronger than before!<br><br><strong> Tackle Procedural Dungeons: </strong> With its procedural engine, no two runs are the same! Each room has hand designed layouts, traps, puzzles and enemies all with randomised configurations, making every run feel fresh and different.<br><br><strong> Classic Weapons: </strong> Rogue Heroes features classic top-down swordplay with a large range of tools, spells, and weapons to use as you explore Tasos and tackle the Great Dungeons. Locate classic weapons like a Bow, Boomerang and Grappling Hook to use at your disposal.<br><br><strong>Rebuild your Town for Upgrades: </strong> Spend your hard-earned loot on new buildings for your village of Intori. From Weapons Smiths to fisheries, each can add new ways of adding to your abilities and arm you with the tools to return to the fight.<br><br><strong> Multiple Classes: </strong> Each with their own unique abilities, find which character suits your style of play and take back Tasos!", "user_ratings": {}, "developers": [{"developer-name": "Heliocentric Studios", "developer-url": "https://www.heliocentricstudios.com/"}], "item_content_type": "game"}, "goingunder": {"human_name": "Going Under", "machine_name": "goingunder", "youtube_link": "9qF7b2Io1w0", "callout": "<p>94% Positive on Steam</p>\n<p><span style=\"color: #FF9900;\">A satirical roguelike dungeon crawler where you play as an unpaid intern for a failed tech startup. You'll wield office junk as weapons and fight through the cursed ruins of businesses themed around gig workers and cryptocurrency. As you clear out the dungeons, you'll uncover the sinister truth behind your company's parent corporation.</span></p>", "publishers": [{"publisher-name": "Team17", "publisher-url": "https://www.team17.com/"}], "side_box_art_text": null, "third_party_subscribe_text": null, "min_price|money": {"currency": "USD", "amount": 10.0}, "subtitle_html": null, "description_text": "<i>Going Under</i> is a satirical dungeon crawler about exploring the cursed ruins of failed tech startups. As an unpaid intern in the dystopian city of Neo-Cascadia, you’ll wield office junk as weaponry as you make your way through the offbeat procedural dungeons beneath your company campus. <strong class=\"hmb\"> <br><br>The Future is Wack </strong> <br><br>Failed businesses no longer just cease to exist--they sink beneath the earth, and their employees are cursed to wander the halls for eternity as monsters. It’s your duty to put these monsters out of their misery and repossess their assets--so that your boss can afford a new car, or something. <strong class=\"hmb\"> <br><br>Not All Heroes Get Paychecks </strong> <br><br>Battle through the remains of failed startups themed off of gig workers, dating sites, and cryptocurrency. Uncover the true motives of your employer, a carbonated drink startup known as Fizzle, and their parent company, a subscription box manufacturer with an army of helpful shipping drones. Make friends with your co-workers! Hire a freelance goblin! Date a slime! Invest in crypto! Set a rideshare on fire!<strong class=\"hmb\"><br><br>Fight Flexibly </strong> <br><br>In the dungeons of <i>Going Under</i>, almost everything can be used as a weapon, from laptops to brooms to body pillows. Proper weapons can be found as well, but even they can break at a moment’s notice if you aren’t careful. Playing cautiously and picking the right weapon for the situation are musts if you intend on surviving your internship. <strong class=\"hmb\"> <br><br>Horrible Bosses </strong> <br><br>And you thought your boss was a monster. At the bottom of the dungeons lurk the founders of the cursed startups, getting rich off of investments while their employees fight amongst themselves. Defeat them and return to the surface with their enchanted relics to empower the company you work for.<strong class=\"hmb\"><br><br>Get Paid in Experience </strong> <br><br>As you explore, you’ll encounter powerful Skills that change the way you play. Learn them at the Cafe and they’ll show up in future runs. Use a Skill often enough, and you’ll get it “endorsed” and available to start your expeditions with. Combine multiple Skills for crazy synergies, and you’ll be cleaning house in no time. <strong class=\"hmb\"> <br><br>A World of Characters </strong> <br><br>Complete Tasks for your co-workers to gain Clout with them and unlock their unique bonuses. Learn more about Neo-Cascadia, the origins of Fizzle, and how the drone shipping empire known as Cubicle came to dominate the city. Can you save your company and yourself from <i>going under</i> for good?", "user_ratings": {}, "developers": [{"developer-name": "Aggro Crab", "developer-url": "https://aggrocrab.com/"}], "item_content_type": "game"}, "theouroborosking": {"human_name": "The Ouroboros King", "machine_name": "theouroborosking", "youtube_link": "9MkgCI9orBY", "callout": "<p>83% Positive on Steam</p>\n<p><span style=\"color: #FF9900;\">A roguelike game that puts a clever twist on chess. You build and upgrade an army of chess pieces with special abilities and \"relics,\" battling through procedurally generated maps. You'll need to master the tactical depth of chess while adapting to the wild new powers and random challenges that arise with each run.</span></p>", "publishers": [{"publisher-name": "Oriol Cosp", "publisher-url": "https://oriolcosp.com/"}, {"publisher-name": "Hawthorn Games", "publisher-url": "https://hawthorngames.com/"}], "side_box_art_text": null, "third_party_subscribe_text": null, "min_price|money": {"currency": "USD", "amount": 5.0}, "subtitle_html": null, "description_text": "<p><strong>Chess Meets Roguelike</strong><i></i></p>\n<p><i>The Ouroboros King</i> combines the strategic depth of chess with the build variety and replayability of roguelikes. Assemble a formidable army, discover powerful relics, and buy surprising gadgets to defeat the Coven. <br><br><br><strong>Conquer with Strategy</strong></p>\n<ul>\n<li><strong> Build the Ultimate Army: </strong> Combine classic and new fairy chess pieces, relics that give them bonuses, and consumable items that grant you temporary advantages to create a formidable army.</li>\n<li><strong> Perfect Your Strategy: </strong> You can only move one piece per turn, so you must choose carefully. Make your troops work together to obliterate the enemy army.</li>\n<li><strong> Another Chance: </strong> If you're defeated you can go back to action on another timeline, where the path to victory will change: different map, different enemies, different rewards... in true roguelike spirit.</li>\n</ul>\n<p><br><strong>Key Features</strong></p>\n<ul>\n<li>Lots of end-game options to dial up the difficulty to insane levels.</li>\n<li>Same-device multiplayer, challenge your friends to chess games with lots of unique pieces.</li>\n<li>Chess-based tactics, easy to learn and hard to master.</li>\n<li>15-45 minute runs, good for a short break and also longer sessions.</li>\n<li>No gatekeeping, all the content is unlocked from the start. Win or die based on your skills.</li>\n<li>No need to learn any chess openings or study anything.</li>\n<li>All in game text is available in English</li>\n</ul>\n<br>Game inspirations: Shotgun King: Chess, The Final Checkmate, Pawnbarian, Slay the Spire, Into the Breach, 5D chess with multiverse timetravel. <br><br><strong> Illustrations by Isaac Murgadella</strong>", "user_ratings": {}, "developers": [{"developer-name": "Oriol Cosp Games", "developer-url": "https://oriolcosp.com/"}], "item_content_type": "game"}, "meteorfall_krumitstale": {"human_name": "Meteorfall: Krumit's Tale", "machine_name": "meteorfall_krumitstale", "youtube_link": "atHWNWoT31U", "callout": "<p>93% Positive on Steam</p>\n<p><span style=\"color: #FF9900;\">A single-player deckbuilding roguelike and spin-off of Meteorfall: Journeys. You battle monsters on a grid-based board, using cards to attack, gain items, and cast spells. Unlike traditional card games, you have to carefully manage the board's state and choose your actions wisely, making each run a new tactical puzzle.</span></p>", "publishers": [{"publisher-name": "indienova", "publisher-url": "https://indienova.com/"}], "side_box_art_text": null, "third_party_subscribe_text": null, "min_price|money": {"currency": "USD", "amount": 10.0}, "subtitle_html": null, "description_text": "Battle the likes of sozzled bearbearians and nuke-addled snotwolves to protect our glowing green world from the sweaty hands of the Uberlich! Krumit's Tale involves the same core deck building mechanics as Meteorfall: Journeys and the same cast of overly optimistic heroes, but expands the ‘swipe’ mechanic into a dynamic grid based system. This means more depth and longevity – our heroes will have to choose perks to complement their deck-building strategy and carefully manage the board if they wish to triumph. <strong class=\"hmb\"> <br><br>Features </strong> <br><br><strong> Unique roguelike gameplay </strong> <br>Your hero starts out with a deck of basic cards (items & abilities). At the start of each dungeon, your hero's deck is shuffled into the dungeon deck (monsters) and dealt out in a 3x3 grid. Defeat monsters to earn gold, then use that gold to acquire your items & abilities from the dungeon. Remove a tile from the dungeon and a new one will be dealt out from the dungeon deck. After you clear a dungeon, you'll earn new, powerful cards to add to your deck as well as perks - passive traits that bend the rules of the game.<br><br><strong> Colorful characters </strong> <br>The exciting and colorful cast of Meteorfall: Journeys (iOS & Android) returns in Krumit's Tale. Join your favorite heroes: Bruno, Greybeard, Mischief, Rose and Muldorf as they attempt to defeat the Uberlich in this exciting new adventure. You'll also meet Krumit, a mysterious shop owner who trades in magical artifacts. Why has he summoned you to his shop, and what secrets does he hold?<br><br><strong> Unlockable heroes and cards </strong> <br>When you first visit Krumit, you'll only be able to select Bruno. After each run, you'll earn XP and automatically unlock new characters and cards. Krumit's Tale respects your time - you'll be able to unlock all of the content easily through normal gameplay, and never have to grind.<br><br><strong> .. and a whole lot more </strong> <br>\n<ul>\n<li>Five heroes, each with their own unique playstyle </li>\n<li>50+ perks - passive abilities that change the rules of the game </li>\n<li>50+ unique cards per hero, plus a neutral pool of shared cards </li>\n<li>Ideal for short bursts of play - runs take about 45-60 minutes and autosave allows you to quit at any time and continue later </li>\n<li>20+ enemies, each beautifully animated by the talented Evgeny Viitman (artist for Meteorfall: Journeys) </li>\n<li>Innovative grid-based system gives players opportunity to construct awesome combos and plan ahead </li>\n<li>Procedurally generated journey - each run, the dungeons you'll encounter vary </li>\n<li>A whimsical but deeply thought out world, humorous script and diverse cast of characters and NPC's – the Meteorfall Universe grows! </li>\n<li>Gameplay by Eric Farraro, the designer behind Meteorfall: Journeys </li>\n<li>Evgeny Viitman’s iconic art and animations </li>\n<li>Craig Barnes’ compelling musical compositions </li>\n<li>Intricate tales and item flavor penned by Danny Wadeson </li>\n<li>Krumit's professionally voice acted by Adrian Vaughan</li>\n</ul>", "user_ratings": {}, "developers": [{"developer-name": "Slothwerks", "developer-url": "https://slothwerks.com/"}], "item_content_type": "game"}, "croprotation": {"human_name": "Crop Rotation", "machine_name": "croprotation", "youtube_link": null, "callout": "<p>94% Positive on Steam</p>\n<p><span style=\"color: #FF9900;\">A minimalistic roguelike deckbuilding game with a farming theme. You draft cards to build a deck that automatically plays out, allowing you to focus on creating powerful synergies and managing your farm. Find the right card combinations to maximize your harvest!</span></p>", "publishers": [], "side_box_art_text": null, "third_party_subscribe_text": null, "min_price|money": {"currency": "USD", "amount": 10.0}, "subtitle_html": null, "description_text": "<p>You have taken a loan to buy an automated farm. The loan is huge but the farm should pay for itself right ??? RIGHT ???<br><br>Crop Rotation is a farming-theme card drafting game. Cards are played automatically so you can focus on the deck building and building synergies.</p>\n<p>Earn enough money to pay off the loan, or spend all of them rerolling for that one card</p>\n<p>Challenge yourself by climbing the rating mode.</p>", "user_ratings": {}, "developers": [{"developer-name": "Sprouting Potato"}], "item_content_type": "game"}, "rackandslay": {"human_name": "Rack and Slay", "machine_name": "rackandslay", "youtube_link": "gVCBI6ZO3Eg", "callout": "<p>91% Positive on Steam</p>\n<p><span style=\"color: #FF9900;\">A physics-based roguelite dungeon crawler that uses billiards mechanics for its combat. You play as a billiard ball and must \"pocket\" monster balls on a table-like arena. Each shot is a strategic puzzle, and you'll collect power-ups, navigate traps, and use the environment to defeat enemies and progress through the levels.</span></p>", "publishers": [{"publisher-name": "2 Left Thumbs", "publisher-url": "https://2leftthumbs.manakeep.com/"}], "side_box_art_text": null, "third_party_subscribe_text": null, "min_price|money": {"currency": "USD", "amount": 5.0}, "subtitle_html": null, "description_text": "<p><strong>THE BILLIARDS ROGUELIKE</strong></p>\n<p>A&nbsp;pure-fun roguelike dungeon crawler&nbsp;where you're a&nbsp;billiard ball&nbsp;making your way through&nbsp;randomly generated levels&nbsp;full of monster balls, traps, collectible power-ups and more!</p>\n<p><strong>DRAFT YOUR BUILD</strong></p>\n<p>Between levels, draft from a&nbsp;wide variety of 100+ items&nbsp;with game-changing effects (all of which are stackable) to&nbsp;find combos, build synergies and refine your playstyle!</p>\n<p><strong>ASCEND THE LADDER</strong></p>\n<p>Battle through&nbsp;20 levels of difficulty, each one adding more challenging modifiers!</p>\n<p><strong>VALUE YOUR TIME</strong></p>\n<p>While you unlock&nbsp;additional items&nbsp;by playing for even greater variety, there's NO meta treadmill \"+1% power\" grind!</p>\n<p><strong>PLAY YOUR WAY</strong></p>\n<p>Play a full 10-level dungeon crawl in&nbsp;20-30 minutes, or choose the condensed&nbsp;<i>Delve Mode</i>&nbsp;with half the levels but extra loot, or tackle a single-level raid with random items.</p>\n<p><strong>TRACK YOUR PROGRESS</strong></p>\n<p>Wins are not just tracked per difficulty and mode, but you also receive difficulty-specific badges for each item you win a run with. Fill your&nbsp;item compendium&nbsp;and collect them all!</p>\n<p><strong>SUPPORT AN INDIE TEAM OF 2</strong></p>\n<p>Design &amp; Code: Fabian Fischer (@Ludokultur)<br>Art &amp; Animations: Victor Negreiro (@estivador)</p>\n<p><strong>FEATURES (if you're into lists)</strong></p>\n<ul class=\"bb_ul\">\n<li><strong>UNIQUE GAMEPLAY:</strong><span>&nbsp;</span>Face physics-based billiards combat challenges tied together by a rogue-like run structure in a dungeon setting!</li>\n<li><strong>LONG-TERM REPLAYABILITY:</strong><span>&nbsp;</span>Procedural dungeon layouts filled with randomized monsters, obstacles and power-ups combine with a large variety of 100+ items to draft from to ensure no two runs play the same!</li>\n<li><strong>RELENTLESS CHALLENGE:</strong><span>&nbsp;</span>Climb through 20 difficulty levels, each one modifying the game to become more challenging!</li>\n<li><strong>GAME MODES:</strong><span>&nbsp;</span>Play a full dungeon crawl in 20-30 minutes, or condense your run to half the length with extra loot, or tackle a single-level raid for just a few minutes!</li>\n<li><strong>ENDLESS MODE:</strong><span>&nbsp;</span>Continue after winning a run to see how broken your build can get!</li>\n<li><strong>DAILY RUNS:</strong><span>&nbsp;</span>Face a new gauntlet featuring a unique combination of run modifiers every single day!</li>\n<li><strong>SIMPLE CONTROLS:</strong><span>&nbsp;</span>Pick-up-and-play controls make sure you’ll aim and shoot (via mouse or controller) within seconds!</li>\n</ul>", "user_ratings": {}, "developers": [{"developer-name": "Ludokultur", "developer-url": "https://ludokultur.de/"}], "item_content_type": "game"}, "letsrevolution": {"human_name": "Let's! Revolution!", "machine_name": "letsrevolution", "youtube_link": "CQZwzLg8Fmo", "callout": "<p>96% Positive on Steam</p>\n<p><span style=\"color: #FF9900;\">A unique roguelite puzzle mashup that combines the logic of Minesweeper with turn-based tactical combat. You navigate a grid of hidden tiles, using logic to avoid enemies and find loot, all while chasing a \"rotten King.\" The game features different classes with unique abilities, and each run is a new, procedurally generated challenge.</span></p>", "publishers": [{"publisher-name": "Hawthorn Games", "publisher-url": "https://hawthorngames.com/"}], "side_box_art_text": null, "third_party_subscribe_text": null, "min_price|money": {"currency": "USD", "amount": 10.0}, "subtitle_html": null, "description_text": "<p>Rise up in <i> Let’s! Revolution! </i> , a roguelite puzzle mashup that builds on the classic rules of Minesweeper with procedurally generated mazes and turn-based tactics. <br><br>Embark on a deadly game of hide and seek, chasing the rotten King across the enchanting land of Beebom. <br><br>Put your problem-solving skills to the test as you flip tiles to outsmart deadly foes and uncover powerful items and abilities. <br><br>Evade the King’s deadly boot-licking lackeys or take them down in strategic turn-based combat. <br><br>Gear up along the way with over 100 items and abilities for a final showdown with the King himself in Beebom City.<br><br>Dive into the beautifully illustrated and hand-animated world of Beebom in this debut game from award-winning animation house <a> BUCK </a> . The original score and sound design by <a> Antfood </a> brings Beebom to life as a vibrant sonic world. <br><br><strong>THE HEROES</strong></p>\n<p>Choose your hero from six unique classes, each with their own playstyle and abilities, including: <br><br></p>\n<ul>\n<li><strong> The Charger </strong> , a powerhouse who unleashes devastating attacks but must keep charging into hidden tiles to gain energy.</li>\n<li><strong> The Shadow </strong> , who uses cunning items like Smoke Bombs and Sleep Darts to outwit and outmaneuver enemies.</li>\n<li><strong> The Oracle </strong> , a master of perception magic who adds extra information to navigate the mazes with superior logic and teleportation.</li>\n</ul>\n<p><br><strong>KEY FEATURES:</strong><br><br><strong> PEOPLE TO MEET </strong> : From the King and his cronies to the Shopkeepers that help you along the way, you’ll encounter a diverse cast of memorable characters brought to life through expressive animation and cheeky dialogue. <br><strong>KEEP IT SIMPLE </strong> : Say goodbye to tiresome calculations and obscure probabilities. Board-game-inspired mechanics keeps the focus on learning abilities and strategic gameplay. <br><strong>GO DEEP </strong> : With 5 levels of NG+ to unlock for each class, expert players can expect to have their skills put to the ultimate test. <br><strong>OR CHILL OUT </strong> : Take a break from the challenge with Easy Mode, perfect for more casual players or those who want to overthrow the monarchy at their own pace.</p>", "user_ratings": {}, "developers": [{"developer-name": "BUCK", "developer-url": "https://www.buckgames.co/"}, {"developer-name": "AntFood", "developer-url": "https://www.antfood.com/about/"}], "item_content_type": "game"}, "luckbealandlord": {"human_name": "Luck Be A Landlord", "machine_name": "luckbealandlord", "youtube_link": "JcbKTeJ6uXU", "callout": "<p>93% Positive on Steam</p>\n<p><span style=\"color: #FF9900;\">A roguelike deckbuilder with a slot machine at its core. Instead of cards, you build a deck of \"symbols\" that appear on a slot machine. The goal is to create powerful synergies between symbols to earn enough money to pay rent each turn and ultimately defeat your landlord and capitalism.</span></p>", "publishers": [], "side_box_art_text": null, "third_party_subscribe_text": null, "min_price|money": {"currency": "USD", "amount": 5.0}, "subtitle_html": null, "description_text": "Your landlord is knocking on your door. You have one coin left to your name. You insert the coin into your slot machine...and...JACKPOT! <i>Luck be a Landlord</i>, tonight!<strong><br><br>Features </strong> <br>\n<ul>\n<li>Roguelite gameplay - The symbols you can add to the slot machine are different every time!</li>\n<li>Lots of Symbols to add to your slot machine - Each symbol has different effects and interactions.</li>\n<li>Plenty of Items to choose from - The items are different every time as well, leading to interesting build strategies.</li>\n<li>A terrible landlord to defeat.</li>\n<li>A dog you can pet.</li>\n<li>Capitalism.</li>\n</ul>", "user_ratings": {}, "developers": [{"developer-name": "TrampolineTales", "developer-url": "https://trampolinetales.com/"}], "item_content_type": "game"}, "worldcentralkitchen": {"human_name": "World Central Kitchen", "machine_name": "worldcentralkitchen", "youtube_link": "eO18SQJYxcg", "callout": null, "publishers": [], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "subtitle_html": null, "description_text": "<p><em>Donations to support World Central Kitchen are made to the&nbsp;<a rel=\"nofollow noopener\" target=\"_blank\" href=\"https://support.humblebundle.com/hc/en-us/articles/205183597\">PayPal Giving Fund</a>, subject to its policies.</em></p>\n<p><span>World Central Kitchen (WCK) is a non-profit organization addressing food insecurity during and after natural disasters and humanitarian crises, while also operating long-term programs aimed at improving livelihoods by strengthening local food ecosystems. Founded in 2010 by Chef Jose Andres following the devastating earthquake in Haiti, WCK has since served more than 8 million meals to those affected by disasters.</span></p>", "user_ratings": {}, "developers": [{"developer-name": "wck.org", "developer-url": "https://wck.org/"}], "item_content_type": null}, "shovelknightpocketdungeon": {"human_name": "Shovel Knight Pocket Dungeon", "machine_name": "shovelknightpocketdungeon", "youtube_link": "RcfQaOvgOG0", "callout": "<p>91% Positive on Steam</p>\n<p><span style=\"color: #ff9900;\">A fast-paced roguelite puzzle-adventure hybrid set in the Shovel Knight universe. The gameplay takes place on a falling-block puzzle grid where you bump into enemies to attack them. The goal is to chain together combos, manage your health and items, and defeat bosses to escape the dungeon.</span></p>", "publishers": [{"publisher-name": "Netflix", "publisher-url": "https://www.yachtclubgames.com/"}], "side_box_art_text": null, "third_party_subscribe_text": null, "min_price|money": {"currency": "USD", "amount": 10.0}, "subtitle_html": null, "description_text": "<span>Delve with Shovel Knight into the depths of the Pocket Dungeon in an action-packed puzzle adventure mashup like none other! Join your mysterious guide Puzzle Knight as you shovel through scads of foes, procure new equipment, and battle bosses both familiar and new. Explore a tale with endless twists and turns, quest as your favorite heroes, and even challenge a friend for fast-paced head-to-head competition in Shovel Knight Pocket Dungeon!</span><br><br><span>- Enter a world of falling block puzzle games, with a dungeon-crawling twist! Bump into enemies to battle them and trade damage in a unique combat system. An all-new hybrid that’s never been seen before. Group foes together for massive chain attacks while grabbing keys, power-ups, and potions to refill your health!</span><br><br><span>- Take control of more than 10 of your favorite heroes from the Shovel Knight universe, each with a unique power and play style.</span><br><br><span>- Equip yourself on the fly with a treasure trove of items and equipment. Mix and match your loadout to prepare for any encounter.</span><br><br><span>- Play in a variety of ways with Adventure Mode, 2 player competitive Versus Mode, a Daily Challenge, and much more!</span><br><br><span>- A bold new visual style complements a new story. Learn the ropes from your pal Puzzle Knight as you attempt to escape the mysterious Pocket Dungeon. Shovel Knight’s signature storytelling and humor are on full display!</span><br><br><strong>Puzzler's Pack Update</strong><br><span>Soar to new heights in Castle Quandary, equipped with new Refract abilities and Quests for every character! Puzzle Knight is now playable, there are dozens of new foes and finds, and Mr Hat's Fancy Shop has appeared, brimming with transformative headpieces.</span><br><br><strong>Paradox Pack Update</strong><br><span>New characters like The Enchantress and Chester step into the fray, accompanied by new stages Lost City and Explodatorium! Find new secret quests, cheat codes, and unlock over a dozen new relics and items. Unleash your creativity with Mod Support!</span>", "user_ratings": {}, "developers": [{"developer-name": "Yacht Club Games", "developer-url": "https://www.yachtclubgames.com/"}, {"developer-name": "VINE"}], "item_content_type": "game"}}, "charity_data": {"charity_items": {"worldcentralkitchen": {"machine_name": "worldcentralkitchen", "youtube_link": "eO18SQJYxcg", "item_content_type": null, "subtitle_html": null, "description_text": "<p><em>Donations to support World Central Kitchen are made to the&nbsp;<a rel=\"nofollow noopener\" target=\"_blank\" href=\"https://support.humblebundle.com/hc/en-us/articles/205183597\">PayPal Giving Fund</a>, subject to its policies.</em></p>\n<p><span>World Central Kitchen (WCK) is a non-profit organization addressing food insecurity during and after natural disasters and humanitarian crises, while also operating long-term programs aimed at improving livelihoods by strengthening local food ecosystems. Founded in 2010 by Chef Jose Andres following the devastating earthquake in Haiti, WCK has since served more than 8 million meals to those affected by disasters.</span></p>", "human_name": "World Central Kitchen", "developers": [{"developer-name": "wck.org", "developer-url": "https://wck.org/"}], "publishers": [], "user_ratings": {}}}}, "from_bundle": {"machine_name": "indielikesandlites_bundle", "tile_short_name": "Indie Likes and Lites", "short_marketing_blurb": "The biggest little indie games ", "marketing_blurb": "Get <em>Going Under</em>, <em>Crop Rotation</em>, <em>Rack and Slay</em>, <em>Let's! Revolution!</em>, <em>Meteorfall: Krumit's Tale</em>, <em>Shovel Knight Pocket Dungeon</em>, and more!", "detailed_marketing_blurb": "We’ve curated our hottest bundle of the summer with the coolest indie games around. Explore the action-packed puzzler from the hero that helped establish a genre with <em>Shovel Knight Pocket Dungeon</em>, try the addictive roguelite puzzle mashup <em>Let's! Revolution!</em>, or enjoy a satirical dungeon-crawler based on the monotony of modern life in <em>Going Under</em>, and much more. Fall in love with an unexpected indie game and help support World Central Kitchen with your purchase.", "author": "Publishers", "start_date|datetime": "2025-09-03T18:00:00", "end_date|datetime": "2025-09-25T01:00:00", "type": "bundle", "product_url": "/games/indie-likes-and-lites"}, "updated_at|datetime": "2025-09-04T03:10:32.223023", "first_seen_at|datetime": "2025-09-04T03:10:32.223023"}
{"machine_name": "createfuturenowmeapearlyaccessprogrambooksandliveprojectsmanning_bookbundle", "author": "Manning Publications", "basic_data": {"eula": null, "human_name": "Humble Tech Learning Bundle: Create the Future Now! MEAP Early Access Program Books and liveProjects by Manning", "detailed_marketing_blurb": "Learn the skills of the future and beyond with the latest Humble Tech Learning Bundle. This comprehensive library of early access program books and liveProjects courses is designed to help you master Multifunctional Enterprise Application Platforms (MEAP) with lessons like <em>Python Workout, Second Edition</em>, <em>Secrets of the JavaScript Ninja, Third Edition</em>, and more. Start a new career using AI, Python, and more today—plus, a portion of your purchase helps support the charity of your choice.", "short_marketing_blurb": "Create the future now with Python", "media_type": "ebook", "description": "<p><strong>Create the future now with Python.</strong> Learn the skills of the future and beyond with the latest Humble Tech Learning Bundle. This comprehensive library of early access program books and liveProjects courses is designed to help you master Multifunctional Enterprise Application Platforms (MEAP) with lessons like <em>Python Workout, Second Edition</em>, <em>Secrets of the JavaScript Ninja, Third Edition</em>, and more. Start a new career using AI, Python, and more today—plus, a portion of your purchase helps support the charity of your choice.</p>\n<p><strong>Pay $3 or more.</strong> Normally, the total cost for the ebooks in this bundle is as much as $1,119. Here at Humble Bundle, you choose the price and increase your contribution to upgrade your bundle! This bundle has a minimum $3 purchase. Pay $3 or more to access keys.</p>\n<p><b data-stringify-type=\"bold\">Redeem your keys.&nbsp;</b><span>The ebooks in this bundle are redeemable on the <a href=\"https://www.manning.com/freebook\">Manning</a></span><span>&nbsp;website.&nbsp;</span>Instructions and a list of recommended reading programs can be found <a href=\"https://support.humblebundle.com/hc/en-us/articles/24093917594139-Code-Like-a-Pro-2024-by-Manning-Redemption-Instructions\">here.</a></p>\n<p><strong>Support charity.</strong> Choose where the money goes - between the publisher and to support No Kid Hungry/Share Our Strength. If you like what we do, you can leave us a Humble Tip too!</p>", "legal_disclaimer": null, "required_account_links": ["steam"], "end_time|datetime": "2025-09-22T18:00:00"}, "tier_item_data": {"moderncthirdedition": {"human_name": "Modern C, Third Edition", "machine_name": "moderncthirdedition", "youtube_link": null, "callout": "MEAP", "publishers": [{"publisher-name": "Manning", "publisher-url": "https://www.manning.com/books/modern-c-third-edition"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 3.0}, "subtitle_html": null, "description_text": "<p>Modern C, Third Edition is fully revised from the bestselling original to fully cover the C23 standard. For new or returning C coders, it starts with fundamentals like structure, grammar, compilation, and execution. From there, you’ll advance to control structures, data types, operators, and functions, as you gain a deeper understanding of what’s happening under the hood. This expanded C23 edition contains new coverage discussing compound expressions and lambdas, a comprehensive approach for program failure, and new appendices to aid your transition to C23. You’ll code as you go with concept-reinforcing exercises and skill-honing challenges along the way.</p>", "user_ratings": {}, "developers": [{"developer-name": "Jens Gustedt", "developer-url": "https://www.manning.com/books/modern-c-third-edition"}], "item_content_type": "ebook"}, "fouraialgorithmprojectswithpython_4projectseries": {"human_name": "Four AI Algorithm Projects with Python: 4 Project Series", "machine_name": "fouraialgorithmprojectswithpython_4projectseries", "youtube_link": null, "callout": "liveProject", "publishers": [{"publisher-name": "Manning", "publisher-url": "https://www.manning.com/liveprojectseries/four-ai-algorithm-projects-with-python-ser"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>In this series of liveProjects, you’ll learn how some of the most common AI algorithms work under the hood by using them to solve fun and engaging problems. You don’t need expert Python skills or lots of math knowledge to get started. Dive right in by creating a classification algorithm model that can turn scribbles into phone numbers, then explore particle swarm optimization and the Boids algorithm to model flocks of birds. Next, you’ll delve into Expert Systems—a classic approach to artificial intelligence—and use them to create an AI to help identify what kind of animal a zoo attendee is looking at. Finally, you’ll build a working neural network to help a bank demystify their customer’s handwritten deposit slips.</p>", "user_ratings": {}, "developers": [{"developer-name": "Rod Stephens", "developer-url": "https://www.manning.com/liveprojectseries/four-ai-algorithm-projects-with-python-ser"}], "item_content_type": "game"}, "softwaredesigninpython": {"human_name": "Software Design in Python", "machine_name": "softwaredesigninpython", "youtube_link": null, "callout": "MEAP", "publishers": [{"publisher-name": "Manning", "publisher-url": "https://www.manning.com/books/software-design-in-python"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 18.0}, "subtitle_html": null, "description_text": "<p>Software Design in Python helps you build software like the pros. In clear, jargon-free language it lays out the object-oriented design principles, practices, and patterns that you need to know to build scalable and maintainable applications. Throughout, you’ll find intuitive “before” and “after” examples that show you what bad code looks like, and how to fix it with the right pattern. Conversation sidebars feature engaging talking heads that ask-and-answer common questions. If you know the basics of Python code and are ready to make the leap to building software, this book will be the patient and insightful mentor you need!</p>", "user_ratings": {}, "developers": [{"developer-name": "Ronald Mak", "developer-url": "https://www.manning.com/books/software-design-in-python"}], "item_content_type": "ebook"}, "moderncssforaportfoliopage_4projectseries": {"human_name": "Modern CSS for a Portfolio Page: 4 Project Series", "machine_name": "moderncssforaportfoliopage_4projectseries", "youtube_link": null, "callout": "liveProject", "publishers": [{"publisher-name": "Manning", "publisher-url": "https://www.manning.com/liveprojectseries/modern-css-for-a-portfolio-page-ser"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>A portfolio page is vital for any professional frontend web developer. In this series of liveProjects, you’ll utilize some of the modern features of CSS to create a stunning portfolio page of your very own. You’ll show off to your prospective clients with both a light and a dark theme that utilizes custom properties; use new ways to select elements when you style your contact form; deliver responsive designs that use grid, subgrid, columns, and flexbox to lay out content; and explore scroll-snap and timeline animations to alter the scroll behavior of your page.</p>", "user_ratings": {}, "developers": [{"developer-name": "Martine Dowden", "developer-url": "https://www.manning.com/liveprojectseries/modern-css-for-a-portfolio-page-ser"}], "item_content_type": "game"}, "aiagentsandapplications": {"human_name": "AI Agents and Applications", "machine_name": "aiagentsandapplications", "youtube_link": null, "callout": "MEAP", "publishers": [{"publisher-name": "Manning", "publisher-url": "https://www.manning.com/books/ai-apps-with-langchain"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>AI Agents and Applications provides a practical, step-by-step approach to building LLM-powered applications using state of the art tools like LangChain, LangGraph, and MCP. You’ll quickly master prompt engineering techniques for automated systems and advanced RAG techniques. Then, you’ll move into structured agentic workflows with LangGraph and flexible, tool-based agent architectures. The book guides you through creating single and multi-agent systems, debugging and optimizing agent performance, and integrating external tools using the new Model Context Protocol (MCP). With visual explanations and real code throughout, this book delivers everything you need to go from your product ideas to production-ready AI solutions.</p>", "user_ratings": {}, "developers": [{"developer-name": "Roberto Infante", "developer-url": "https://www.manning.com/books/ai-apps-with-langchain"}], "item_content_type": "ebook"}, "pythonworkoutsecondedition": {"human_name": "Python Workout, Second Edition", "machine_name": "pythonworkoutsecondedition", "youtube_link": null, "callout": "MEAP", "publishers": [{"publisher-name": "Manning", "publisher-url": "https://www.manning.com/books/python-workout-second-edition"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Python Workout, Second Edition hones your Python chops just like you would in the gym. Repetition of key skills builds muscle memory. New challenges increase your strength. Combining new and old techniques encourages flexibility. Expert Python coach Reuven Lerner guides you through each exercise with a detailed solution designed to give you a deeper fluency and understanding of Python.</p>", "user_ratings": {}, "developers": [{"developer-name": "Reuven Lerner", "developer-url": "https://www.manning.com/books/python-workout-second-edition"}], "item_content_type": "ebook"}, "fightfraudwithmachinelearning": {"human_name": "Fight Fraud with Machine Learning", "machine_name": "fightfraudwithmachinelearning", "youtube_link": null, "callout": "MEAP", "publishers": [{"publisher-name": "Manning", "publisher-url": "https://www.manning.com/books/fight-fraud-with-machine-learning"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 18.0}, "subtitle_html": null, "description_text": "<p>Fight Fraud with Machine Learning teaches you to build and deploy state-of-the-art fraud detection systems. You’ll start with the basics of rule-based systems, iterating chapter-by-chapter until you’re creating tools to stop the most sophisticated modern attacks. Almost every online fraud you might encounter is covered in detail.</p><p>Examples and exercises help you practice identifying credit card fraud with logistic regression, using decision trees and random forests to identify fraudulent online transactions, and detecting fake insurance claims through gradient boosted trees. You’ll deploy neural networks to tackle Know Your Customer fraud, spot social network bots, catch deepfakes, and more! Plus, you’ll even dive into the latest research papers to discover powerful deep learning techniques such as vision transformers.</p>", "user_ratings": {}, "developers": [{"developer-name": "Ashish Ranjan Jha", "developer-url": "https://www.manning.com/books/fight-fraud-with-machine-learning"}], "item_content_type": "ebook"}, "opensourcellmsonyourowncomputer_3projectseries": {"human_name": "Open Source LLMs on Your Own Computer: 3 Project Series", "machine_name": "opensourcellmsonyourowncomputer_3projectseries", "youtube_link": null, "callout": "liveProject", "publishers": [{"publisher-name": "Manning", "publisher-url": "https://www.manning.com/liveprojectseries/open-source-llms-on-your-own-computer"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Your school district needs you! In this series of liveProjects, you’ll assist them by developing a custom chatbot for teaching students chemistry based on Meta AI’s Llama large language model. To do this, you’ll utilize open-source tools, including WasmEdge, LlamaEdge, Gaia, Git, Qdrant, Python, and UnSloth. Your AI application will need to run with very low resources—it needs to work on the school’s outdated computers—and be equipped with an intuitive user interface. Once you’ve developed your foundation, you’ll supplement it with a chemistry-specific knowledge base to ensure it can’t hallucinate! You will also fine-tune the model to make it work better with agents in the ecosystem while staying safe!</p>", "user_ratings": {}, "developers": [{"developer-name": "Michael Yuan and Tony Yuan", "developer-url": "https://www.manning.com/liveprojectseries/open-source-llms-on-your-own-computer"}], "item_content_type": "game"}, "aresponsivewebappwithcnetandreact_4projectseries": {"human_name": "A Responsive Web App with C#, .Net, and React: 4 Project Series", "machine_name": "aresponsivewebappwithcnetandreact_4projectseries", "youtube_link": null, "callout": "liveProject", "publishers": [{"publisher-name": "Manning", "publisher-url": "https://www.manning.com/liveprojectseries/responsive-web-app-csharp-dotnet-react-ser"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 3.0}, "subtitle_html": null, "description_text": "<p>Logistica Transport is growing fast. To keep up with their needs, they need a new web app solution that can replace their old desktop app. You’ve been hired to help build it for them! You’ll start by establishing a MySQL database from scratch to replace an old spreadsheet, then expand the database with vital connection functionalities based on Entity Framework Core. Next, you’ll assemble a React.js frontend and link up its tables to populate your database with data. Finally, to make sure everything’s running smoothly, you’ll put your app through a robust testing program—then start rolling it out to Logistica’s ever-growing base of customers!</p>", "user_ratings": {}, "developers": [{"developer-name": "Ockert du Preez", "developer-url": "https://www.manning.com/liveprojectseries/responsive-web-app-csharp-dotnet-react-ser"}], "item_content_type": "game"}, "buildacustomchatbotusinglangchainandchatgpt_3projectseries": {"human_name": "Build a Custom Chatbot Using LangChain and ChatGPT: 3 Project Series", "machine_name": "buildacustomchatbotusinglangchainandchatgpt_3projectseries", "youtube_link": null, "callout": "liveProject", "publishers": [{"publisher-name": "Manning", "publisher-url": "https://www.manning.com/liveprojectseries/build-a-custom-chatbot-using-langchain-and-chatgpt-ser"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 18.0}, "subtitle_html": null, "description_text": "<p>InfoHub has a groundbreaking idea—a chatbot that can answer a company’s questions about its knowledge base just like the user was conversing with a real human expert! This idea can now become a reality thanks to the latest advances in large language models (LLMs). That’s exactly what you’ll be doing in this liveProject series! You’ll step into the developer role at InfoHub, and deliver a chatbot capable of everything from troubleshooting tech issues to answering queries about product specifications. You’ll integrate GPT-3.5 into a chatbot to understand user questions and retrieve related embeddings, utilize ChromaDB to manage storage and retrieval, and then deploy the whole system via Streamlit.</p>", "user_ratings": {}, "developers": [{"developer-name": "Pablo Elgueta", "developer-url": "https://www.manning.com/liveprojectseries/build-a-custom-chatbot-using-langchain-and-chatgpt-ser"}], "item_content_type": "game"}, "movingtoc_4projectseries": {"human_name": "Moving to C#: 4 Project Series", "machine_name": "movingtoc_4projectseries", "youtube_link": null, "callout": "liveProject", "publishers": [{"publisher-name": "Manning", "publisher-url": "https://www.manning.com/liveprojectseries/moving-to-csharp-ser"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 18.0}, "subtitle_html": null, "description_text": "<p>There’s never been a better time to move to C#! First-class Azure cloud support, AI Framework integration, and improved code performance in the latest .NET versions all make this an exciting time to be a C# developer. In this series of liveProjects, you’ll turn your existing programming skills into C# mastery by building an app for the agricultural consultancy Ground Truth Consulting (GTC). You’ll go deep into the structural essence of the language, mastering namespaces and classes for organized and reusable code. Learn to make effortless API requests by setting up access to data from the APIs of Congress and the Federal Register, optimize your data storage and retrieval with the efficiency of C# dictionaries, and ensure the reliability and integrity of your software with unit tests crafted using the xUnit framework. With hands-on experience and newfound confidence, you'll navigate the world of C# effortlessly.</p>", "user_ratings": {}, "developers": [{"developer-name": "Alejandro Saez", "developer-url": "https://www.manning.com/liveprojectseries/moving-to-csharp-ser"}], "item_content_type": "game"}, "transformersandexplainableaiforcomputervision_4projectseries": {"human_name": "Transformers and Explainable AI for Computer Vision: 4 Project Series", "machine_name": "transformersandexplainableaiforcomputervision_4projectseries", "youtube_link": null, "callout": "liveProject", "publishers": [{"publisher-name": "Manning", "publisher-url": "https://www.manning.com/liveprojectseries/transformers-and-explainable-ai-for-computer-vision-ser"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>In this series of liveProjects, you’ll join up with four different computer vision companies to explore computer vision models powered by the latest deep learning architectures. You’ll utilize the groundbreaking transformer architecture, which forms the driving force behind ChatGPT, to develop a series of increasingly complex models. Starting with a classifier to detect brain tumors, you'll move on to a segmentation algorithm and an object detection application capable of detecting construction vehicles and structural flaws. Finally, you’ll take on the role of an MLOps expert, implementing model deployment and explainability in the systems you’ve developed.</p>", "user_ratings": {}, "developers": [{"developer-name": "Anuradha Kar", "developer-url": "https://www.manning.com/liveprojectseries/transformers-and-explainable-ai-for-computer-vision-ser"}], "item_content_type": "game"}, "buildyourfirstmicroservice_3projectseries": {"human_name": "Build Your First Microservice: 3 Project Series", "machine_name": "buildyourfirstmicroservice_3projectseries", "youtube_link": null, "callout": "liveProject", "publishers": [{"publisher-name": "Manning", "publisher-url": "https://www.manning.com/liveprojectseries/build-your-first-microservice-ser"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Play the role of developer for Musify, a SaaS company that helps startups bring their products to market. Musify’s new client wants to launch a music-streaming app connecting music artists and end users. For this large and complex application, Musify’s development team has chosen to take advantage of the microservices architecture—and avoid the problems that often come with monolith applications. Using popular Node.js technology, you’ll build a CRUD (Create, Read, Update, and Delete) REST API in Node.js and Express that will allow artists to upload and delete their music audio files as well as letting end users view and listen to songs according to their preferences. You’ll publish the REST API to an Azure container registry in the cloud, allowing the development team to easily and conveniently run and update the application. You’ll create an additional REST API for storing audio files and use Docker Compose to run both microservices and connect them with a database. When you’re done, you’ll have valuable firsthand experience building a complete microservices application using popular Node.js technology.</p>", "user_ratings": {}, "developers": [{"developer-name": "Haider Malik", "developer-url": "https://www.manning.com/liveprojectseries/build-your-first-microservice-ser"}], "item_content_type": "game"}, "buildpythonwebappswithstreamlit": {"human_name": "Build Python Web Apps with Streamlit", "machine_name": "buildpythonwebappswithstreamlit", "youtube_link": null, "callout": "MEAP", "publishers": [{"publisher-name": "Manning", "publisher-url": "https://www.manning.com/books/build-python-web-apps-with-streamlit"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 3.0}, "subtitle_html": null, "description_text": "<p>Build Python Web Apps with Streamlit teaches you how to build great web and front-ends using the Streamlit framework and Python. You'll start with the basics by creating a password validator and a simple to-do list app. Then, you’ll progressively build your skills all the way to developing an executive dashboard, an AI chatbot, and an LLM-based searchable knowledge base. You’ll love the crystal-clear explanations and the interesting hands-on projects as you develop your Streamlit skills step by step.</p>", "user_ratings": {}, "developers": [{"developer-name": "Aneev Kochakadan", "developer-url": "https://www.manning.com/books/build-python-web-apps-with-streamlit"}], "item_content_type": "ebook"}, "secretsofthejavascriptninjathirdedition": {"human_name": "Secrets of the JavaScript Ninja, Third Edition", "machine_name": "secretsofthejavascriptninjathirdedition", "youtube_link": null, "callout": "MEAP", "publishers": [{"publisher-name": "Manning", "publisher-url": "https://www.manning.com/books/secrets-of-the-javascript-ninja-third-edition"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Whether you’re a JavaScript novice or a battle-hardened web developer, you’ll love Secrets of the JavaScript Ninja, Third Edition! Written for web developers who know the basics of JavaScript or TypeScript, this amazing book delivers best practices for writing code that’s readable, reliable, and performant. This fully-revised third edition includes TypeScript techniques, along with modern tools like ESLint that help you catch bugs before they crash your apps. Plus, you’ll find practical tips on overcoming common pain points in modern JavaScript development, such as the divide between ECMAScript and CommonJS modules.</p>", "user_ratings": {}, "developers": [{"developer-name": "Trevor Burnham, Bear Bibeault, Josip Maras, John Resig", "developer-url": "https://www.manning.com/books/secrets-of-the-javascript-ninja-third-edition"}], "item_content_type": "ebook"}, "roboticsforprogrammers": {"human_name": "Robotics for Programmers", "machine_name": "roboticsforprogrammers", "youtube_link": null, "callout": "MEAP", "publishers": [{"publisher-name": "Manning", "publisher-url": "https://www.manning.com/books/robotics-for-programmers"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Robotics for Programmers teaches you the patterns of robotics software through hands-on examples and clear, jargon-free guidance. It relates new ideas about robotics to programming concepts you’re already familiar with, so you can easily make the jump from traditional software to robot development.</p><p>Unlike other books that feature toy projects and unrealistic examples, this practical book centers on the techniques you’ll use in real robotics applications. You’ll learn by simulating factory floor robots, survey drones, and even a multi-function mobile manipulator! The examples use the accessible ROS2 framework, and all core concepts and algorithms are taught in a way you can apply to the proprietary software you’ll encounter in robotics companies. By the time you’re finished, you’ll have the programming skills to start developing serious robots.</p>", "user_ratings": {}, "developers": [{"developer-name": "Andreas Bihlmaier", "developer-url": "https://www.manning.com/books/robotics-for-programmers"}], "item_content_type": "ebook"}, "adamnfinestablediffusionbook": {"human_name": "A Damn Fine Stable Diffusion Book", "machine_name": "adamnfinestablediffusionbook", "youtube_link": null, "callout": "MEAP", "publishers": [{"publisher-name": "Manning", "publisher-url": "https://www.manning.com/books/a-damn-fine-stable-diffusion-book"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>A Damn Fine Stable Diffusion Book helps you get amazing results out of Stable Diffusion fast. You’ll learn how to create everything from graphics for blogs and websites to hi-resolution desktop wallpapers. Start with the basics of text prompt engineering for image generation, then quickly move on to using the webUI to tweak your outputs to your specifications. \nFrom there, you’ll explore methods for making hi-resolution images, programming Stable Diffusion directly with Python and Hugging Face, utilizing ControlNet for poses, and custom LoRAs for specific styles and images. Finally, you’ll dive into creating your own models with in-depth customization methods you can use to create images of your friends, deliver reusable characters, and apply custom styles. You’ll even learn to make a damn fine cup of coffee!</p><p> </p>", "user_ratings": {}, "developers": [{"developer-name": "Will Kurt", "developer-url": "https://www.manning.com/books/a-damn-fine-stable-diffusion-book"}], "item_content_type": "ebook"}, "emotionalux": {"human_name": "Emotional UX", "machine_name": "emotionalux", "youtube_link": null, "callout": "MEAP", "publishers": [{"publisher-name": "Manning", "publisher-url": "https://www.manning.com/books/emotional-ux"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Emotional UX shows you how to harness tested principles of cognitive science and human psychology to create positive emotional experiences for users of your apps and websites. Written in an engaging style and filled with compelling visuals, you'll appreciate the book's practical examples, real-world screenshots, and hands-on exercises—from optimizing mobile apps to developing your own design vision. Discover how Gestalt psychology guides human perception, leverage behavioral science for better UI/UX, and learn how cognitive psychology can help you create products users can't resist!</p>", "user_ratings": {}, "developers": [{"developer-name": "Vadym Grin", "developer-url": "https://www.manning.com/books/emotional-ux"}], "item_content_type": "ebook"}, "buildinganaivoiceassistant_4projectseries": {"human_name": "Building an AI Voice Assistant: 4 Project Series", "machine_name": "buildinganaivoiceassistant_4projectseries", "youtube_link": null, "callout": "liveProject", "publishers": [{"publisher-name": "Manning", "publisher-url": "https://www.manning.com/liveprojectseries/building-an-ai-voice-assistant"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 18.0}, "subtitle_html": null, "description_text": "<p>AI is the future—and Smart Solutions, Inc. knows it! That’s why they’ve called on you to build EchoBuddy, a new AI-powered voice assistant designed to help their customers interact with smart-home technology more effectively. In this liveProject series, you’ll build EchoBuddy with standard web technologies combined with third-party API services and OpenAI’s powerful industry-leading GPT model. You’ll work with the Web Speech API to capture user queries and generate spoken responses, and utilize the SvelteKit framework, the OpenAI JavaScript library, and Tailwind CSS to build an intuitive and attractive app with rich UI widgets.</p>", "user_ratings": {}, "developers": [{"developer-name": "Joe Attardi", "developer-url": "https://www.manning.com/liveprojectseries/building-an-ai-voice-assistant"}], "item_content_type": "game"}, "learndockerinamonthoflunchessecondedition": {"human_name": "Learn Docker in a Month of Lunches, Second Edition", "machine_name": "learndockerinamonthoflunchessecondedition", "youtube_link": null, "callout": "MEAP", "publishers": [{"publisher-name": "Manning", "publisher-url": "https://www.manning.com/books/learn-docker-in-a-month-of-lunches-second-edition"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 18.0}, "subtitle_html": null, "description_text": "<p>Learn Docker in a Month of Lunches, Second Edition delivers the core skills you’ll need to do most Docker tasks in just 22 short lessons. The book is hands-on all the way. Each short chapter guides you through an essential concept, ending with a self-contained lab you can use to practice your new skill. The samples are all guaranteed to work on any Linux, Windows, or Mac system. You’ll explore building and running Docker apps in Go, Java, Node, and .NET, adding observability with monitoring dashboards, running databases in containers, running containers in the cloud, and migrating legacy systems to Docker. There's even a primer on using Kubernetes to manage your containers!</p>", "user_ratings": {}, "developers": [{"developer-name": "Elton Stoneman", "developer-url": "https://www.manning.com/books/learn-docker-in-a-month-of-lunches-second-edition"}], "item_content_type": "ebook"}, "aiapplicationsmadeeasy": {"human_name": "AI Applications Made Easy", "machine_name": "aiapplicationsmadeeasy", "youtube_link": null, "callout": "MEAP", "publishers": [{"publisher-name": "Manning", "publisher-url": "https://www.manning.com/books/generative-ai-made-easy"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>AI Applications Made Easy is written for everyone. Following engaging illustrations and step-by-step guidance, you'll start creating AI applications from the very first chapters. Use prompt engineering to create a healthy recipe generator, use RAG to build automated customer support chatbots, craft marketing assistants that know brand guidelines, and even design a web-enabled financial researcher—all using free low-code tools like Langflow and KNIME.</p>", "user_ratings": {}, "developers": [{"developer-name": "Andrea De Mauro", "developer-url": "https://www.manning.com/books/generative-ai-made-easy"}], "item_content_type": "ebook"}, "nokidhungryconnection": {"human_name": "No Kid Hungry", "machine_name": "nokidhungryconnection", "youtube_link": null, "callout": null, "publishers": [], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "subtitle_html": null, "description_text": "<div><i><i><span><em>Donations to support No Kid Hungry are made to <a href=\"https://support.humblebundle.com/hc/en-us/articles/205183597\" target=\"_blank\" rel=\"noopener\">PayPal Giving Fund</a>, subject to its policies.</em><br><br></span></i></i><strong>About No Kid Hungry<br><br></strong>No child should go hungry in America. But millions of kids in the United States live with hunger. No Kid Hungry is working to end childhood hunger by helping launch and improve programs that give all kids the healthy food they need to thrive. This is a problem we know how to solve. No Kid Hungry is a campaign of Share Our Strength, an organization committed to ending hunger and poverty. Join us at <a href=\"http://nokidhungry.org/\">NoKidHungry.org.</a>&nbsp;</div>", "user_ratings": {}, "developers": [{"developer-name": "No Kid Hungry", "developer-url": "https://www.nokidhungry.org/"}], "item_content_type": null}}, "charity_data": {"charity_items": {"nokidhungryconnection": {"machine_name": "nokidhungryconnection", "youtube_link": null, "item_content_type": null, "subtitle_html": null, "description_text": "<div><i><i><span><em>Donations to support No Kid Hungry are made to <a href=\"https://support.humblebundle.com/hc/en-us/articles/205183597\" target=\"_blank\" rel=\"noopener\">PayPal Giving Fund</a>, subject to its policies.</em><br><br></span></i></i><strong>About No Kid Hungry<br><br></strong>No child should go hungry in America. But millions of kids in the United States live with hunger. No Kid Hungry is working to end childhood hunger by helping launch and improve programs that give all kids the healthy food they need to thrive. This is a problem we know how to solve. No Kid Hungry is a campaign of Share Our Strength, an organization committed to ending hunger and poverty. Join us at <a href=\"http://nokidhungry.org/\">NoKidHungry.org.</a>&nbsp;</div>", "human_name": "No Kid Hungry", "developers": [{"developer-name": "No Kid Hungry", "developer-url": "https://www.nokidhungry.org/"}], "publishers": [], "user_ratings": {}}}}, "from_bundle": {"machine_name": "createfuturenowmeapearlyaccessprogrambooksandliveprojectsmanning_bookbundle", "tile_short_name": "Create the Future Now! MEAP Early Access Program Books and liveProjects by Manning", "short_marketing_blurb": "Create the future now with Python", "marketing_blurb": "Get <em>Modern C, Third Edition</em>, <em>Python Workout, Second Edition</em>, <em>A Damn Fine Stable Diffusion Book</em>, <em>Secrets of the JavaScript Ninja, Third Edition</em>, and more!", "detailed_marketing_blurb": "Learn the skills of the future and beyond with the latest Humble Tech Learning Bundle. This comprehensive library of early access program books and liveProjects courses is designed to help you master Multifunctional Enterprise Application Platforms (MEAP) with lessons like <em>Python Workout, Second Edition</em>, <em>Secrets of the JavaScript Ninja, Third Edition</em>, and more. Start a new career using AI, Python, and more today—plus, a portion of your purchase helps support the charity of your choice.", "author": "Manning Publications", "start_date|datetime": "2025-09-01T18:00:00", "end_date|datetime": "2025-09-22T18:00:00", "type": "bundle", "product_url": "/books/create-future-now-meap-early-access-program-books-and-liveprojects-manning-books"}, "updated_at|datetime": "2025-09-02T03:18:01.681237", "first_seen_at|datetime": "2025-09-02T03:18:01.681237"}
{"machine_name": "azmachinelearningpackt_softwarebundle", "author": "Packt", "basic_data": {"eula": null, "human_name": "Humble Software Bundle: The A-Z of Machine Learning by Packt", "detailed_marketing_blurb": "Curious about Machine Learning, Data Science, or Deep Learning Models? Get familiar with our latest Software Bundle: The A-Z of Machine Learning by Packt. Perfect for beginners—start your journey with expertly crafted courses like <em>PyTorch Ultimate 2024 - From Basics to Cutting-Edge</em>, <em>Machine Learning for Absolute Beginners - Level 1</em>, and more. Get elite resources for both novice coders and seasoned pros to grow your career—and help support Alzheimer's Research UK with your purchase!", "short_marketing_blurb": "The A-Z of Machine Learning ", "media_type": "software", "description": "<p><strong>The A-Z of Machine Learning.</strong> Curious about Machine Learning, Data Science, or Deep Learning Models? Get familiar with our latest Software Bundle: The A-Z of Machine Learning by Packt. Perfect for beginners—start your journey with expertly crafted courses like <em>PyTorch Ultimate 2024 - From Basics to Cutting-Edge</em>, <em>Machine Learning for Absolute Beginners - Level 1</em>, and more. Get elite resources for both novice coders and seasoned pros to grow your career—and help support Alzheimer's Research UK with your purchase!</p>\n<p><strong>Pay $1 or more.</strong> Normally, the total cost for the software in this bundle is as much as $2,003. Here at Humble Bundle, you choose the price and increase your contribution to upgrade your bundle! This bundle has a minimum $1 purchase. Pay $1 or more to access keys.</p>\n<p><strong>Redeem your keys.&nbsp;</strong>All keys should be redeemed on the Packt website.</p>\n<p><strong>Support charity.</strong> Choose where the money goes - between the publisher and to support Alzheimer's Research UK. If you like what we do, you can leave us a Humble Tip too!</p>", "legal_disclaimer": null, "required_account_links": ["steam"], "end_time|datetime": "2025-09-22T18:00:00"}, "tier_item_data": {"algorithmalchemy_unlockingthesecretsofmachinelearning": {"human_name": "Algorithm Alchemy - Unlocking the Secrets of Machine Learning", "machine_name": "algorithmalchemy_unlockingthesecretsofmachinelearning", "youtube_link": "mt-TKwFNHMA", "callout": "<div class=\"accolades\">MSRP: $109.99</div>", "publishers": [{"publisher-name": "Packt", "publisher-url": "https://www.packtpub.com/en-gb/product/algorithm-alchemy-unlocking-the-secrets-of-machine-learning-9781805802730#review-section"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 12.0}, "subtitle_html": null, "description_text": "<p>Machine learning is transforming industries, and mastering its core algorithms is essential for AI-driven innovation. This course provides a structured approach, starting with fundamental concepts and Python implementation. You’ll explore supervised learning models, from linear regression to advanced ensemble techniques like random forests and gradient boosting. Each algorithm is implemented from scratch, reinforcing both theory and hands-on coding skills.</p><p>Beyond supervised learning, you’ll dive into unsupervised techniques such as clustering and dimensionality reduction. Implement K-Means, DBSCAN, autoencoders, and t-SNE to uncover hidden patterns in data. The course also introduces reinforcement learning and deep learning, covering Q-learning, policy gradients, CNNs, RNNs, and transformers—key techniques driving AI advancements.</p><p>By the end, you’ll have a strong grasp of machine learning models and their real-world applications. Whether you're building predictive models, optimizing AI workflows, or advancing in deep learning, this course equips you with practical, job-ready skills.</p>", "user_ratings": {}, "developers": [{"developer-name": "Vivian Aranha", "developer-url": "https://www.packtpub.com/en-gb/product/algorithm-alchemy-unlocking-the-secrets-of-machine-learning-9781805802730#review-section"}], "item_content_type": "game"}, "alzheimersresearchuk": {"human_name": "Alzheimer's Research UK", "machine_name": "alzheimersresearchuk", "youtube_link": "Y41IzjM7dRg", "callout": null, "publishers": [], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "subtitle_html": null, "description_text": "<p>If nothing changes, one in two people will be directly affected by dementia. They will either care for someone with the condition, develop it themselves, or both. Today, there are no dementia survivors but research can change this.</p>\n<p>Alzheimer’s Research UK is the UK's leading dementia research charity, dedicated to causes, diagnosis, prevention, treatment and cure. Backed by our passionate scientists and supporters, we’re challenging the way people think about dementia, uniting the big thinkers in the field and funding the innovative science that will deliver a cure.</p>", "user_ratings": {}, "developers": [], "item_content_type": null}, "real-worldendtoendmachinelearningopsongooglecloud": {"human_name": "Real-world End to End Machine Learning Ops on Google Cloud", "machine_name": "real-worldendtoendmachinelearningopsongooglecloud", "youtube_link": "bCUdjqTKmRg", "callout": "<div class=\"accolades\">MSRP: $18.99</div>", "publishers": [{"publisher-name": "Packt", "publisher-url": "https://www.packtpub.com/en-gb/product/real-world-end-to-end-machine-learning-ops-on-google-cloud-9781806106219"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 1.0}, "subtitle_html": null, "description_text": "<p>This course guides learners through practical ML Ops on Google Cloud, from setup to advanced workflow orchestration. It starts with GCP services and ML Ops fundamentals, then covers building CI/CD pipelines using Cloud Build, Artifact Registry, and Cloud Run. Participants deploy scalable, containerized ML models and perform automated testing.</p><p>Next, learners use Airflow with Cloud Composer for continuous training, keeping models updated and managing failures with alerts. The course dives into Vertex AI for efficient model training, deployment, registry management, and predictions, supported by CI/CD automation. Advanced topics include Kubeflow Pipelines, hyperparameter tuning, explainability, and model versioning, enabling refined, transparent AI solutions.</p><p>The final section covers generative AI and large language models like PaLM 2 on Google Cloud, with hands-on labs and custom deployments. Practical assignments throughout ensure real-world skills to confidently manage end-to-end ML Ops workflows.</p>", "user_ratings": {}, "developers": [{"developer-name": "Siddharth Raghunath", "developer-url": "https://www.packtpub.com/en-gb/product/real-world-end-to-end-machine-learning-ops-on-google-cloud-9781806106219"}], "item_content_type": "game"}, "masteringimagesegmentationwithpytorchusingreal-worldprojects": {"human_name": "Mastering Image Segmentation with PyTorch using Real-World Projects", "machine_name": "masteringimagesegmentationwithpytorchusingreal-worldprojects", "youtube_link": "TfL_w1ALeo0", "callout": "<div class=\"accolades\">MSRP: $76.99</div>", "publishers": [{"publisher-name": "Packt", "publisher-url": "https://www.packtpub.com/product/masteringimagesegmentationwithpytorchusingreal-worldprojects/9781801817356"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 18.0}, "subtitle_html": null, "description_text": "<p>Unlock the potential of image segmentation with this comprehensive course designed to merge theory with practical expertise. Begin with a strong foundation in PyTorch and image segmentation principles, setting up the environment and exploring the fundamental concepts of tensors, datasets, and neural networks. Early modules ensure a seamless transition for learners at all levels, providing clear guidance on data preprocessing and model setup.nProgress into advanced topics where you'll dive deep into semantic segmentation, exploring state-of-the-art architectures such as UNet and Feature Pyramid Network. Learn about essential techniques like upsampling, loss functions, and evaluation metrics, enabling you to fine-tune models for accuracy. Through real-world projects, such as segmenting satellite images, the course emphasizes practical applications, bridging the gap between theory and industry needs.nThe hands-on approach culminates with model training and evaluation, focusing on metrics like pixel accuracy and Intersection over Union. You'll gain experience in setting up training loops, fine-tuning hyperparameters, and saving models for future use. By the end of the course, you will have mastered the tools and techniques necessary to tackle complex segmentation challenges confidently.</p>", "user_ratings": {}, "developers": [{"developer-name": "Mr. Bert Gollnick", "developer-url": "https://www.packtpub.com/product/masteringimagesegmentationwithpytorchusingreal-worldprojects/9781801817356"}], "item_content_type": "game"}, "basicsofchatbotswithmachinelearningandpython": {"human_name": "Basics of Chatbots with Machine Learning & Python", "machine_name": "basicsofchatbotswithmachinelearningandpython", "youtube_link": "hKK5-A9LIy8", "callout": "<div class=\"accolades\">MSRP: $120.99</div>", "publishers": [{"publisher-name": "Packt", "publisher-url": "https://www.packtpub.com/product/basicsofchatbotswithmachinelearning&python/9781837635092"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 12.0}, "subtitle_html": null, "description_text": "<p>Chatbots are software applications used for online chat conversations through text or text-to-speech instead of providing direct contact with a live human agent. Chatbots are used in dialog systems for various purposes, including customer service, request routing, or information gathering.nnThis course begins with a brief overview of chatbots, their need, and the types of chatbots. We will explore rule-based versus self-learning chatbots. We will understand the working mechanism of chatbots. We will explore machine learning-based chatbots and understand the ML-based architecture of chatbots. You will learn about the purpose of ML-based chatbots and their impact. We will get an overview of the Natural Language Toolkit (NLTK). You will learn to install packages and create a corpus with Python. We will delve into text preprocessing and helper function deployment, generate responses, and implement term-frequency times inverse document-frequency. We will train and test rule-based chatbots and finally work on a project developing an artificial intelligence question-answer chatbot using NLTK.nnUpon course completion, you will be able to relate the concepts and theories for chatbots in various domains, understand and implement machine learning models for building real-time chatbots, and evaluate machine learning models in chatbots.nnAll resources are available at: https://github.com/PacktPublishing/Basics-of-Chatbots-with-Machine-Learning-Python</p>", "user_ratings": {}, "developers": [{"developer-name": "AI Sciences", "developer-url": "https://www.packtpub.com/product/basicsofchatbotswithmachinelearning&python/9781837635092"}], "item_content_type": "game"}, "rultimate2024_rfordatascienceandmachinelearning": {"human_name": "R Ultimate 2024 - R for Data Science and Machine Learning", "machine_name": "rultimate2024_rfordatascienceandmachinelearning", "youtube_link": "JeGcmiUQCTE", "callout": "<div class=\"accolades\">MSRP: $87.99</div>", "publishers": [{"publisher-name": "Packt", "publisher-url": "https://www.packtpub.com/product/rultimate2024-rfordatascienceandmachinelearning/9781835082539"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 18.0}, "subtitle_html": null, "description_text": "<p>Step into the world of R and elevate your data science expertise. This course begins with a hands-on introduction to R and RStudio, guiding you through data types, programming essentials, and file management. You'll master data import, manipulation, and visualization, exploring tools like ggplot2 and advanced libraries for dynamic and interactive graphics.nAdvance into machine learning and deep learning concepts with practical applications. Covering regression, classification, clustering, and dimensionality reduction, you'll explore essential techniques for building predictive and analytical models. The course also delves into deep learning, including CNNs, RNNs, and autoencoders, ensuring you grasp modern AI methodologies.nThe journey concludes with applied projects, featuring real-world datasets and challenges in shiny app development, dynamic reporting, and automation. By the end, you'll have the skills to build end-to-end data-driven solutions, positioning yourself as a competitive professional in data science and AI.</p>", "user_ratings": {}, "developers": [{"developer-name": "Mr. Bert Gollnick", "developer-url": "https://www.packtpub.com/product/rultimate2024-rfordatascienceandmachinelearning/9781835082539"}], "item_content_type": "game"}, "masteringmachinelearningalgorithmsusingpython": {"human_name": "Mastering Machine Learning Algorithms using Python", "machine_name": "masteringmachinelearningalgorithmsusingpython", "youtube_link": "8lFR3p3jT0M", "callout": "<div class=\"accolades\">MSRP: $98.99</div>", "publishers": [{"publisher-name": "Packt", "publisher-url": "https://www.packtpub.com/product/masteringmachinelearningalgorithmsusingpython/9781836646716"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 1.0}, "subtitle_html": null, "description_text": "<p>Embark on a comprehensive journey into the world of machine learning with this expertly designed course. Begin with foundational principles, terminology of machine learning. Explore various types of machine learning problems, including regression and classification, and understand the crucial role of data. nnProgressing further, the course covers essential statistical techniques and Python programming. Learn to work with different data types, perform descriptive statistics, and understand probability theory and hypothesis testing. The Python modules span from basic syntax to advanced data manipulation with libraries like NumPy and pandas, providing a solid foundation for data analysis and model building. nnThe course culminates with hands-on projects and case studies, blending theoretical knowledge with practical experience. You'll implement algorithms such as linear and logistic regression, Naive Bayes, decision trees, random forests, and support vector machines. The deep learning section offers a glimpse into neural networks. Through these projects, you’ll gain the skills to optimize and evaluate models, ensuring their effectiveness in real-world scenarios.</p>", "user_ratings": {}, "developers": [{"developer-name": "Manas Dasgupta", "developer-url": "https://www.packtpub.com/product/masteringmachinelearningalgorithmsusingpython/9781836646716"}], "item_content_type": "game"}, "pytorchultimate2024_frombasicstocutting-edge": {"human_name": "PyTorch Ultimate 2024 - From Basics to Cutting-Edge", "machine_name": "pytorchultimate2024_frombasicstocutting-edge", "youtube_link": "RtYmfqxBhNg", "callout": "<div class=\"accolades\">MSRP: $98.99</div>", "publishers": [{"publisher-name": "Packt", "publisher-url": "https://www.packtpub.com/product/pytorchultimate2024-frombasicstocutting-edge/9781801070089"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 18.0}, "subtitle_html": null, "description_text": "<p>Embark on a transformative learning journey with this comprehensive PyTorch course, designed to guide you from foundational principles to advanced AI applications. Starting with the basics, you’ll explore essential machine learning concepts, build neural networks from scratch, and gain proficiency in coding with PyTorch. Step-by-step tutorials and hands-on projects ensure you master key skills like data preparation, model training, and performance evaluation.nAs you progress, dive into cutting-edge topics such as convolutional neural networks for image and audio classification, recurrent neural networks for sequential data, and transformers for next-generation AI solutions. The course also covers advanced techniques like GANs for generative modeling, graph neural networks for structured data, and transfer learning for leveraging pre-trained models.nConcluding with deployment strategies, you’ll learn to implement models on cloud platforms and integrate them into production environments. By the end of the course, you’ll have the skills and confidence to build, optimize, and deploy robust AI systems using PyTorch. Whether you're advancing your career or building expertise, this course equips you for success in the dynamic field of AI.</p>", "user_ratings": {}, "developers": [{"developer-name": "Mr. Bert Gollnick", "developer-url": "https://www.packtpub.com/product/pytorchultimate2024-frombasicstocutting-edge/9781801070089"}], "item_content_type": "game"}, "math0-1_matrixcalculusindatascienceandmachinelearning": {"human_name": "Math 0-1 - Matrix Calculus in Data Science and Machine Learning", "machine_name": "math0-1_matrixcalculusindatascienceandmachinelearning", "youtube_link": "Ky1sFEm4uYM", "callout": "<div class=\"accolades\">MSRP: $120.99</div>", "publishers": [{"publisher-name": "Packt", "publisher-url": "https://www.packtpub.com/product/math0-1-matrixcalculusindatascienceandmachinelearning/9781835886649"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 18.0}, "subtitle_html": null, "description_text": "<p>This course starts with an introduction to the key concepts and outlines the roadmap to success in the field. You'll begin by understanding the foundational elements of matrix and vector derivatives, exploring topics like linear and quadratic forms, chain rules in matrix form, and the derivative of determinants. Each concept is reinforced with exercises, ranging from quadratic challenges to least squares and Gaussian methods.nnThe course progresses into optimization techniques essential in data science and machine learning. Delve into multi-dimensional second derivative tests, gradient descent in one and multiple dimensions, and Newton's method, including practical exercises in Newton's Method for least squares. An additional focus is set on setting up your environment, where you'll learn to establish an Anaconda environment and install crucial tools like Numpy, Scipy, and TensorFlow. The course also addresses effective learning strategies, answering pivotal questions like the suitability of YouTube for learning calculus and the recommended order for taking courses in this field.nnAs you journey through the course, you'll transition from foundational concepts to advanced applications, equipping yourself with the skills needed to excel in data science and machine learning.</p>", "user_ratings": {}, "developers": [{"developer-name": "Lazy Programmer", "developer-url": "https://www.packtpub.com/product/math0-1-matrixcalculusindatascienceandmachinelearning/9781835886649"}], "item_content_type": "game"}, "machinelearningdatascienceandgenerativeaiwithpython": {"human_name": "Machine Learning, Data Science and Generative AI with Python", "machine_name": "machinelearningdatascienceandgenerativeaiwithpython", "youtube_link": "hXAfyLJ6WnU", "callout": "<div class=\"accolades\">MSRP: $109.99</div>", "publishers": [{"publisher-name": "Packt", "publisher-url": "https://www.packtpub.com/product/machinelearning,datascienceandgenerativeaiwithpython/9781787127081"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 18.0}, "subtitle_html": null, "description_text": "<p>This course begins with a Python crash course and then guides you on setting up Microsoft Windows-based PCs, Linux desktops, and Macs. After the setup, we delve into machine learning, AI, and data mining techniques, which include deep learning and neural networks with TensorFlow and Keras; generative models with variational autoencoders and generative adversarial networks; data visualization in Python with Matplotlib and Seaborn; transfer learning, sentiment analysis, image recognition, and classification; regression analysis, K-Means Clustering, Principal Component Analysis, training/testing and cross-validation, Bayesian methods, decision trees, and random forests.nnAdditionally, we will cover multiple regression, multilevel models, support vector machines, reinforcement learning, collaborative filtering, K-Nearest Neighbors, the bias/variance tradeoff, ensemble learning, term frequency/inverse document frequency, experimental design, and A/B testing, feature engineering, hyperparameter tuning, and much more! There's a dedicated section on machine learning with Apache Spark to scale up these techniques to \"big data\" analyzed on a computing cluster.nnThe course will cover the Transformer architecture, delve into the role of self-attention in AI, explore GPT applications, and practice fine-tuning Transformers for tasks such as movie review analysis. Furthermore, we will look at integrating the OpenAI API for ChatGPT, creating with DALL-E, understanding embeddings, and leveraging audio-to-text to enhance AI with real-world data and moderation.</p>", "user_ratings": {}, "developers": [{"developer-name": "Frank Kane", "developer-url": "https://www.packtpub.com/product/machinelearning,datascienceandgenerativeaiwithpython/9781787127081"}], "item_content_type": "game"}, "clusteranalysisandunsupervisedmachinelearninginpython": {"human_name": "Cluster Analysis and Unsupervised Machine Learning in Python", "machine_name": "clusteranalysisandunsupervisedmachinelearninginpython", "youtube_link": "1IRFgaza604", "callout": "<div class=\"accolades\">MSRP: $115.99</div>", "publishers": [{"publisher-name": "Packt", "publisher-url": "https://www.packtpub.com/product/clusteranalysisandunsupervisedmachinelearninginpython/9781836649373"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 18.0}, "subtitle_html": null, "description_text": "<p>Unlock the power of unsupervised machine learning with this comprehensive course on cluster analysis using Python. Begin your journey with a solid introduction to unsupervised learning, understanding its significance and practical applications. You'll start with the basics of K-Means clustering, progressing through detailed theoretical explanations and hands-on coding exercises designed to deepen your understanding.nAs you advance, the course delves into hierarchical clustering, providing a thorough walkthrough of agglomerative clustering techniques. You'll learn to interpret dendrograms and apply these methods to intriguing case studies like evolutionary analysis and political tweet analysis. This section ensures you gain practical skills in applying hierarchical clustering to diverse datasets.nThe course culminates with an exploration of Gaussian Mixture Models (GMMs), where you'll compare GMM with K-Means and understand the advantages of each. You'll also learn about the Expectation-Maximization algorithm and practical issues related to GMMs, enhancing your ability to handle complex clustering tasks. With additional modules on setting up your Python environment and effective learning strategies, this course equips you with the tools and knowledge to excel in unsupervised machine learning.</p>", "user_ratings": {}, "developers": [{"developer-name": "Lazy Programmer", "developer-url": "https://www.packtpub.com/product/clusteranalysisandunsupervisedmachinelearninginpython/9781836649373"}], "item_content_type": "game"}, "machinelearningforabsolutebeginners_level1": {"human_name": "Machine Learning for Absolute Beginners - Level 1", "machine_name": "machinelearningforabsolutebeginners_level1", "youtube_link": "bR7KNV_ZkYU", "callout": "<div class=\"accolades\">MSRP: $197.99</div>", "publishers": [{"publisher-name": "Packt", "publisher-url": "https://www.packtpub.com/product/machinelearningforabsolutebeginners-level1/9781801074780"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 18.0}, "subtitle_html": null, "description_text": "<p>Embark on a journey into Machine Learning designed for absolute beginners. Start with the rise of Artificial Intelligence, exploring its evolution and key concepts like classical programming versus ML, deep learning, and applied versus generalized AI. Gain insight into why AI has become so impactful in today’s world.nnNext, dive into the classifications of Machine Learning systems, including supervised, unsupervised, and reinforcement learning. Concepts like regression, clustering, and dimensionality reduction are explained simply, with practical examples to make them accessible. You’ll also learn how ML models are trained, aiming for generalization and real-world applications.nnFinally, discover the power of generative AI and its transformative potential. From neural networks and large language models to common challenges like bias and security, you’ll explore both its opportunities and limitations. By the end, you’ll have a solid understanding of Machine Learning and how it applies to the evolving AI landscape.</p>", "user_ratings": {}, "developers": [{"developer-name": "Idan Gabrieli", "developer-url": "https://www.packtpub.com/product/machinelearningforabsolutebeginners-level1/9781801074780"}], "item_content_type": "game"}, "naturallanguageprocessing_deeplearningmodelsinpython": {"human_name": "Natural Language Processing - Deep Learning Models in Python", "machine_name": "naturallanguageprocessing_deeplearningmodelsinpython", "youtube_link": "mPA-YNeFD44", "callout": "<div class=\"accolades\">MSRP: $120.99</div>", "publishers": [{"publisher-name": "Packt", "publisher-url": "https://www.packtpub.com/product/naturallanguageprocessing-deeplearningmodelsinpython/9781836208013"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 18.0}, "subtitle_html": null, "description_text": "<p>Embark on a journey into Natural Language Processing (NLP) with a focus on deep learning models using Python. The course starts with an introduction to neurons, explaining how they form the basic building blocks of neural networks. You will learn to fit lines and prepare classification codes, culminating in practical text classification tasks using TensorFlow.nProgressing to Feedforward Artificial Neural Networks (ANNs), you will delve into forward propagation, activation functions, and multiclass classification. The course includes extensive code preparation for text classification in TensorFlow, covering text preprocessing, embeddings, and advanced techniques like Continuous Bag of Words (CBOW). This section ensures you understand the geometrical aspects and hyperparameter tuning.nThe course then explores Convolutional Neural Networks (CNNs) and Recurrent Neural Networks (RNNs), crucial for advanced NLP tasks. You will learn the intricacies of convolutions, CNN architecture, and their application to text. The RNN section covers simple RNNs, GRUs, and LSTMs, with hands-on exercises in text classification, parts-of-speech tagging, and named entity recognition in TensorFlow. Each section is designed to build your skills progressively, ensuring a deep understanding of both theoretical concepts and practical applications.</p>", "user_ratings": {}, "developers": [{"developer-name": "Lazy Programmer", "developer-url": "https://www.packtpub.com/product/naturallanguageprocessing-deeplearningmodelsinpython/9781836208013"}], "item_content_type": "game"}, "naturallanguageprocessing_machinelearningmodelsinpython": {"human_name": "Natural Language Processing - Machine Learning Models in Python", "machine_name": "naturallanguageprocessing_machinelearningmodelsinpython", "youtube_link": "m787ZBrnR6w", "callout": "<div class=\"accolades\">MSRP: $120.99</div>", "publishers": [{"publisher-name": "Packt", "publisher-url": "https://www.packtpub.com/product/naturallanguageprocessing-machinelearningmodelsinpython/9781836205579"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 18.0}, "subtitle_html": null, "description_text": "<p>Embark on a journey through the world of text analytics with our expertly crafted course. Starting with an introduction and outline, you'll discover the foundational concepts and receive a special offer to get you started. The initial sections guide you through the setup process, ensuring you have all the resources and tips needed for success.nnDelve into the core of text analytics with dedicated sections on spam detection, sentiment analysis, text summarization, topic modeling, and latent semantic analysis. Each section begins with a problem description, followed by intuitive explanations of algorithms like Naive Bayes, logistic regression, and Latent Dirichlet Allocation. You'll engage with practical exercises designed to reinforce your understanding, and apply these techniques using Python in a hands-on manner.nnThe course culminates with advanced topics and comprehensive summaries, ensuring you grasp both the theoretical and practical aspects of text analytics. By the end, you'll have a robust understanding of various NLP techniques and the confidence to apply them in real-world scenarios. This course is an essential resource for technical professionals looking to excel in the rapidly evolving field of natural language processing.</p>", "user_ratings": {}, "developers": [{"developer-name": "Lazy Programmer", "developer-url": "https://www.packtpub.com/product/naturallanguageprocessing-machinelearningmodelsinpython/9781836205579"}], "item_content_type": "game"}, "python_completepythondjangodatascienceandmlguide": {"human_name": "Python - Complete Python, Django, Data Science and ML Guide", "machine_name": "python_completepythondjangodatascienceandmlguide", "youtube_link": "31HThWsi1U8", "callout": "<div class=\"accolades\">MSRP: $142.99</div>", "publishers": [{"publisher-name": "Packt", "publisher-url": "https://www.packtpub.com/en-us/product/python-complete-python-django-data-science-and-ml-guide-9781835465141"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 18.0}, "subtitle_html": null, "description_text": "<p>Join us on an immersive Python programming journey, spanning over 50 hours of learning. Whether you're a novice or experienced, this course equips you with vital Python skills for careers and projects.nnStarting from the basics, grasp Python's core principles and proficiency in real-world functions. As Python's popularity grows, this course readies you for the rising demand for Python developers. You'll practice hand-on examples using Python's interpreter and Visual Studio Code with Code Runner to solidify your skills.nnWith a focus on Data Science and Machine Learning, you'll master essential packages such as NumPy, Pandas, Matplotlib, and Scikit-learn, using the versatile Jupyter Notebook. The course extensively covers Python's fundamental aspects, spanning variables, lists, dictionaries, and venturing into advanced topics like classes, loops, modules, and creating virtual environments. The goal is to provide you with a solid Python foundation. You'll also gain insight into functional and object-oriented Python programming, making you a versatile coder.nnThe course is thoughtfully structured, explaining not just \"how\" but also \"why\" we use specific methods and best practices. By course end, you'll harness Python's full potential for web and mobile app development, data science, machine learning, and game creation.</p>", "user_ratings": {}, "developers": [{"developer-name": "Bogdan Stashchuk", "developer-url": "https://www.packtpub.com/en-us/product/python-complete-python-django-data-science-and-ml-guide-9781835465141"}], "item_content_type": "game"}, "completeguidetoazuremachinelearning_2025edition": {"human_name": "The Complete Guide to Azure Machine Learning - 2025 Edition", "machine_name": "completeguidetoazuremachinelearning_2025edition", "youtube_link": "ZYxBs8iMzyQ", "callout": "<div class=\"accolades\">MSRP: $82.99</div>", "publishers": [{"publisher-name": "Packt", "publisher-url": "https://www.packtpub.com/en-gb/product/the-complete-guide-to-azure-machine-learning-2025-edition-9781806108619"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 12.0}, "subtitle_html": null, "description_text": "<p>This course empowers professionals to master Azure Machine Learning, a leading tool for developing and deploying ML models. Starting with key machine learning concepts, you’ll dive into supervised, unsupervised, and reinforcement learning, applying them through Azure ML Studio. Hands-on labs will guide you through setting up experiments, preprocessing data, and selecting the best models for your tasks.</p><p>You’ll also explore advanced topics like model evaluation, optimization, and deployment using Azure’s cloud resources, ensuring efficient and scalable workflows. With Azure’s flexible ecosystem, you’ll manage data, automate tasks with AutoML, and address challenges like overfitting and model drift.</p><p>The course covers real-world applications in industries like healthcare and finance, while also introducing Generative AI tools like GPT and DALL·E. Ethical AI practices are emphasized, preparing you to build responsible, scalable AI systems. This course equips you with the skills to deploy, monitor, and improve ML models in any industry.</p>", "user_ratings": {}, "developers": [{"developer-name": "Anand Rao Nednur", "developer-url": "https://www.packtpub.com/en-gb/product/the-complete-guide-to-azure-machine-learning-2025-edition-9781806108619"}], "item_content_type": "game"}, "recommendersystemswithmachinelearning": {"human_name": "Recommender Systems with Machine Learning", "machine_name": "recommendersystemswithmachinelearning", "youtube_link": "Uxnhz8dvXQ0", "callout": "<div class=\"accolades\">MSRP: $120.99</div>", "publishers": [{"publisher-name": "Packt", "publisher-url": "https://www.packtpub.com/product/recommendersystemswithmachinelearning/9781837631667"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 12.0}, "subtitle_html": null, "description_text": "<p>Have you ever thought how YouTube adjusts your feed as per your favorite content? nnEver wondered! Why is your Netflix recommending your favorite TV shows?nnHave you ever wanted to build a customized recommender system for yourself?nnThen this is the course you are looking for.nnWe will begin with the theoretical concepts and fundamental knowledge of recommender systems. You will gain an understanding of the essential taxonomies that form the foundation of these systems. You will be learning how to use the power of Python to evaluate your recommender systems datasets based on user ratings, user choices, music genres, categories of movies, and their year of release. A practical approach will be adopted to build content-based filtering and collaborative filtering techniques for recommender systems.nnMoving ahead, you will learn all the basic and necessary concepts for the applied recommender systems models along with the machine learning models. Moreover, various projects have been included in this course to develop a very useful experience for you.nnBy the end of this course, you will be able to relate the concepts and theories for recommender systems in various domains, implement machine learning models for building real-world recommendation systems, and evaluate the machine learning models.nnAll the resource files are added to the GitHub repository at: https://github.com/PacktPublishing/Recommender-Systems-with-Machine-Learning</p>", "user_ratings": {}, "developers": [{"developer-name": "AI Sciences", "developer-url": "https://www.packtpub.com/product/recommendersystemswithmachinelearning/9781837631667"}], "item_content_type": "game"}, "fundamentalsofmachinelearning": {"human_name": "Fundamentals of Machine Learning", "machine_name": "fundamentalsofmachinelearning", "youtube_link": "C7KDM3wTEyA", "callout": "<div class=\"accolades\">MSRP: $60.99</div>", "publishers": [{"publisher-name": "Packt", "publisher-url": "https://www.packtpub.com/product/fundamentalsofmachinelearning/9781837635719"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 1.0}, "subtitle_html": null, "description_text": "<p>Embark on an in-depth learning journey in machine learning, starting with fundamental concepts like linear regression and logistic regression. You will explore basic supervised learning techniques and the foundations of classification, while also diving into statistical learning. The course structure builds on these foundations, gradually guiding you through cross-validation, bootstrap methods, and model regularization.nThe second section of the course provides a hands-on approach, with practical labs that cover key algorithms like decision trees, random forests, and support vector machines (SVM). You will also explore deep learning models through neural networks, convolutional neural networks (CNN), and learn about dimensionality reduction techniques such as PCA. Each lab reinforces the theoretical knowledge, helping you develop a clear understanding of each algorithm and its real-world applications.nIn the final section, the focus shifts to deep learning, with sessions on large language models (LLMs), OpenAI SDK, and LangChain SDK. By the end of the course, you will have acquired the knowledge and skills to implement machine learning models using both traditional algorithms and modern AI technologies. You'll leave with the expertise to apply machine learning concepts to solve complex problems and build powerful models.</p>", "user_ratings": {}, "developers": [{"developer-name": "Yiqiao Yin", "developer-url": "https://www.packtpub.com/product/fundamentalsofmachinelearning/9781837635719"}], "item_content_type": "game"}, "machinelearning_moderncomputervisionandgenerativeai": {"human_name": "Machine Learning - Modern Computer Vision & Generative AI", "machine_name": "machinelearning_moderncomputervisionandgenerativeai", "youtube_link": "4v_Dw9vEblw", "callout": "<div class=\"accolades\">MSRP: $120.99</div>", "publishers": [{"publisher-name": "Packt", "publisher-url": "https://www.packtpub.com/en-us/product/machine-learning-modern-computer-vision-generative-ai-9781835883907"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 18.0}, "subtitle_html": null, "description_text": "<p>This is an innovative course tailored for those who aspire to master the dynamic fields of computer vision and generative artificial intelligence. This course offers a deep dive into the world of image recognition, object detection, and the magic of generative AI using tools like KerasCV, Python, TensorFlow, PyTorch, and JAX.nnThis course guides you from the fundamentals of image classification to the intricacies of object detection, starting with the KerasCV library for deep learning. You'll learn to effectively use and fine-tune pre-trained models, create custom datasets for object detection, using tools like the LabelImg GUI program, and apply these skills to tackle real-world challenges. A key focus is the generative AI segment, particularly on Stable Diffusion, where you'll learn to generate detailed images from text, unlocking your creative potential in this advanced AI domain. nnThis course offers a progressive learning path from basic concepts to advanced techniques, catering to both professional development and creative pursuits in AI. By the end, you'll have the confidence and tools needed for a variety of applications in the ever-evolving field of generative artificial intelligence.</p>", "user_ratings": {}, "developers": [{"developer-name": "Lazy Programmer", "developer-url": "https://www.packtpub.com/en-us/product/machine-learning-modern-computer-vision-generative-ai-9781835883907"}], "item_content_type": "game"}, "devopstomlopsbootcamp_buildanddeploymlsystemsend-to-end": {"human_name": "DevOps to MLOps Bootcamp: Build & Deploy ML Systems End-to-End", "machine_name": "devopstomlopsbootcamp_buildanddeploymlsystemsend-to-end", "youtube_link": "Cv0lAIztCnk", "callout": "<div class=\"accolades\">MSRP: $74.99</div>", "publishers": [{"publisher-name": "Packt", "publisher-url": "https://www.packtpub.com/en-gb/product/devops-to-mlops-bootcamp-build-deploy-ml-systems-end-to-end-9781806118694"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 12.0}, "subtitle_html": null, "description_text": "<p>This in-depth course is tailored for DevOps professionals looking to break into MLOps and AI infrastructure. It begins with an exploration of MLOps fundamentals, highlighting its rise from traditional DevOps, comparing emerging AI operations approaches, and showcasing real case studies that underscore the growing demand for scalable ML systems.</p><p>From there, learners dive into a real-world regression use case focused on predicting house prices. The journey covers the complete ML lifecycle — starting with data engineering, exploratory analysis, and feature building, followed by model experimentation and selection using Jupyter, MLFlow, and Python-based tools. Students then package the final model using FastAPI, wrap it with a Streamlit frontend, and containerize everything with Docker for seamless handoff.</p><p>The final modules focus on automating and scaling the system. Learners build GitHub Actions workflows to manage CI processes, push containers to DockerHub, and deploy models using Kubernetes. They explore production-ready infrastructure with service discovery, monitoring via Prometheus and Grafana, and implement GitOps for continuous delivery using ArgoCD. By the end, learners are ready to drive MLOps workflows from code to cluster.</p>", "user_ratings": {}, "developers": [{"developer-name": "Gourav Shah", "developer-url": "https://www.packtpub.com/en-gb/product/devops-to-mlops-bootcamp-build-deploy-ml-systems-end-to-end-9781806118694"}], "item_content_type": "game"}}, "charity_data": {"charity_items": {"alzheimersresearchuk": {"machine_name": "alzheimersresearchuk", "youtube_link": "Y41IzjM7dRg", "item_content_type": null, "subtitle_html": null, "description_text": "<p>If nothing changes, one in two people will be directly affected by dementia. They will either care for someone with the condition, develop it themselves, or both. Today, there are no dementia survivors but research can change this.</p>\n<p>Alzheimer’s Research UK is the UK's leading dementia research charity, dedicated to causes, diagnosis, prevention, treatment and cure. Backed by our passionate scientists and supporters, we’re challenging the way people think about dementia, uniting the big thinkers in the field and funding the innovative science that will deliver a cure.</p>", "human_name": "Alzheimer's Research UK", "developers": [], "publishers": [], "user_ratings": {}}}}, "from_bundle": {"machine_name": "azmachinelearningpackt_softwarebundle", "tile_short_name": "The A-Z of Machine Learning by Packt", "short_marketing_blurb": "The A-Z of Machine Learning ", "marketing_blurb": "Get Fundamentals of Machine Learning, Machine Learning for Absolute Beginners - Level 1, PyTorch Ultimate 2024 - From Basics to Cutting-Edge, Python - Complete Python, Django, Data Science and ML Guide, and more!", "detailed_marketing_blurb": "Curious about Machine Learning, Data Science, or Deep Learning Models? Get familiar with our latest Software Bundle: The A-Z of Machine Learning by Packt. Perfect for beginners—start your journey with expertly crafted courses like <em>PyTorch Ultimate 2024 - From Basics to Cutting-Edge</em>, <em>Machine Learning for Absolute Beginners - Level 1</em>, and more. Get elite resources for both novice coders and seasoned pros to grow your career—and help support Alzheimer's Research UK with your purchase!", "author": "Packt", "start_date|datetime": "2025-09-01T18:00:00", "end_date|datetime": "2025-09-22T18:00:00", "type": "bundle", "product_url": "/software/az-machine-learning-packt-software"}, "updated_at|datetime": "2025-09-02T03:18:01.681237", "first_seen_at|datetime": "2025-09-02T03:18:01.681237"}
