{"machine_name": "pathfinderinfinitecelebrationkingmakerroll20_bookbundle", "author": "Roll20", "basic_data": {"eula": null, "human_name": "Humble RPG Bundle: Pathfinder Infinite - Celebration of Kingmaker by Roll20", "detailed_marketing_blurb": "The Stolen Lands are yours for the claiming, and all you need is our new bundle offering everything you need to launch your own Pathfinder Infinite Kingmaker Adventure Path campaign! This comprehensive kit includes the full Kingmaker Player’s Guide to get things, ahem, rolling; all the occult knowledge contained within the pages of Frontiers of Magic; the Boosted Bestiary to update your favorite Pathfinder creatures across multiple levels; the expanded Player Core 2, and much more! Gather your comrades and prepare to embark on the adventure of a lifetime, and help support Extra Life charity with your purchase! ", "short_marketing_blurb": "Create your kingdom", "media_type": "ebook", "description": "<p><strong>Create your kingdom.</strong> WThe Stolen Lands are yours for the claiming, and all you need is our new bundle offering everything you need to launch your own Pathfinder Infinite Kingmaker Adventure Path campaign! This comprehensive kit includes the full Kingmaker Player’s Guide to get things, ahem, rolling; all the occult knowledge contained within the pages of Frontiers of Magic; the Boosted Bestiary to update your favorite Pathfinder creatures across multiple levels; the expanded Player Core 2, and much more! Gather your comrades and prepare to embark on the adventure of a lifetime, and help support Extra Life charity with your purchase!</p>\n<p><strong>Pay $5 or more.</strong> Normally, the total cost for the ebooks in this bundle is as much as $312. Here at Humble Bundle, you choose the price and increase your contribution to upgrade your bundle! This bundle has a minimum $5 purchase. Pay $5 or more to access keys.</p>\n<p><strong>Read them anywhere.</strong> The ebooks in this bundle are available in pdf format, so they work on your computer, e-readers, iPads, cell phones, and a wide array of mobile devices! Instructions and a list of recommended reading programs can be found <a href=\"https://support.humblebundle.com/hc/articles/202712300\" rel=\"noopener\" target=\"_blank\">here</a>.</p>\n<p><strong>Support charity.</strong> Choose where the money goes - between the publisher and to support Extra Life. If you like what we do, you can leave us a Humble Tip too!</p>", "legal_disclaimer": null, "required_account_links": ["steam"], "end_time|datetime": "2025-11-22T19:00:00"}, "tier_item_data": {"boostedbestiary": {"human_name": "Boosted Bestiary", "machine_name": "boostedbestiary", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Roll20", "publisher-url": "https://www.pathfinderinfinite.com/en/product/396687/boosted-bestiary"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 15.0}, "subtitle_html": null, "description_text": "<p>Expand the Bestiary! The Boosted Bestiary takes more than 60 creatures from the Pathfinder Second Edition Bestiary and updates them across multiple levels, giving you more than 200 new monsters. Menace your players with chimeras from level 2 to 20, drakes from level 0 to 14, shoggoths from level 6 to 21, and many more creatures at many more levels! Every creature has a description of its new role and gets level-appropriate powers. From the lowly skumling to the mighty balor lord, the Boosted Bestiary presents all-new creatures at every level you need!</p>", "user_ratings": {}, "developers": [{"developer-name": "Ron Lundeen"}], "item_content_type": "game"}, "inkfinder": {"human_name": "Inkfinder", "machine_name": "inkfinder", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Roll20", "publisher-url": "https://www.pathfinderinfinite.com/en/product/393078/inkfinder"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 15.0}, "subtitle_html": null, "description_text": "<p>Player Options for Tattoo Artists and Their Canvases! Secrets of Magic gives the ground rules for tattooing Player Characters, and Lost Omens: Grand Bazaar extends those options with new tattoo formulas, but players may find themselves wanting additional options. That’s where Inkfinder comes in! This supplement provides over 100 tattoos of all levels and rarities. Players wanting to specialize their heroes in the crafting of tattoos might enjoy the tattoo artisan archetype, the tattooed warrior archetype, and a new alchemist research field.</p>", "user_ratings": {}, "developers": [{"developer-name": "W. Brian Lane"}], "item_content_type": "game"}, "everythingshields": {"human_name": "Everything Shields", "machine_name": "everythingshields", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Roll20", "publisher-url": "https://www.pathfinderinfinite.com/en/product/400727/everything-shields"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Take your shields to the next level! With the Everything Shields Pathfinder Second Edition supplement, you can create hundreds of customized shields and shield-focused characters. Do you want to play a swashbuckling, targe-wielding duelist whose shield can exude darkness on command when you get in a pinch? Or a mobile warrior who throws a mithral hoplon that returns after each attack? How about a witch who has etched a hex onto the face of their shield to make enemies falter when they attack? All these things and many more are possible with the additional shield content brought to you by Everything Shields.</p>", "user_ratings": {}, "developers": [{"developer-name": "Everything4Everybody, Tevis Woods"}], "item_content_type": "game"}, "kingmakeradventurepathroll20vtt": {"human_name": "Kingmaker Adventure Path | Roll20 VTT", "machine_name": "kingmakeradventurepathroll20vtt", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Roll20", "publisher-url": "https://www.pathfinderinfinite.com/en/product/443398/kingmaker-adventure-path-roll20-vtt"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>The Stolen Lands have long been the domain of bandits and monsters, but no longer! Your party has been granted a charter to explore these wilds, defeat its dangers, and build a brand new nation. Yet not everyone will welcome you as new neighbors, and powerful supernatural forces have their own plans for the region. Can you defeat your kingdom’s enemies and become one of the greatest new nations in the world? This product contains all six chapters of the original Kingmaker Adventure Path, expanded and updated for use with Pathfinder Second Edition; plus hundreds of pages of new content that expands the campaign to cover the full range of levels from 1 to 20; AND extensive rules for building and running kingdoms, settlements, and armies, along with narrative-based rules for quickly resolving mass combat!</p>", "user_ratings": {}, "developers": [{"developer-name": "Paizo"}], "item_content_type": "game"}, "playercore2expanded": {"human_name": "Player Core 2 Expanded", "machine_name": "playercore2expanded", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Roll20", "publisher-url": "https://www.pathfinderinfinite.com/en/product/513679/player-core-2-expanded"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Enjoying the remastered classes in Player Core 2 but wished there was more? How about a Swashbuckler that made explosive use out of Crafting, or an Investigator that carries with it just a hint of magical power to solve even crazier mysteries? Brought to you by 6 Infinite authors and specially tuned for the PF2e Remaster! This expansion includes 2 Alchemist Research Fields; 3 Barbarian Instincts; 2 Champion Causes plus a new Blessing; 2 Investigator Methodologies; 6 Monk feats, as well as 6 new Qi spells; 2 new Oracle Mysteries; 3 Sorcerer Bloodlines; and 5 Swashbuckler Styles, including 11 new Swashbuckler feats!</p>", "user_ratings": {}, "developers": [{"developer-name": "Conner Berkheiser, Joshua White, Sasha Laranoa Harving, Derry Luttrell, Raul \"Valor\" Padilla, Ruben \"Lyon\" Salazar"}], "item_content_type": "game"}, "smokeandsail_apathfinder2enavalwarfaresourcebook": {"human_name": "Smoke and Sail: a Pathfinder 2e Naval Warfare Sourcebook", "machine_name": "smokeandsail_apathfinder2enavalwarfaresourcebook", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Roll20", "publisher-url": "https://www.pathfinderinfinite.com/en/product/396152/smoke-and-sail-a-pathfinder-2e-naval-warfare-sourcebook"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Few environments conjure feelings of excitement and trepidation more acutely than the ocean, with its endless rhythm of churning waves and possibility for adventure. Tenacious crews sailing ships of all sizes make perilous journeys across the majestic vastness that stretches from horizon to horizon, certain that their vessel will carry them to shore under any sky and on any sea. This sourcebook provides a comprehensive ruleset for running such a vessel and engaging in thrilling, ship-based combat encounters.</p>", "user_ratings": {}, "developers": [{"developer-name": "Jamie Trollope, Paul Steen"}], "item_content_type": "game"}, "frontiersofmagic": {"human_name": "Frontiers of Magic", "machine_name": "frontiersofmagic", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Roll20", "publisher-url": "https://www.pathfinderinfinite.com/en/product/406118/frontiers-of-magic"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Magic is an ever-expanding field of study. Wizards construct new spells, druids befriend newly observed species, occultists uncover secrets thought lost, and clerics receive novel blessings. Magical theories might be developed and expanded for centuries before being taught in primary academies, and long-held indigenous magical practices might enter the magical zeitgeist elsewhere. Still other practices, like mesmerism and shapeshifting, are often closely guarded secrets. Regardless of how you get there, learning something new is exciting! This 141-page supplement of player options includes 2 new classes (Mesmerist and Shifter), 35 archetypes, new class options and feats for most spellcasting classes, spell skill actions, and over 60 new spells (including consolation cantrips).</p>", "user_ratings": {}, "developers": [{"developer-name": "W. Brian Lane"}], "item_content_type": "game"}, "cookingunleashed": {"human_name": "Cooking Unleashed", "machine_name": "cookingunleashed", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Roll20", "publisher-url": "https://www.pathfinderinfinite.com/en/product/425794/cooking-unleashed"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>All across Golarion, various delicious cuisines and meals are made everyday by chefs from various different cultures and backgrounds. Some alchemists in particular, dedicate themselves to mixing the art of alchemy with the culinary arts to create delicious and potent treats! While halflings may have been some of the earliest trailblazers of this blend of alchemy and cooking, many others have adopted these techniques throughout the inner sea!  If you wish to play a cook who can make use of potent alchemical foodstuffs or simply gain access to new options for alchemical food through feats and items, Cooking Unleashed is for you!</p>", "user_ratings": {}, "developers": [{"developer-name": "Conner Berkheiser"}], "item_content_type": "game"}, "impossibleexperimentstheguardianofgitnaroll20": {"human_name": "Impossible Experiments The Guardian of Gitna | Roll20", "machine_name": "impossibleexperimentstheguardianofgitnaroll20", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Roll20", "publisher-url": "https://www.pathfinderinfinite.com/en/product/437862/impossible-experiments-the-guardian-of-gitna-roll20"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 15.0}, "subtitle_html": null, "description_text": "<p>Impossible Experiments is a series of adventures, each spanning 1-2 levels. Each volume can be run individually or combined into an ongoing series. When the wizard-king Nex retreated into his Refuge over 4,000 years ago, speculation ran rampant as to what he would do in this space. At first, many assumed that he was restrategizing for the war with Geb, but as the decades and centuries ground on, wilder hypotheses were offered. One explanation claimed that Nex was experimenting to develop a new generation of magical warriors, spies, and minions whose presence would overwhelmingly tip the scales of war against Geb, and likely other nations to follow.</p>", "user_ratings": {}, "developers": [{"developer-name": "W. Brian Lane"}], "item_content_type": "game"}, "boostedbestiaryroll20": {"human_name": "Boosted Bestiary | Roll20", "machine_name": "boostedbestiaryroll20", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Roll20", "publisher-url": "https://www.pathfinderinfinite.com/en/product/437865/boosted-bestiary-roll20"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Fully converted for immediate use in the Roll210 VTT! The Boosted Bestiary takes more than 60 creatures from the Pathfinder Second Edition Bestiary and updates them across multiple levels, giving you more than 200 new monsters. Menace your players with chimeras from level 2 to 20, drakes from level 0 to 14, shoggoths from level 6 to 21, and many more creatures at many more levels! Every creature has a description of its new role and gets level-appropriate powers. From the lowly skumling to the mighty balor lord, the Boosted Bestiary presents all-new creatures at every level you need!</p>", "user_ratings": {}, "developers": [{"developer-name": "Ron Lundeen"}], "item_content_type": "game"}, "abominationvaultsgmsguide": {"human_name": "Abomination Vaults GMs Guide", "machine_name": "abominationvaultsgmsguide", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Roll20", "publisher-url": "https://www.pathfinderinfinite.com/en/product/373876/abomination-vaults-gms-guide"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 15.0}, "subtitle_html": null, "description_text": "<p>The Abomination Vaults Adventure Path is an extensive campaign in a sprawling megadungeon. Your players need the right tools to navigate its dangers, and you need the tools in this GM’s Guide to keep the action moving! Inside, you'll find new mini-adventures that connect to the dungeon, new wandering factions, a checklist of all the side quest the campaign offers, and full stat blocks for every single monster on every single level!</p>", "user_ratings": {}, "developers": [{"developer-name": "Ron Lundeen"}], "item_content_type": "game"}, "kitsuneofgolarion": {"human_name": "Kitsune of Golarion", "machine_name": "kitsuneofgolarion", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Roll20", "publisher-url": "https://www.pathfinderinfinite.com/en/product/381454/kitsune-of-golarion"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 15.0}, "subtitle_html": null, "description_text": "<p>Living clandestinely among Golarion's ancestries, kitsune make formidable foes and canny heroes. Kitsune of Golarion unlocks the full potential of this ancestry, detailing kitsune from every corner of the globe. An expansion on Lost Omens Ancestry Guide penned by the same authors who pen the Pathfinder Roleplaying Game.</p>", "user_ratings": {}, "developers": [{"developer-name": "Alexander Augunas, Aly Chen, Joan Hong, Dustin Knight, Ruvaid Virk, Sky Mahpiya Wall"}], "item_content_type": "game"}, "clericsplus": {"human_name": "Clerics+", "machine_name": "clericsplus", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Roll20", "publisher-url": "https://www.pathfinderinfinite.com/en/product/415864/clerics"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Guided by the holiest of powers and the most infernal of curses, Clerics+ is an expansion to the Cleric class to add new ways to play a scholar of the divine in Pathfinder 2nd Edition! However you praise the gods, whether it be through steel, service or secrets, Clerics+ is your ticket to playing the priests of Golarion in new, unbelievable ways! Pick up this balanced, vanilla+ expansion to Pathfinder 2e today, and PRAISE BE TO THE GODS!</p>", "user_ratings": {}, "developers": [{"developer-name": "Derry Luttrell, Tony Saunders, Team+"}], "item_content_type": "game"}, "extralife": {"human_name": "Extra Life / Children's Miracle Network Hospitals", "machine_name": "extralife", "youtube_link": "ZS7WRl7N1Ig", "callout": null, "publishers": [], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "subtitle_html": null, "description_text": "<p><em>Donations to support Extra Life / Children's Miracle Network Hospitals&nbsp;are made to the&nbsp;<a rel=\"nofollow noopener\" target=\"_blank\" href=\"https://support.humblebundle.com/hc/en-us/articles/205183597\" title=\"Link: https://support.humblebundle.com/hc/en-us/articles/205183597\">PayPal Giving Fund</a>, subject to its policies.</em></p>\n<p>Extra Life is a Children’s Miracle Network Hospitals fundraising program that empowers the gaming community to make a difference in the lives of local sick and injured kids. Participants fundraise year-round and during a 24-hour gaming marathon each fall.<br><br>Getting involved is as easy as signing up online at extra-life.org, asking your friends and family to donate, and pledging to play games in support of the Children’s Miracle Network Hospital of your choice. You can play from the comfort of your own home, playing any game you want.<br><br>Since 2008, Extra Life has raised more than $75 million for member hospitals. Play games, heal kids and join the community today at <a href=\"http://www.extra-life.org\" target=\"_blank\" rel=\"noopener\">www.extra-life.org</a>.</p>\n<p><strong>&nbsp;</strong></p>", "user_ratings": {}, "developers": [{"developer-name": "www.extra-life.org", "developer-url": "http://www.extra-life.org"}], "item_content_type": null}, "kingmaker_rostovhinterlandsandthegreenbelt": {"human_name": "Kingmaker - Rostov Hinterlands and the Greenbelt", "machine_name": "kingmaker_rostovhinterlandsandthegreenbelt", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Roll20", "publisher-url": "https://www.pathfinderinfinite.com/en/product/424578/kingmaker-rostov-hinterlands-and-the-greenbelt"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 5.0}, "subtitle_html": null, "description_text": "<p>Explore the Rostov Hinterlands and the Greenbelt in greater detail than ever: Expanded encounter descriptions, ideas for Empty hexes, 2 Camspsite Maps, 4 Battle Maps (Temple of the Elk, Oleg's Trading Post, Spider Den, Frogpond), and a series of helpful Screenshots to be used as handouts (first-person views).</p>", "user_ratings": {}, "developers": [{"developer-name": "Gremlin Brothers"}], "item_content_type": "game"}, "kingmaker_kamelands": {"human_name": "Kingmaker - Kamelands", "machine_name": "kingmaker_kamelands", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Roll20", "publisher-url": "https://www.pathfinderinfinite.com/en/product/431864/kingmaker-kamelands"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 5.0}, "subtitle_html": null, "description_text": "<p>OVER 50 MAP VARIANTS! 2 Campsite Maps (Bluff &amp; Badlands), Candlemere Island and Basement, Lizardking's Village, Mudbowl, Silverstep Lake Battle Map, Scythe tree (with bonus animated map), PLUS Wandering Monsters (Expanded Table) and Ideas for Empty Hexes (Six new ones!).</p>", "user_ratings": {}, "developers": [{"developer-name": "Gremlin Brothers"}], "item_content_type": "game"}, "nonanimalcompanionsroll20": {"human_name": "Non Animal Companions | Roll20", "machine_name": "nonanimalcompanionsroll20", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Roll20", "publisher-url": "https://www.pathfinderinfinite.com/en/product/443209/non-animal-companions-roll20"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 25.0}, "subtitle_html": null, "description_text": "<p>Over 30 all new (non) Animal Companions ready to be slotted into your pathfinder 2e game! From an Owlcub to the Mimic, all the companions you'd want to join your party are here, featuring the Dragon Wyrmling, the Gelatinous Cube, the Giant Spider, the Imp, the Hydra, the Snapping Flytrap, the Purple-ish Wormling, and the Warg!</p>", "user_ratings": {}, "developers": [{"developer-name": "Nikola Ninkovic"}], "item_content_type": "game"}, "featsplus": {"human_name": "Feats+", "machine_name": "featsplus", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Roll20", "publisher-url": "https://www.pathfinderinfinite.com/en/product/490114/feats"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 5.0}, "subtitle_html": null, "description_text": "<p>Set out on your journey into previously unreachable heights with Feats+, a massive expansion to Pathfinder 2nd Edition's general feats and skill feats. Whether you're tackling flying opponents from the air, stoking the flames of fame on a world-wide level or stealing the very senses of your targets, Feats+ has over 330 feats to expand the pool of general feats you can choose from.</p>", "user_ratings": {}, "developers": [{"developer-name": "Derry Luttrell, Tony Saunders, Team+, Cerapter, Conner Berkheiser, Sen H.H.S."}], "item_content_type": "game"}, "lostomensancestries_dragonkin": {"human_name": "Lost Omens Ancestries: Dragonkin", "machine_name": "lostomensancestries_dragonkin", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Roll20", "publisher-url": "https://www.pathfinderinfinite.com/en/product/378138/lost-omens-ancestries-dragonkin"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 5.0}, "subtitle_html": null, "description_text": "<p>Dragonkin are the scions of dragons, drawing upon their draconic lineage for great power. Lost Omens Ancestries: Dragonkin presents a new versatle heritage for the second edition of the Pathfinder Roleplaying Game. The versatile heritage allows characters to tap into their draconic potential to breathe fire, grow deadly claws, take flight with powerful wings, and more. This product presents background information on dragonkin—including their place in Golarion, the new heritage, and 28 ancestry feats all written by veteran Second Edition designer, Luis Loza.</p>", "user_ratings": {}, "developers": [{"developer-name": "Luis Loza"}], "item_content_type": "game"}, "minotaursunleashed_apathfinder2ndeditionancestry": {"human_name": "Minotaurs Unleashed: A Pathfinder 2nd Edition Ancestry", "machine_name": "minotaursunleashed_apathfinder2ndeditionancestry", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Roll20", "publisher-url": "https://www.pathfinderinfinite.com/en/product/422349/minotaurs-unleashed-a-pathfinder-2nd-edition-ancestry"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 15.0}, "subtitle_html": null, "description_text": "<p>The minotaurs of Golarion are a powerful and brave band of people who have been overlooked by many over the years, considered by the common folk to be nothing more than violent monsters and worshippers of the demon lord Baphomet. What many don’t know however, is that there are a number of diverse minotaur cultures across Golarion that seek a different path and have long since forged their own destiny. If you wish to play a powerful and cunning ancestry with a complex and untold history, Minotaurs Unleashed is for you!</p>", "user_ratings": {}, "developers": [{"developer-name": "Conner Berkheiser"}], "item_content_type": "game"}, "playercore1expanded": {"human_name": "Player Core 1 Expanded", "machine_name": "playercore1expanded", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Roll20", "publisher-url": "https://www.pathfinderinfinite.com/en/product/460420/player-core-1-expanded"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 5.0}, "subtitle_html": null, "description_text": "<p>Do you find that Player Core 1 doesn't have a subclass to fit? Whether you are looking for a Cleric spy, a swaggering Rogue, or a Druid with a will of Steel, you will find myriad options within, made by 4 Infinite Masters and specially tuned for the PF2e Remaster! This expansion includes 2 New Bard Muses, 1 new Cleric Domain &amp; a new Doctrine, 2 new Druid Orders, a small collection of new Fighter feats, 1 new Ranger Edge, 1 new Rogue Racket, 4 new Witch Patrons, 4 new Wizard Schools &amp; a new Thesis, and feats to go with them all!</p>", "user_ratings": {}, "developers": [{"developer-name": "Conner Berkheiser, Arkon, Sasha Laranoa Harving, Derry Luttrell"}], "item_content_type": "game"}, "kingmaker_tuskwater": {"human_name": "Kingmaker - Tuskwater", "machine_name": "kingmaker_tuskwater", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Roll20", "publisher-url": "https://www.pathfinderinfinite.com/en/product/430893/kingmaker-tuskwater"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 15.0}, "subtitle_html": null, "description_text": "<p>A guide to the Tuskwater region for the Kingmaker Adventure Path (2nd Edition includes): a revised and expanded encounter list; six new \"Empty Hex\" ideas that can be randomly generated; a full bonus dungeon (THE WITCHING WELL), plus OVER 50 MAP CONFIGURATIONS including Roll20-ready files; a few bonus snowy maps; other locations such as Staglord Fort, Old Crackjaw, Old Beldame, Lonely Barrow, and Hateful Hermit (and wow is he hateful!).</p>", "user_ratings": {}, "developers": [{"developer-name": "Gremlin Brothers"}], "item_content_type": "game"}, "talesfromthedarkarchivetheisleinthemistroll20": {"human_name": "Tales from the Dark Archive The Isle in the Mist | Roll20", "machine_name": "talesfromthedarkarchivetheisleinthemistroll20", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Roll20", "publisher-url": "https://www.pathfinderinfinite.com/en/product/437860/tales-from-the-dark-archive-the-isle-in-the-mist-roll20"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 5.0}, "subtitle_html": null, "description_text": "<p>Sitting on a simply-carved stone throne in the dank darkness, the single frosted eye watches with eager anticipation in the seeing glass as the imprudent mortals talk of her. That same eye gleams in anticipation as it lands upon a little child, wrapped tightly into the lap of a listening mother, then catches sight of the glamour of the dancing water bugs. Wetness drips from her matted hair as she lovingly strokes the impish creature on her lap. With a grating voice, she speaks, “Yes, she will do nicely! Go and fetch her to me, my lovely precious one. Soon she shall join us!” The Isle In The Mist is a one-session Pathfinder Second Edition Adventure For Level 3 and will supplement the adventures found within the Dark Archive rulebook by Paizo.</p>", "user_ratings": {}, "developers": [{"developer-name": "Tom Robinson"}], "item_content_type": "game"}, "archetypesplus": {"human_name": "Archetypes+", "machine_name": "archetypesplus", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Roll20", "publisher-url": "https://www.pathfinderinfinite.com/en/product/450292/archetypes"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 15.0}, "subtitle_html": null, "description_text": "<p>No two heroes are alike, and with Archetypes+, a massive supplement with 300+ Feats, you can expand your world of adventure like never before. Delve deep into dungeons to fight terrible foes, battle with new skills and abilities from beyond our realm, or sell some items for a bargain price. The choice is yours! Archetypes+ both expands archetypes with few feats, adds incredible flavour to ones with great mechanics but no real stories, and adds several brand new archetypes to play with!</p>", "user_ratings": {}, "developers": [{"developer-name": "Derry Luttrell, Tony Saunders, Conner Berkheiser, Grady Wang, Arkon, Sasha Laranoa Harving, Team+"}], "item_content_type": "game"}, "golarionunseen_bloodlines": {"human_name": "Golarion Unseen: Bloodlines", "machine_name": "golarionunseen_bloodlines", "youtube_link": null, "callout": null, "publishers": [{"publisher-name": "Roll20", "publisher-url": "https://www.pathfinderinfinite.com/en/product/399088/golarion-unseen-bloodlines"}], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "min_price|money": {"currency": "USD", "amount": 15.0}, "subtitle_html": null, "description_text": "<p>Golarion Unseen: Bloodlines offers a view into the expanded options for Sorcerers. Have you always wanted to play sorcerer with a connection to Time, or maybe even the ancient Serpentfolk from before the age of darkness? Well look no further! With 20 new bloodlines and 60 new focus spells, this book provides a lot of genealogy to uncover!</p>", "user_ratings": {}, "developers": [{"developer-name": "John Holmes"}], "item_content_type": "game"}}, "charity_data": {"charity_items": {"extralife": {"machine_name": "extralife", "youtube_link": "ZS7WRl7N1Ig", "item_content_type": null, "subtitle_html": null, "description_text": "<p><em>Donations to support Extra Life / Children's Miracle Network Hospitals&nbsp;are made to the&nbsp;<a rel=\"nofollow noopener\" target=\"_blank\" href=\"https://support.humblebundle.com/hc/en-us/articles/205183597\" title=\"Link: https://support.humblebundle.com/hc/en-us/articles/205183597\">PayPal Giving Fund</a>, subject to its policies.</em></p>\n<p>Extra Life is a Children’s Miracle Network Hospitals fundraising program that empowers the gaming community to make a difference in the lives of local sick and injured kids. Participants fundraise year-round and during a 24-hour gaming marathon each fall.<br><br>Getting involved is as easy as signing up online at extra-life.org, asking your friends and family to donate, and pledging to play games in support of the Children’s Miracle Network Hospital of your choice. You can play from the comfort of your own home, playing any game you want.<br><br>Since 2008, Extra Life has raised more than $75 million for member hospitals. Play games, heal kids and join the community today at <a href=\"http://www.extra-life.org\" target=\"_blank\" rel=\"noopener\">www.extra-life.org</a>.</p>\n<p><strong>&nbsp;</strong></p>", "human_name": "Extra Life / Children's Miracle Network Hospitals", "developers": [{"developer-name": "www.extra-life.org", "developer-url": "http://www.extra-life.org"}], "publishers": [], "user_ratings": {}}}}, "from_bundle": {"machine_name": "pathfinderinfinitecelebrationkingmakerroll20_bookbundle", "tile_short_name": "Pathfinder Infinite - Celebration of Kingmaker by Roll20", "short_marketing_blurb": "Create your kingdom", "marketing_blurb": "Get <em>Feats+</em>, <em>Frontiers of Magic</em>, <em>Kingmaker - Kamelands</em>, <em>Player Core 2 Expanded</em>, <em>Boosted Bestiary | Roll20</em>, <em>Kingmaker Adventure Path | Roll20 VTT</em>, and more!", "detailed_marketing_blurb": "The Stolen Lands are yours for the claiming, and all you need is our new bundle offering everything you need to launch your own Pathfinder Infinite Kingmaker Adventure Path campaign! This comprehensive kit includes the full Kingmaker Player’s Guide to get things, ahem, rolling; all the occult knowledge contained within the pages of Frontiers of Magic; the Boosted Bestiary to update your favorite Pathfinder creatures across multiple levels; the expanded Player Core 2, and much more! Gather your comrades and prepare to embark on the adventure of a lifetime, and help support Extra Life charity with your purchase! ", "author": "Roll20", "start_date|datetime": "2025-11-01T18:00:00", "end_date|datetime": "2025-11-22T19:00:00", "type": "bundle", "product_url": "/books/pathfinder-infinite-celebration-kingmaker-roll20-books"}, "updated_at|datetime": "2025-11-02T03:22:49.683335", "first_seen_at|datetime": "2025-11-02T03:22:49.683335"}
