{"machine_name": "waaaghtoberwarhammerbundle_bundle", "author": "Publishers", "basic_data": {"eula": null, "human_name": "WAAAGHtober! A Warhammer Bundle", "detailed_marketing_blurb": "WAAAGH! War on an apocalyptic scale has arrived—how will you defend the Imperium? Gather your arms for the exciting Warhammer adventures within this action-packed bundle running throughout October! Sink your teeth into the very best from the Warhammer universe with brutal gunplay, blood-soaked narratives, and so much more. Bring glory to mankind as Captain Titus, a hardened hero tasked with retaking the Imperial Forge World from Orks in Warhammer 40,000: Space Marine - Anniversary Edition. Or test your tactical mettle in Warhammer 40,000: Battlesector, the turn-based strategy experience steeped in grimdark warfare.", "short_marketing_blurb": "200+ hours of Warhammer games", "media_type": "game", "description": "<p><strong>200+ hours of Warhammer games.</strong> WAAAGH! War on an apocalyptic scale has arrived—how will you defend the Imperium? Gather your arms for the exciting Warhammer adventures within this action-packed bundle running throughout October! Sink your teeth into the very best from the Warhammer universe with brutal gunplay, blood-soaked narratives, and so much more. Bring glory to mankind as Captain Titus, a hardened hero tasked with retaking the Imperial Forge World from Orks in Warhammer 40,000: Space Marine - Anniversary Edition. Or test your tactical mettle in Warhammer 40,000: Battlesector, the turn-based strategy experience steeped in grimdark warfare.</p>\n<p><strong>Pay $6 or more.</strong> Normally, the total cost for the games in this bundle is as much as $318. Here at Humble Bundle, you choose the price and increase your contribution to upgrade your bundle! This bundle has a minimum $6 purchase. Pay $6 or more to access Steam keys.</p>\n<p><strong>Redeem on Steam.</strong> All of the games in this bundle are available on Steam for Windows.</p>\n<p><strong>Support charity.</strong> Choose where the money goes - between the publishers and to support Coral Guardian. If you like what we do, you can leave us a Humble Tip too!</p>", "legal_disclaimer": null, "required_account_links": ["steam"], "end_time|datetime": "2025-10-30T01:00:00"}, "tier_item_data": {"warhammer40000_inquisitor_martyr": {"human_name": "Warhammer 40,000: Inquisitor - Martyr", "machine_name": "warhammer40000_inquisitor_martyr", "youtube_link": "kD6-tu3I5ME", "callout": "<span data-sheets-root=\"1\">Solo or 4-Player Co-op</span>", "publishers": [], "side_box_art_text": null, "third_party_subscribe_text": null, "min_price|money": {"currency": "USD", "amount": 12.0}, "subtitle_html": null, "description_text": "<strong class=\"hmb\"> <br><br>A STORY-DRIVEN SINGLE PLAYER CAMPAIGN </strong> <br>Far from the guiding light of the God-Emperor, torn apart by the foul tempests that distort reality, the Caligari Sector is slowly rotting away from the inside, tainted by the Chaos Gods. Purge the unclean with the most powerful agents of the Imperium! <br><br>Warhammer 40,000: Inquisitor – Martyr is grim action-RPG set in the violent 41st millennium, when the galaxy is at constant war. Become a mighty Inquisitor and carry out the Emperor’s will. Choose one of the multiple classes and take part in brutal combat encounters: embark on a huge variety of missions with your fellow agents and fight through the single-player story campaign set on a haunted fortress-monastery which hides a terrible secret from the past of the Inquisition. <strong class=\"hmb\"> <br><br>THE NEXT MILESTONE IN THE EVOLUTION OF ARPGS </strong> <br><br>The first Action-RPG set in the grim future of the 41st Millennium takes the genre to its next level: an open-world sandbox game with a persistent universe with a huge variety of missions, tactical, brutal combat encounters in destructible environments and a storyline influenced by the community of players. Use the cover system for tactical advantage, perform executions in epic boss battles and become a Protector of any solar systems with your glorious actions! <strong class=\"hmb\"> <br><br>INQUISITORS: SECRET AGENTS AND SPECIALISTS </strong> <br><br>Forge your own playstyle with different character classes and specializations: hold your ground with the Crusader Inquisitor while enemies close in on you, bring in your finesse and cunning with the Death Cult Assassin background, or use the unspeakable powers of the Warp with the Primaris Psyker background. Choose from three specializations for each classes that fit your playstyle. <strong class=\"hmb\"> <br><br>TRAVERSE A WHOLE GALACTIC SECTOR </strong> <br><br>Explore the Star Map of the vast Caligari Sector, travel in different subsectors and explore an immense amount of solar systems, visit a growing number of unique points of interests: investigate on different planets with distinctive terrain conditions, fight your way through corridors of infested Void Stations, abandoned Star Forts and other diverse environments! <strong class=\"hmb\"> <br><br>FIGHT THE CORRUPTION TOGETHER </strong> <br><br>You can go solo as a lonely Inquisitor, but you can also assemble a team of your friends! Play missions in co-operative mode with up to 4 team members, blast away your foes together claiming great rewards, and form Cabals to gather your close allies! Inquisitorial Cabals are groups of Inquisitors working together. Cabals can progress just like characters do, and being a member can often grant special missions. The Inquisition has a lot of different factions with different agendas, and Cabals sometimes clash with each other in the shadows. <strong class=\"hmb\"> <br><br>IMPROVE YOUR WEAPONS, CRAFT MISSIONS AND TWEAK YOUR SKILLS </strong> <br><br>Looking for a specific loot or reward? Use Uther’s Tarot to set the conditions of your next mission, collect Blueprints and use Crafting to improve your equipment, and use the Inoculator to fine-tune your different skills. Choose your loadout to your advantage for each mission! <strong class=\"hmb\"> <br><br>A LIVING, EXPANDING WORLD<br></strong> <br>Warhammer 40,000: Inquisitor – Martyr is an ever-growing, long-lasting experience. Expansions and regular free updates will introduce new enemy factions, new terrain settings, new missions and mission types, new story-driven investigations and new gameplay features.<br><br>Chapters are big, free updates that will introduce longer story arcs in which players can shape the persistent world of the Caligari sector with their actions. Global Events and Chapters ensure new challenges – there’s always something new to explore or to collect!", "user_ratings": {"steam_percent|decimal": 0.74, "display_user_ratings": "steam_overall", "review_text": "Mostly Positive", "steam_count": 12473}, "developers": [{"developer-name": "NeocoreGames", "developer-url": "https://neocoregames.com/en"}], "item_content_type": "game"}, "warhammer40000_battlesector-tyranidelites": {"human_name": "Warhammer 40,000: Battlesector - Tyranid Elites", "machine_name": "warhammer40000_battlesector-tyranidelites", "youtube_link": "nMZvdzzMreY", "callout": "82% Positive on Steam", "publishers": [{"publisher-name": "Slitherine Ltd.", "publisher-url": "https://www.slitherine.com/"}], "side_box_art_text": null, "third_party_subscribe_text": null, "min_price|money": {"currency": "USD", "amount": 12.0}, "subtitle_html": null, "description_text": "Two deadly new units join the Tyranid roster in Warhammer 40,000: Battlesector: the nightmarish\n<strong>\n Broodlord\n</strong>\n, and the devastating\n<strong>\n Hive Guard\n</strong>\n.\n<strong class=\"hmb\">\n <br>\n <br>\n Broodlord\n</strong>\n<br>\n<br>\nThe Broodlord is a melee powerhouse, with the capability to disrupt the minds of nearby prey.\n<br>\n<br>\nCalling upon the might of the Hive Mind, the Broodlord uses its Paroxysm psychic ability to render a unit ineffective in combat, and then leaps upon them with its Monstrous Rending Claws. While the Broodlord lingers on the battlefield, any nearby Genestealers will be able to swarm through the enemy's defenses with the help of the Broodlord's Evolved Brood Telepathy.\n<strong class=\"hmb\">\n <br>\n <br>\n Hive Guard\n</strong>\n<br>\n<br>\nThe Hive Guard are hulking armoured ranged units that wield terrifying bio-cannons against their prey.\n<br>\n<br>\nHive Guard units have a choice between the Impaler Cannon or the Shockcannon to eradicate their foes. The telepathic shard-beast ammunition of the Impaler Cannons ducks and weaves around obstacles, rendering anything but the heaviest of cover useless. Shockcannons blast apart the armour of mechanised foes, stopping tanks in their tracks and bringing even the mightiest of dreadnoughts to their knees.\n<br>\n<br>\n<i>\n With this DLC, the Broodlord and Hive Guard can be added to your single-player skirmish and multiplayer armies.\n</i>\n<br>\n<br>\n<strong>\n The Broodlord and the Hive Guard have been added to the Age of Crimson single player story campaign in a\n <u>\n  free update\n </u>\n . Therefore, ownership of the DLC is\n <u>\n  not required\n </u>\n to fight against them in the campaign.\n</strong>", "user_ratings": {}, "developers": [{"developer-name": "Black Lab Games", "developer-url": "https://blacklab.games/"}], "item_content_type": "game"}, "warhammer_vermintide2": {"human_name": "Warhammer: Vermintide 2", "machine_name": "warhammer_vermintide2", "youtube_link": "RgVtjlDSZ40", "callout": null, "publishers": [], "side_box_art_text": null, "third_party_subscribe_text": null, "min_price|money": {"currency": "USD", "amount": 6.0}, "subtitle_html": null, "description_text": "<i>Warhammer: Vermintide 2</i> is a 4-player co-op action game set in the Warhammer Fantasy Battles world. Sequel to the critically acclaimed Vermintide, Vermintide 2 is the latest installment in a franchise best known for its intense and bloody first-person melee combat. <br><br>Our five heroes have returned to take on an even greater threat than before – the combined forces of a ruinous Chaos army and the swarming Skaven horde. The only thing standing between utter defeat and victory is you and your allies. If you fall - so too will the Empire.<br>\n<ul>\n<li><strong> Fight through endless hordes of enemies together </strong> with up to 3 friends in this visceral co-op action experience</li>\n<li><strong> Choose between 5 different characters, </strong> each with 3 branching careers to master</li>\n<li><strong> Evolve your skill and climb the difficulty ladders, </strong> from Recruit, Veteran, Champion to Legend</li>\n<li><strong> Customize your own unique style of play </strong> with 15 different talent trees and 50+ Weapon Types</li>\n<li><strong> Explore the war-ravaged lands of a dying world </strong> with a wide range of stunning levels to experience</li>\n</ul>", "user_ratings": {"steam_percent|decimal": 0.83, "display_user_ratings": "steam_overall", "review_text": "Very Positive", "steam_count": 63090}, "developers": [{"developer-name": "Fatshark", "developer-url": "https://www.fatshark.se/"}], "item_content_type": "game"}, "warhammer40000_shootasbloodteef": {"human_name": "Warhammer 40,000: Shootas, Blood & Teef", "machine_name": "warhammer40000_shootasbloodteef", "youtube_link": "tsirLOXA-lU", "callout": null, "publishers": [{"publisher-name": "Rougeside"}], "side_box_art_text": null, "third_party_subscribe_text": null, "min_price|money": {"currency": "USD", "amount": 12.0}, "subtitle_html": null, "description_text": "<strong class=\"hmb\">Prepare to charge Luteus Prime </strong> <br><br>For many centuries, the planet of Luteus Alpha has been producing much needed materiel for the wars raging on in the Armageddon sector. Many are drawn to the planet, and so is the great Warboss Ogruk Gutrekka. Upon arriving on the planet, Gutrekka took your most precious hair squig. Filled with vengeance you’ve sworn to do anything it takes to return your hair squig, and prove who is the strongest! And so your adventure on Luteus Prime begins. <br><br><i>Warhammer 40,000: Shootas, Blood &amp; Teef</i> is a hand-drawn 2D action adventure taking you on a wild ride of dakka, gore and explosions! Krump your way through the hive city of Luteus Prime; battle Humans, Orks and Genestealer cultists; and ultimately retrieve your luscious hair squig from the hands of the Warboss Gutrekka! <br><br>Who’s ready for Waaagh!? <br><strong><br>Game Features: </strong> <br>\n<ul>\n<li>Classic 2D side-scrolling goodness, filled with intense action, funny one-liners, screaming deaths and comical dialogues!</li>\n<li>Choose your class, picking between four distinct characters, each with their own unique toolkit true to the Warhammer 40,000 lore.</li>\n<li>Inflict chaos with an arsenal of weapons at your fingertips. Expand your armory with up to twenty different weapons. There’s no such thing as having too much dakka!</li>\n<li>Unleash your Waaagh! at the right time! Wreak carnage and rain destruction on those puny ‘umies.</li>\n<li>Challenge the mightiest empire in the Warhammer 40,000 universe. Become victorious, bring the planet to its knees and lead your very own Waaagh!</li>\n<li>Earn hats by destroying compelling bosses, completing milestones or exchanging Teef at the Mekboy shop. Teef are collected by tearing through the story.</li>\n<li>Beautiful hand-drawn scenery gives an incredible sense of depth to a side-on world.</li>\n<li>Break up the action, and immerse yourselves in engaging cinematics.</li>\n<li>Set foot on Luteus Prime in single-player mode, or get a party together of up to four Ork Boyz and have some fun together! Multiplayer is available both online and in local co-op.</li>\n<li>Brawl it out against your rivals in an all-out epic battle to decide who is the baddest Ork in the warband! Up to four boyz can scrap it out in the arena, both online and in local PvP.</li>\n<li>Get your socks rocked off with an amazing heavy metal soundtrack, composed by Deon van Heerden.</li>\n<li>Yes, there will be explosions. Like, a lot of them!</li>\n</ul>", "user_ratings": {"steam_percent|decimal": 0.87, "display_user_ratings": "steam_overall", "review_text": "Very Positive", "steam_count": 1299}, "developers": [{"developer-name": "Rogueside", "developer-url": "https://www.rogueside.com/"}], "item_content_type": "game"}, "warhammer40000_spacemarine-anniversaryedition": {"human_name": "Warhammer 40,000: Space Marine - Anniversary Edition", "machine_name": "warhammer40000_spacemarine-anniversaryedition", "youtube_link": "CkhcZaHRtkI", "callout": null, "publishers": [], "side_box_art_text": null, "third_party_subscribe_text": null, "min_price|money": {"currency": "USD", "amount": 12.0}, "subtitle_html": null, "description_text": "Celebrate 10 years since the release of Warhammer 40,000: Space Marine with this new Anniversary Edition.\n<br>\n<br>\nThis Anniversary Edition of the game includes for the first time:\n<br>\n<br>\n•\tThe full soundtrack for the game\n<br>\n•\tClassic and brand new wallpapers\n<br>\n•\tThe original manual (pdf)\n<br>\n•\tThe Official Strategy Guide (pdf)\n<br>\n•\tRingtone\n<br>\n•\tThe Collector’s Edition Artbook (pdf)\n<br>\n•\tCollectors cards (pdfs)\n<br>\n•\tThe original launch trailer\n<br>\n<br>\nThe Anniversary Edition also includes the original main Space Marine game, along with all DLC released for the game:\n<br>\n<br>\n•\tChaos Unleashed Map Pack\n<br>\n•\tDreadnought Assault DLC\n<br>\n•\tIron Hand Veteran Chapter Pack DLC\n<br>\n•\tDeath Guard Champion Chapter Pack DLC\n<br>\n•\tGolden Relic Bolter\n<br>\n•\tGolden Relic Chainsword\n<br>\n•\tPower Sword\n<br>\n•\tBlood Angels Veteran Armour Set\n<br>\n•\tSalamanders Veteran Armour Set\n<br>\n•\tAlpha Legion Champion Armour Set\n<br>\n•\tLegion of the Damned Armour Set\n<br>\n•\tEmperor's Elite Pack\n<br>\n•\tTraitor Legions Pack\n<br>\n<br>\nIn Warhammer 40,000 Space Marine you are Captain Titus, a Space Marine of the Ultramarines chapter and a seasoned veteran of countless battles.\n<br>\n<br>\nA millions-strong Ork horde has invaded an Imperial Forge World, one of the planet-sized factories where the war machines for humanity’s never ending battle for survival are created. Losing this planet is not an option and be aware of the far more evil threat lurking large in the shadows of this world.\n<br>\n<br>\n<ul>\n <li>\n  <strong>\n   DEVASTATING WEAPONRY\n  </strong>\n  <br>\n  Experience 40,000 years of combat, evolved. Enhance your vast arsenal as you unlock new weapons, upgrades, armor & abilities through an accessible progression system. This devastating weaponry empowers players to deliver bone crushing violence and dismemberment to their enemies.\n  <br>\n  <br>\n </li>\n <li>\n  <strong>\n   BLOCKBUSTER ENTERTAINMENT\n  </strong>\n  <br>\n  With an Imperial liberation fleet en-route, the Ultramarines are sent in to hold key locations until reinforcements arrive. Captain Titus and a squad of Ultramarine veterans use the bolter and chainsword to take the fight to the enemies of mankind.\n  <br>\n  <br>\n </li>\n <li>\n  <strong>\n   BRUTAL 8VS8 ONLINE COMBAT\n  </strong>\n  <br>\n  Form your own Space Marine squad or Chaos Space Marine warband and face off in 8 vs 8 online matches. Gain experience and unlock new weapons and armor to customize the Devastator, Assault, and Tactical Marine classes.\n </li>\n</ul>", "user_ratings": {"steam_percent|decimal": 0.92, "display_user_ratings": "steam_overall", "review_text": "Very Positive", "steam_count": 9096}, "developers": [{"developer-name": "Relic Entertainment", "developer-url": "https://www.relic.com/"}], "item_content_type": "game"}, "warhammer_vermintide": {"human_name": "Warhammer: End Times - Vermintide", "machine_name": "warhammer_vermintide", "youtube_link": "5cdjI3yob1Q", "callout": null, "publishers": [], "side_box_art_text": null, "third_party_subscribe_text": null, "min_price|money": {"currency": "USD", "amount": 6.0}, "subtitle_html": null, "description_text": "<strong> Vermintide is a co-operative action first person shooter and melee combat adventure set in the End Times of the iconic Warhammer Fantasy world. </strong> <br><br>Vermintide takes place in and around Ubersreik, a city overrun by Skaven. You will assume the role of one of five heroes, each featuring different play-styles, abilities, gear and personality. Working cooperatively, you must use their individual attributes to survive an apocalyptic invasion from the hordes of relentless rat-men, known as the Skaven. Battles will take place across a range of environments stretching from the top of the Magnus Tower to the bowels of the Under Empire. <strong class=\"hmb\"> <br><br>Core Features: </strong> <br>\n<ul>\n<li><strong> Cooperative Survival For up to 4 Players - </strong> Band together with your friends or die alone. Vermintide will continuously test the teamwork and skill of you and your friends. Drop-in, drop-out Multiplayer and the addition of A.I. bots ensures a full team at any time, regardless of available players.</li>\n<li><strong> Play as Five Unique Heroes - </strong> Five distinct characters to choose from, each with their own personality, agenda and story to tell. Learning what it means to work together is key to the group's survival.</li>\n<li><strong> Huge Hero Arsenal - </strong> Each hero has its own unique weapons arsenal to draw from, allowing you to adjust their combat style to fit their gameplay preference. There are hundreds of different weapons, includíng swords, daggers, axes, hammers, bows, guns, magical staves &amp; more</li>\n<li><strong> Embark on an Epic Quest - </strong> Boasting 13 diverse levels - on the ground, in buildings, on walls and underground - ranging from the immense Magnus Tower to the treacherous Under Empire, Vermintide will take you on a journey you’ll never forget.</li>\n<li><strong> Experience the Skaven Like Never Before - </strong> A rising tide of malicious and cunning rat-men await you, hacking, clawing and eviscerating all that stand in their way. Face vicious packs of clan-rats and deadly specialized elites.</li>\n<li><strong> Gather Shiny Loot - </strong> Rewarding teamwork above all else, you are given loot dice at the end of a mission that will reward you and your team mates with a weapon, a hat or a trinket. Completing side objectives means that better loot dice can be added to the roll.</li>\n<li><strong> Battle Unpredictable Enemies - </strong> Vermintide features a dynamic spawn system providing a constant set of new challenges lurking behind every corner.</li>\n<li><strong> Experience an Immersive Story - </strong> Games Workshop veterans have banded together to write a fantastic new addition to the Warhammer lore, offering a new perspective on the cataclysmic events of The End Times.</li>\n<li><strong> Find a Path to Safety - </strong> The Skaven boast incredible mobility, able to climb and leap fantastic distances to make life a living hell for the Heroes. No matter where you go, they will be there, ready to pounce.</li>\n</ul>\n<br><i> The time of mortals is ending, and the reign of Chaos draws ever closer. The Dark Gods are at last united in a singular purpose, losing their madness across the world as never before. In the Empire of Sigmar, Karl Franz's gaze is focused on the incursion of the savage northmen, but it is not the only threat. As the Chaos moon Morrslieb waxes full, shrill voices echo through tunnels gnawed far beneath the Empire's cities, and a Skaven host swarms towards the surface. It emerges first in the city of Ubersreik, a screeching mass that consumes all before it. Soon Ubersreik is a charnel-town, drowning beneath the malevolent shadow of the Horned Rat. <br><br>Yet even in the darkest times, there are always champions to light the way. As Ubersreik cowers, five heroes, united by capricious fate, carry the fight to the rat-men. It remains to be seen whether they have the strength to survive, let alone work together long enough to thwart the invaders. One truth, however, is beyond all doubt: should these five fall, then Ubersreik will fall with them. </i>", "user_ratings": {"steam_percent|decimal": 0.82, "display_user_ratings": "steam_overall", "review_text": "Very Positive", "steam_count": 12337}, "developers": [{"developer-name": "Fatshark", "developer-url": "http://www.fatsharkgames.com/"}], "item_content_type": "game"}, "warhammer40000_battlesector": {"human_name": "Warhammer 40,000: Battlesector", "machine_name": "warhammer40000_battlesector", "youtube_link": "nVsCATpZloc", "callout": "<span data-sheets-root=\"1\">Live &amp; Asynchronous Multiplayer</span>", "publishers": [], "side_box_art_text": null, "third_party_subscribe_text": null, "min_price|money": {"currency": "USD", "amount": 12.0}, "subtitle_html": null, "description_text": "<i>Warhammer 40,000: Battlesector</i> is a fast-paced turn-based strategy game set in the grimdark universe of the 41st Millenium. Pick your force, develop your army, field mighty heroes and fight for victory using superior strategy, awesome abilities, and devastating weaponry.\n<strong class=\"hmb\">\n <br>\n <br>\n Age of Crimson Dawn\n</strong>\n<br>\nExperience an epic twenty mission single-player campaign that explores the aftermath of the Devastation of Baal. Help Sergeant Carleon and his allies purge the Tyranid infestation on Baal Secundus, and preserve the honour of the noble Blood Angels.\n<strong class=\"hmb\">\n <br>\n <br>\n Skirmish Mode\n</strong>\n<br>\nFight across the surface of Baal on maps of your choosing and select either the Blood Angels or the Tyranids in the Skirmish mode. Completely customize your army list by picking your units, heroes and their loadouts.\n<strong class=\"hmb\">\n <br>\n <br>\n Forge Your Armies\n</strong>\n<br>\nCommand iconic units like the Sanguinary Priest, the Librarian Dreadnought, and the Hive Tyrant to annihilate your foes. Use over 60 abilities and 50 weapons to orchestrate your opponent’s bloody demise.\n<strong class=\"hmb\">\n <br>\n <br>\n Build Momentum\n</strong>\n<br>\nEach faction has a unique Momentum system that can result in a Surged unit. Units that Surge are able to string together superhuman chains of actions, or use the opportunity to further upgrade their abilities.\n<strong class=\"hmb\">\n <br>\n <br>\n Call In Air Support\n</strong>\n<br>\nUse Command Points to call in faction-specific air support abilities. The Blood Angels Stormraven can obliterate xenos with a missile barrage, or deep strike a unit of veteran Assault Marines behind enemy lines. Meanwhile, the Tyranid Harpy can devastate the enemy defenses with its Sonic Screech, or scatter the battlefield with its deadly Spore Mines.\n<strong class=\"hmb\">\n <br>\n <br>\n Face Your Friends On The Battlefield\n</strong>\n<br>\nWith live and asynchronous multiplayer, and hotseat modes available, there’s no excuse not to take your friends to war.\n", "user_ratings": {"steam_percent|decimal": 0.91, "display_user_ratings": "steam_overall", "review_text": "Very Positive", "steam_count": 2002}, "developers": [{"developer-name": "Slitherine Ltd.", "developer-url": "https://blacklab.games/"}], "item_content_type": "game"}, "warhammer40k_inquisitor_prophecy": {"human_name": "Warhammer 40,000: Inquisitor - Prophecy", "machine_name": "warhammer40k_inquisitor_prophecy", "youtube_link": "AVfP3m21Foc", "callout": "<span data-sheets-root=\"1\">2-4 Player Co-op Missions</span>", "publishers": [], "side_box_art_text": null, "third_party_subscribe_text": null, "min_price|money": {"currency": "USD", "amount": 6.0}, "subtitle_html": null, "description_text": "<html>\n <head>\n </head>\n <body>\n  IMPORTANT: You don’t have to own\n  <i>\n   Warhammer 40,000: Inquisitor - Martyr\n  </i>\n  to play this game.\n  <br>\n  <br>\n  IMPORTANT: for\n  <i>\n   Warhammer 40,000: Inquisitor - Martyr\n  </i>\n  players: Existing characters, their items and their progress are carried over to the expansion, adjusted to the new 2.0 rules and mechanics. Owners of both\n  <i>\n   Warhammer 40,000: Inquisitor - Martyr\n  </i>\n  and\n  <i>\n   <i>Warhammer 40,000: Inquisitor - Prophecy</i>\n  </i>\n  won't require separate clients to run the game and the expansion.\n  <strong class=\"hmb\">\n   <br>\n   <br>\n   <i>WARHAMMER 40,000: INQUISITOR - PROPHECY</i>\n  </strong>\n  <br>\n  Deep within the darkest reaches of the remote Caligari Sector, beyond  barriers formed by churning Warp-surges, lies a vast area tainted by the Chaos Gods and threatened by the rise of the foul Xenos. On the barren Death Worlds the hideous Tyranids are slowly coming back from their hibernation, long decades after the defeat of their colossal Hive Fleet, while the Imperium of Mankind faces a new wave of unexplained attacks by Aeldari warriors fleeing their dying Craftworld. And if that wasn’t enough to alarm the Holy Inquisition, a mysterious presence with potentially devastating powers has returned from the Warp on the long-lost “Martyr”, destined to fulfil a prophecy that could change the fate of the entire Sector.\n  <strong class=\"hmb\">\n   <br>\n   <br>\n   A STAND-ALONE EXPANSION\n  </strong>\n  <br>\n  <i>\n   <i>Warhammer 40,000: Inquisitor - Prophecy</i>\n  </i>\n  is a stand-alone expansion for the grim action-RPG\n  <i>\n   Warhammer 40,000: Inquisitor - Martyr\n  </i>\n  , set in the violent 41st millennium, when the galaxy is at constant war. Purge the unclean with the most powerful agents of the Imperium!\n  <br>\n  <br>\n  <br>\n  Now you can also carry out the Emperor’s will as a Tech-Adept Inquisitor, a former acolyte of the Adeptus Mechanicus who decided to join the Holy Ordos to become one of the mightiest agents of the Imperium; combining the sacred technological mysteries with the relentless dogma of the Inquisition, he has become an unstoppable force. Or continue the unfolding saga of the Alpha Pariah with one of the original three classes introduced in\n  <i>\n   Warhammer 40,000: Inquisitor - Martyr\n  </i>\n  in a Caligari Sector slowly succumbing to madness and war.\n  <strong class=\"hmb\">\n   <br>\n   <br>\n   KEY FEATURES\n  </strong>\n  <br>\n  <strong>\n   New class\n  </strong>\n  <br>\n  Play as a Tech-Adept Inquisitor and summon and enhance units in battles to help you defeat enemies and complete investigations. This new summoner class comes with new unique abilities and mechanics and offers a unique skill-tree and various new melee and ranged builds.\n  <br>\n  <br>\n  <strong>\n   New and Revamped Gameplay Elements\n  </strong>\n  <br>\n  <i>\n   Inquisitor – Prophecy\n  </i>\n  offers several features of\n  <i>\n   Inquisitor – Martyr\n  </i>\n  . These include 2-4 player co-op missions, destructible environments, all previous enemy races and units, and the unique gore of the Warhammer 40,000 universe. Moreover,\n  <i>\n   Inquisitor – Prophecy\n  </i>\n  is based on the 2.0 update for\n  <i>\n   Inquisitor - Martyr\n  </i>\n  , bringing the base game’s new level cap, redesigned loot system and levelling, the new end-game, the co-op campaign mode, new items and a much faster, ARPG-focused gameplay to the stand-alone expansion too.\n  <br>\n  <br>\n  <strong>\n   New Campaign\n  </strong>\n  <br>\n  The story that began in\n  <i>\n   Inquisitor – Martyr\n  </i>\n  continues in three new and stand-alone chapters, with one chapter solely focusing on the Tech-Adept Inquisitor investigating a great mystery which slowly ties into the unfolding plot.\n  <br>\n  <br>\n  <strong>\n   New Settings\n  </strong>\n  <br>\n  Discover sacred monasteries, perilous research sanctums, unforgiving deserts and ruthless worlds churning with molten lava.\n  <br>\n  <br>\n  <strong>\n   New Enemy Races\n  </strong>\n  <br>\n  <i>\n   Inquisitor – Prophecy\n  </i>\n  introduces the Aeldari, including Howling Banshees, Fire Prisms, Warp Spiders and Swooping Hawks; and the Tyranids, including Carnifexes, Zoanthropes, Hormagaunts, Raveners – and many others.\n </body>\n</html>", "user_ratings": {"steam_percent|decimal": 0.79, "display_user_ratings": "steam_overall", "review_text": "Mostly Positive", "steam_count": 1795}, "developers": [{"developer-name": "NeocoreGames", "developer-url": "https://neocoregames.com/en"}], "item_content_type": "game"}, "warhammer_chaosbane": {"human_name": "Warhammer: Chaosbane", "machine_name": "warhammer_chaosbane", "youtube_link": "LAKtEPc-1tI", "callout": null, "publishers": [{"publisher-name": "Nacon", "publisher-url": "https://www.bigben-interactive.co.uk/"}], "side_box_art_text": null, "third_party_subscribe_text": null, "min_price|money": {"currency": "USD", "amount": 6.0}, "subtitle_html": null, "description_text": "<i> “Keep your eyes on this one, because it’s one quality Action RPG” – Entertainment Buddha</i><br><br>In a world ravaged by war and dominated by magic, you are the last hope for the Empire of Man against the Chaos hordes. Playing solo or with up to 4 in local or online co-op, choose a hero from 5 character classes with unique and complementary skills, and prepare for epic battles wielding some of the most powerful artefacts of the Old World. <br><br>• <strong> THE FIRST HACK AND SLASH </strong> set in the Warhammer Fantasy world, told through an all-new story written by Mike Lee (a Black Library author) and featuring a soundtrack composed by Chance Thomas. <br><br>• <strong> FEROCIOUS BATTLES: </strong> from the sewers of Nuln to the ruined streets of Praag, fight your way through monster hordes using over 180 different powers. Activate your bloodlust, a devastating skill, to escape the most perilous situations. <br><br>• <strong> 5 CHARACTER CLASSES </strong> , each with unique skills and customisation: a soldier of the Empire who can take heavy damage, a Dwarf specialised in melee combat, a High Elf who deals ranged damage by manipulating magic, a Wood Elf who lays deadly traps and wields the bow like no other, or a versatile Dwarf Engineer who can blow off steam, literally! <br><br>• <strong> AN XXL BESTIARY </strong> with over 70 monsters aligned with the Chaos Gods and unique bosses. Battle Nurgle's minions, Khorne's spawn and waves of other vile creatures! <br><br>• <strong> OPTIMIZED FOR CO-OP </strong> : solo or with up to 4 players, local or online, the class synergy and interface have been designed for co-op. Combine different skills and powers to create even more devastating effects. <br><br>• <strong> HIGH REPLAY VALUE </strong> : Story mode, a boss rush mode, countless dungeons and regular updates offer a rich and varied gaming experience. And with 10 difficulty levels, you can find the right challenge to test your abilities.", "user_ratings": {"steam_percent|decimal": 0.56, "display_user_ratings": "steam_overall", "review_text": "Mixed", "steam_count": 2350}, "developers": [{"developer-name": "Eko Software", "developer-url": "http://www.ekosystem.com/"}], "item_content_type": "game"}, "coralguardian": {"human_name": "Coral Guardian", "machine_name": "coralguardian", "youtube_link": null, "callout": null, "publishers": [], "side_box_art_text": null, "third_party_subscribe_text": null, "msrp_price": null, "subtitle_html": null, "description_text": "<span><em>Donations to support&nbsp;Coral Guardian&nbsp;are made to <a href=\"https://support.humblebundle.com/hc/en-us/articles/205183597\" target=\"_blank\" rel=\"noopener\">PayPal Giving Fund</a>, subject to its policies.</em><br><br>Coral Guardian's mission is to protect and restore coral ecosystems worldwide, by working hand in hand with local communities who depend on them.</span>", "user_ratings": {}, "developers": [], "item_content_type": null}, "warhammer40000_dakkasquadron_flyboyzedition": {"human_name": "Warhammer 40,000: Dakka Squadron - Flyboyz Edition", "machine_name": "warhammer40000_dakkasquadron_flyboyzedition", "youtube_link": "JJhse_lgDOM", "callout": "<span data-sheets-root=\"1\">Fast-paced Aerial Shooter</span>", "publishers": [], "side_box_art_text": null, "third_party_subscribe_text": null, "min_price|money": {"currency": "USD", "amount": 6.0}, "subtitle_html": null, "description_text": "<strong class=\"hmb\"><i>Warhammer 40,000: Dakka Squadron - Flyboyz Edition</i>. </strong> <br><strong> Blazing, Ork aerial combat waged across 41st millennium battlefields. </strong> <br><br>Dakka Squadron is a fast-paced, aerial shooter where you are an Ork Flyboy, taking to the skies to do what Orks do best - fight! <br><br>Fly across alien worlds, against insane odds, blasting away with your Supa-Shootas to destroy enemy air forces and ground targets, while unlocking new weapons and upgrading your plane to be the most “dead killy” Flyboy in the sky. <br><br>Choose an Ork Clan and customize your jet to augment your play style. <br><br>Fly Dakkajets, Burna-Bommas, and Blitza-Bommas, equip them with an array of guns, bombs, and missiles, learn special maneuvers, and unleash your dakka and test your mettle against your fellow Flyboys in a deathmatch multiplayer mode, and against deadly enemies in the campaign. <strong class=\"hmb\"> <br><br>Features: </strong> <br><br><strong> Orky Campaign: </strong> <br>\n<ul>\n<li>Fly your way through the campaign where the Orks squabble over who will lead them on a new Waaagh! </li>\n<li>Explore incredible environments across multiple planets in the single-player campaign. </li>\n<li>Fantastic voice acting and dialog unveil a plot that captures the grim humour of the Warhammer 40,000 universe</li>\n</ul>\n<br><strong> Burn da Skies: </strong> <br>\n<ul>\n<li>Master dog fighting, dive bombing, and carpet bombing and use different playstyles to complete varied air to air, and air to ground missions. </li>\n<li>Use barrel rolls, snap turns, and boosts to avoid any incoming fire or to turn da tables on yer enemies! </li>\n<li>Blast other players and AI to zog, in the deathmatch multiplayer mode. Bring your jets from your campaign loaded for war! </li>\n<li>Complete missions and amass teef to unlock powerful Orky weapons and receive gubbinz upgrades. </li>\n<li>Game pad support. </li>\n<li>The first video game built from the ground up by Orks for Orks.</li>\n</ul>", "user_ratings": {"steam_percent|decimal": 0.81, "display_user_ratings": "steam_overall", "review_text": "Very Positive", "steam_count": 257}, "developers": [{"developer-name": "Phosphor Game Studios", "developer-url": "https://www.phosphorgames.com/"}], "item_content_type": "game"}, "warhammer40k_mechanicus": {"human_name": "Warhammer 40,000: Mechanicus", "machine_name": "warhammer40k_mechanicus", "youtube_link": "9C7KgTVoYCE", "callout": "92% Positive on Steam<br><br>Wishlist Warhammer 40,000: Mechanicus II, coming soon", "publishers": [{"publisher-name": "Kasedo Games", "publisher-url": "https://www.kasedogames.com/"}], "side_box_art_text": null, "third_party_subscribe_text": null, "min_price|money": {"currency": "USD", "amount": 6.0}, "subtitle_html": null, "description_text": "Take control of one of the most technologically advanced armies in the Imperium - The Adeptus Mechanicus. As Magos Dominus Faustinius, you’ll lead the expedition on the newly rediscovered Necron planet of Silva Tenebris. Customize your team, manage resources, discover long-forgotten tech, and control your Tech-Priests’ every move. <br><br>Your every decision will shape the missions ahead and ultimately decide the fate of the troops under your command in over 50 hand-crafted missions. Choose your path carefully - the Imperium depends on it. <strong class=\"hmb\"> <br><br>Augment </strong> <br>Flesh is weak! Upgrade your Tech-Priests with weapons, support items, Servo-Skulls and other mechanical augments as you assemble your cohort. Customize your team’s disciplines, choosing from multiple character classes to create a squad for every playstyle.<strong class=\"hmb\"><br><br>Unique Tactical Combat </strong> <br>Engage in immersively strategic combat that will test your mettle under the extreme pressure of the xenos ambush. Access your most powerful weapons and abilities by using Cognition Points and advance on your enemy without pause. Fear not, the Omnissiah favours the brave.<strong class=\"hmb\"><br><br>The Library of Immersion </strong> <br>A compelling story written by Black Library author, Ben Counter, specifically crafted to fit the unique personality of the Adeptus Mechanicus faction, with each character having their own personalities and agendas. Feel the tension and admire the devotion with unique visual effects and breathtaking audio.<strong class=\"hmb\"><br><br>Difficult Decisions </strong> <br>Make tough decisions that will forge the future from your Ark Mechanicus, The Caestus Metalican, and send you towards alternate endings for a truly unique playthrough. Be warned, however, the more you explore each tomb, the greater the rewards but also greater the threat.<strong class=\"hmb\"><br><br>Canticles of the Omnissiah </strong> <br>Collect in-game achievements and be rewarded with strong abilities that can be used once per mission to aid you in the heat of battle.<strong class=\"hmb\"><br><br>and so much more</strong><br><br><a> https://store.steampowered.com/app/673880/Warhammer_40000_Mechanicus/ </a>", "user_ratings": {}, "developers": [{"developer-name": "Bulwark Studios", "developer-url": "http://www.bulwarkstudios.com/en/"}], "item_content_type": "game"}, "warhammer40000_battlesector-bloodangelselites": {"human_name": "Warhammer 40,000: Battlesector - Blood Angels Elite", "machine_name": "warhammer40000_battlesector-bloodangelselites", "youtube_link": "nMZvdzzMreY", "callout": null, "publishers": [{"publisher-name": "Slitherine Ltd.", "publisher-url": "https://www.slitherine.com/"}], "side_box_art_text": null, "third_party_subscribe_text": null, "min_price|money": {"currency": "USD", "amount": 12.0}, "subtitle_html": null, "description_text": "Two new elite units join the Blood Angels in their fight for the liberation of Baal Secundus: the\n<strong>\n Assault Terminators\n</strong>\nand the\n<strong>\n Sanguinary Guard\n</strong>\n.\n<strong class=\"hmb\">\n <br>\n <br>\n Assault Terminators\n</strong>\n<br>\nAssault Terminators bear the most highly prized artefacts of the Blood Angels Armoury. Each suit of Terminator armour is a masterfully crafted machine of war, with thousands of battles worth of wear and tear. These honoured relics are bestowed upon the elite warriors of the 1st Company, and their missions are always to spearhead the most difficult and dangerous assaults.\n<br>\n<br>\nAssault Terminators have a choice of devastating melee weaponry to choose from, and can use their Deep Strike ability to pick and eliminate high value targets. Lightning Claws help to claw out swarms of gaunts, while the Thunder Hammer and Storm Shield combo upgrades the Terminators into monstrous hunters that can withstand the most punishing of assaults.\n<strong class=\"hmb\">\n <br>\n <br>\n Sanguinary Guard\n</strong>\n<br>\n<br>\nDante’s personal bodyguard, the Sanguinary Guard are the exemplars of the Blood Angels nobility and skill. The finest warriors and advisors of the Chapter, their skills in combat pay homage to the Great Angel Sanguinius, their Lord Commander Dante, and the first of the Sanguinary Guard, Azkaellon.\n<br>\n<br>\nThe Sanguinary Guard have a wide range of utility, including ornate Jump Packs that help them across the battlefield, and an armoury's worth of wargear options. Wrist-mounted Angelus Boltguns and Inferno Pistols can stop enemy assaults in their tracks, while Encarmine Swords and Axes can cut through even the toughest of xenos armour. Additionally, the Heirs of Azkaellon ability lets the Sanguinary Guard strike with superior precision and fury, the power of which is boosted when the Guard is adjacent to their HQ Commander.\n<br>\n<br>\n<i>\n With this DLC the Assault Terminators and Sanguinary Guard can be added to your army in the Age of Crimson Dawn single player story campaign, and your single-player skirmish and multiplayer armies.\n</i>", "user_ratings": {"steam_percent|decimal": 0.85, "display_user_ratings": "steam_overall", "review_text": "Very Positive", "steam_count": 55}, "developers": [{"developer-name": "Black Lab Games", "developer-url": "https://blacklab.games/"}], "item_content_type": "game"}}, "charity_data": {"charity_items": {"coralguardian": {"machine_name": "coralguardian", "youtube_link": null, "item_content_type": null, "subtitle_html": null, "description_text": "<span><em>Donations to support&nbsp;Coral Guardian&nbsp;are made to <a href=\"https://support.humblebundle.com/hc/en-us/articles/205183597\" target=\"_blank\" rel=\"noopener\">PayPal Giving Fund</a>, subject to its policies.</em><br><br>Coral Guardian's mission is to protect and restore coral ecosystems worldwide, by working hand in hand with local communities who depend on them.</span>", "human_name": "Coral Guardian", "developers": [], "publishers": [], "user_ratings": {}}}}, "from_bundle": {"machine_name": "waaaghtoberwarhammerbundle_bundle", "tile_short_name": "WAAAGHtober! A Warhammer Bundle", "short_marketing_blurb": "200+ hours of Warhammer games", "marketing_blurb": "Get <em>Warhammer: Chaosbane</em>, <em>Warhammer: Vermintide 2</em>, <em>Warhammer 40,000: Battlesector</em>, <em>Warhammer 40,000: Inquisitor - Martyr</em>, <em>Warhammer 40,000: Inquisitor - Prophecy</em>, and more!", "detailed_marketing_blurb": "WAAAGH! War on an apocalyptic scale has arrived—how will you defend the Imperium? Gather your arms for the exciting Warhammer adventures within this action-packed bundle running throughout October! Sink your teeth into the very best from the Warhammer universe with brutal gunplay, blood-soaked narratives, and so much more. Bring glory to mankind as Captain Titus, a hardened hero tasked with retaking the Imperial Forge World from Orks in Warhammer 40,000: Space Marine - Anniversary Edition. Or test your tactical mettle in Warhammer 40,000: Battlesector, the turn-based strategy experience steeped in grimdark warfare.", "author": "Publishers", "start_date|datetime": "2025-10-01T20:00:00", "end_date|datetime": "2025-10-30T01:00:00", "type": "bundle", "product_url": "/games/waaaghtober-warhammer-bundle"}, "updated_at|datetime": "2025-10-02T03:11:50.213845", "first_seen_at|datetime": "2025-10-02T03:11:50.213845"}
